{"title":"uTorrent 3.2 Build 27568 Stable Incl Language Pack","uid":7418508,"size":1914169,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:000ac88e37dca0c992739dbd393faa5f6de41c9c&amp;dn=uTorrent+3.2+Build+27568+Stable+Incl+Language+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mrriser007","files":-1,"time":1341595416,"description":"Î¼Torrent - a fairly powerful, free client network BitTorrent, continually receives the best reviews. Among the main advantages of uTorrent\n\n\nan impressive (for the small size of the program) set of features, stable operation, support obsolete &quot;hardware&quot; and the older versions of Windows. uTorrent is designed so that it consumes minimal system resources, providing at the same time, opportunities, even compared with much large-sized customers BitTorrent (such as Vuze or BitComet). Î¼Torrent is a single executable file and the installation does not alter any system settings. uTorrent Key Features : - limit the maximum speed and efficiency of downloading and configuring, depending on the time. - Caching files on your hard disk (s). - Support DHT and PeerExchange. - the first distribution mode (Super Seeding). - Automatic download torrents from RSS feeds. - Ability to connect to the tracker on HTTPS. - Unicode support for all versions of Windows. - UPnP Support in all versions of Windows. - Ample opportunities for setting up uTorrent interface. - uTorrent interface is available in 38 languages, including Russian and Ukrainian. - Web-based interface (remote control uTorrent from your browser). Release Highlights : -Show When Files are allocating INSTEAD of Disk Overload. Make the user-interface use less CPU. -Refresh Add Torrent dialog with magnet link Metadata.Changelog\nOS : Windows XP/Vista/7.\n\nRead more:\n","torrent":{"xt":"urn:btih:000ac88e37dca0c992739dbd393faa5f6de41c9c","amp;dn":"uTorrent+3.2+Build+27568+Stable+Incl+Language+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"000ac88e37dca0c992739dbd393faa5f6de41c9c","infoHashBuffer":{"type":"Buffer","data":[0,10,200,142,55,220,160,201,146,115,157,189,57,63,170,95,109,228,28,156]},"announce":[],"urlList":[]}}