{"title":"Bob Hope - The Road to Laughter","uid":6848191,"size":1051380841,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:006c5299fd59209628d2b973d5794a70f61ae0db&amp;dn=Bob+Hope+-+The+Road+to+Laughter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1322423046,"description":"Bob Hope - The Road to Laughter \n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1174kbps \nDuration.............: 59:36.242\nResolution...........: 600*456 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 224 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 630,340,164 \n\n\nBob Hope - The Road to Laughter Bonus Material\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1190kbps \nDuration.............: 39:18.246\nResolution...........: 600*456 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 224 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 420,531,150 \nNO SUBTITLES\n\n &lt;a href=&quot;\nhttp://bayimg.com/CALmfAADb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CALmfAADb&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0402858/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0402858/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.amazon.com/Bob-Hope-Laughter-Fred-Applegate/dp/B0000DI4S6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Bob-Hope-Laughter-Fred-Applegate/dp/B0000DI4S6&lt;/a&gt;\n\n\nCustomer Reviews\n\nThis review is from: Bob Hope - The Road to Laughter (DVD)\n\nNumerous clips (over 90!) from Bob Hope's over a quarter century of popular feature film appearances highlight this well-made film that is heartily recommended to fans of the great comic actor, and who might enjoy a compendium of Hope's cinema appearances, with material gathered from among his finest efforts, and intensified by knowledgable commentary from Leonard Maltin and from a quartet of Hope's most creative writers throughout his lengthy performing career as an entertainer. Maltin provides a background for the Hope filmography, with informative narration in conjunction with several extended scenes from such comedic classics as the &quot;Road&quot; films (TO MOROCCO/SINGAPORE/UTOPIA/ZANZIBAR), along with THE BIG BROADCAST OF 1938, THE PALEFACE, MONSIEUR BEAUCAIRE, and other pictures that are marked by Hope's perfection with timing, and benefiting as well from other players of a high order, personified here by the complete episode from BROADCAST wherein Bob and Shirley Ross introduce what became his theme: &quot;Thanks for the Memory&quot;. The four gag writers interviewed are Larry Gelbart, Mort Lachman, Sherwood Schwartz and Melville Shavelson and they furnish a multitude of insights into those specific elements that have made Hope one of the most accessible of all motion picture comedians, such as his talent at being able to incorporate audiences directly into scenes, in addition to his ongoing persona as a movie Everyman who desperately wishes to accomplish greater achievements than his ability can manage. \n\nDuring the course of this hour-long work, Hope's skill with ad libbing, one shared with Bing Crosby, is stressed, as also is his versatility, having proved to be equally adept as a monologist as he is while functioning at physical comedy. A well-produced Hart Sharp DVD contains a 39 minute bonus segment of interview footage, not seen with the original American Public Television broadcast, with the mentioned writers, from whom a raft of perceptions comes tumbling. In addition to numerous personal anecdotes, Hope's early background in vaudeville and radio is discussed, as is his innovative usage of current events injected into his radio show; his insistence upon brevity for gaglines; Paramount Pictures' uncertainty as to how to utilize its popular property, eventually pairing him with Crosby; his potent ability to project a personality, assisted by his background as a dancer; and there is a great deal more. In sum, viewers will find this a consistently interesting and instructive film.","torrent":{"xt":"urn:btih:006c5299fd59209628d2b973d5794a70f61ae0db","amp;dn":"Bob+Hope+-+The+Road+to+Laughter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"006c5299fd59209628d2b973d5794a70f61ae0db","infoHashBuffer":{"type":"Buffer","data":[0,108,82,153,253,89,32,150,40,210,185,115,213,121,74,112,246,26,224,219]},"announce":[],"urlList":[]}}