{"title":"Spotnicks - The Spotnicks in Gothenburg (1965)  FLAC","uid":6785651,"size":317340600,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:017022aa62692c472ded5c96e69023f4e0a43c47&amp;dn=Spotnicks+-+The+Spotnicks+in+Gothenburg+%281965%29++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"keeybee","files":31,"time":1320078204,"description":"Please seed!\n\nThe Spotnicks is an instrumental rock group from Sweden, who were formed in 1961. They were famous for wearing &quot;space suit&quot; costumes on stage, and for their innovative electronic guitar sound. They have since released 42 albums, selling more than 18 million records, and still tour.\nThe Spotnicks originated from Bo Starander and BjÃƒÂ¶rn Thelin's duo &quot;The Rebels&quot; (1956), who later became &quot;Rock-Teddy and The Blue Caps&quot;, a group formed in 1957 in Gothenburg now with guitarist Bo Winberg (born 27 March 1939) in the band as well as Bo Starander (born 11 March 1942) (rhythm guitar), and BjÃƒÂ¶rn Thelin (born 27 June 1942) (bass guitar). In 1958 they added Ove Johansson (drums), changed their name to &quot;The Frazers&quot;, and began playing regularly in local clubs. They signed a recording contract in 1961, and changed their name\nto &quot;The Spotnicks&quot;, a play on the Russian satellite Sputnik as suggested by their manager, Roland Ferneborg. Starander was later known as Bob Lander. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Spotnicks&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Spotnicks&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.spotnicks.net/uk/index_uk.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.spotnicks.net/uk/index_uk.htm&lt;/a&gt;\n\nThis is one of 3 CDs in the 2009 release &quot;3 Original Album Classics&quot;:\nThe Spotnicks (at home) in Gothenburg,\nThe Spotnicks in Tokyo and\nThe Spotnicks in Winterland\n\nThe Spotnicks - The Spotnicks in Gothenburg\noriginal album 1965\nCD produced 1990\n\n01  The Spotnicks - The Spotnicks in Gothenburg - In the mood\n02  The Spotnicks - The Spotnicks in Gothenburg - I'm coming home\n03  The Spotnicks - The Spotnicks in Gothenburg - Space walk\n04  The Spotnicks - The Spotnicks in Gothenburg - You can go to him\n05  The Spotnicks - The Spotnicks in Gothenburg - Busted\n06  The Spotnicks - The Spotnicks in Gothenburg - I'll never get you\n07  The Spotnicks - The Spotnicks in Gothenburg - How can you leave me like that\n08  The Spotnicks - The Spotnicks in Gothenburg - One has my name\n09  The Spotnicks - The Spotnicks in Gothenburg - Big Jump\n10  The Spotnicks - The Spotnicks in Gothenburg - I'm around\n11  The Spotnicks - The Spotnicks in Gothenburg - I remember you\n12  The Spotnicks - The Spotnicks in Gothenburg - Walk right in\n13  The Spotnicks - The Spotnicks in Gothenburg - Lovesick Blues\n14  The Spotnicks - The Spotnicks in Gothenburg - I've lost you\n15  The Spotnicks - The Spotnicks in Gothenburg - Alabamy bound\n16  The Spotnicks - The Spotnicks in Gothenburg - Take five\n17  The Spotnicks - The Spotnicks in Gothenburg - Space creatures\n18  The Spotnicks - The Spotnicks in Gothenburg - Big Boss man\n19  The Spotnicks - The Spotnicks in Gothenburg - Bye bye Blues","torrent":{"xt":"urn:btih:017022aa62692c472ded5c96e69023f4e0a43c47","amp;dn":"Spotnicks+-+The+Spotnicks+in+Gothenburg+%281965%29++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"017022aa62692c472ded5c96e69023f4e0a43c47","infoHashBuffer":{"type":"Buffer","data":[1,112,34,170,98,105,44,71,45,237,92,150,230,144,35,244,224,164,60,71]},"announce":[],"urlList":[]}}