{"title":"Freddie as F.R.O.7.","uid":6709737,"size":370623712,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:031055a3aa614db4e03164d8478e3ff59d7105c9&amp;dn=Freddie+as+F.R.O.7.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chiddy29","files":1,"time":1317309323,"description":"The story about a man-sized frog named Prince Frederic who is turned into a frog by his wicked aunt Messina and hired by British Intelligence to solve the mysterious disappearances of some of Britain's greatest monuments. Several hundred years later, Freddie is now living in modern day Paris -- a six-foot-tall amphibian with the moniker Secret Agent F.R.O.7. Messina, too, is still around causing mischief, joining forces with an arch-villain named El Supremo in a scheme to shrink Big Ben. Freddie, alerted to Messina's nefarious plans, gathers his fellow agents Daffers and Scottie together, planning to hide out in Big Ben and surprise the evil doers when they are set to strike at the much-loved British landmark.\n\n\n\nfirstly let me say that i looked everywhere for this movie but in the end gave up and spliced it together from a copy of the movie from youtube. this being the case there are a few points were there was clearly a cut in the move that has been patched. there is nothing missing i promis. also this is why the quality is poor and the sund is poor. \n\nalso as i am cursed with being in australia and suffering from download/upload limits i will seed for as long as i can but i'm not promissing to be able to seed this constantly or seedily. sorry. \n\nso everyone PLEASE SEED\n\nfinaly this is my first torrent so if there is an issue that is not covered above then please let me know preferably with a suggested solution aswell.\n\nthanks","torrent":{"xt":"urn:btih:031055a3aa614db4e03164d8478e3ff59d7105c9","amp;dn":"Freddie+as+F.R.O.7.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"031055a3aa614db4e03164d8478e3ff59d7105c9","infoHashBuffer":{"type":"Buffer","data":[3,16,85,163,170,97,77,180,224,49,100,216,71,142,63,245,157,113,5,201]},"announce":[],"urlList":[]}}