{"title":"All the Rivers Run Ep 1 &amp; 2 HD H264 Matroska Video","uid":6713178,"size":7413182191,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:05fc38bffae15ec3bbcd217adcd7ebe1f6e0e787&amp;dn=All+the+Rivers+Run+Ep+1+%26amp%3B+2+HD+H264+Matroska+Video&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Doublezed","files":-1,"time":1317440081,"description":"\nVideo: MPEG4 Video (H264) 1920x1080 25.00fps [Undetermined (Video 1) [Default]]\nAudio: MPEG Audio Layer 3 44100Hz stereo 1411kbps [Undetermined (Audio 1) [Default]]\n\n\n\nGeneral\n\nFormat                           : Matroska\nFormat version                   : Version 2\nFile size                        : 3.65 GiB\nDuration                         : 51mn 28s\nOverall bit rate                 : 10.1 Mbps\nWriting application              : Lavf51.12.1\nWriting library                  : Lavf51.12.1\n\n\n\nEp2\n\nVideo: MPEG4 Video (H264) 1920x1080 25.00fps [Undetermined (Video 1) [Default]]\nAudio: MPEG Audio Layer 3 44100Hz stereo 1411kbps [Undetermined (Audio 1) [Default]]\n\nGeneral\n\nFormat                           : Matroska\nFormat version                   : Version 2\nFile size                        : 3.26 GiB\nDuration                         : 45mn 58s\nOverall bit rate                 : 10.1 Mbps\nWriting application              : Lavf51.12.1\nWriting library                  : Lavf51.12.1\n\n\n\n  In a storm off the Victorian coast in 1890, a young English girl is shipwrecked and orphaned. She is rescued heroically by the only other survivor of the wreck, who is feted and rewarded in Melbourne. The girl is taken in care by her guardian, Uncle Charles, who has made a meager fortune from gold, and settled at Echuca - the great Australian inland port on the River Murray. His ward is sixteen years old, and her name is Philadelphia Gordon. She is known as Delie. Delie is an energetic and high-spirited girl who wants to paint, and not conform. She finds it difficult to understand why her aunt Hester, a tart and unsmiling woman, seeks to impose her ideas of womanhood, femininity, even good housekeeping on a girl who needs nothing more than the freedom to lead her own life. It is her cousin, Adam, who truly awakens in Delie the feelings of young womanhood. \n\n  Tom, the seaman who rescued Delie, arrives in Echuca on a paddle steamer he bought with his reward. It is the beginning for Delie of a remarkable ten years in her life. Her investment of part of her inheritance in the riverboat is, without her knowing it, the first step towards a turbulent marriage to a riverboat man and, indeed, to the boats who ply their great trade along the mighty, unpredictable and perilous river. \n\n  In a riverboat ceremony, Delie marries Brenton Edwards, a cavalier riverman, who wins and loses the girl on their way to the alter. Their years together are as unpredictable as the river, and more than once Delie is attracted to bohemian Melbourne, and the patronage of Alistair Raeburn, the gentleman art critic, who falls in love with his protÃƒÂ©gÃƒÂ©. Yet Delie remains magnetically drawn to Brenton and the river, the crew of their paddle-steamer Philadelphia, and the river community of Echuca, friends like Bessie Griggs, a merchant's daughter, and George blakeney, the bluff rival riverboat captain. \n\n  Their community has grown from the 1850's when it was merely a river crossing, established by Henry Hopwood, an English convict. Mobs of cattle and sheep were driven across the Murray at Echuca on their way to the stockyards at Melbourne. Proudly, Delie and Brenton race the Philadelphia in dangerously narrow waters, and for a wager they cannot afford. \n\n  They dare the Darling River in drought, a dash which could go for nearly 1000 miles across outback New South Wales, in the hope that rains will wash down from Queensland and allow their escape. \n\n  In tinderbox conditions, they survive a fire which all but bankrupts them. They have a son, in a way many women did at the time on the riverbank, in circumstances far removed from Echuca, when hardened riverman became midwives. \n\n  Brenton turns against the law to find a way out of their financial maze, and the couple part before coming together again. Brenton is critically injured in a riverboat accident. It inspires Delie to turn her talents towards being a riverboat captain, to winning her own Master's Ticket. \n\t\t\n \t\t \n\nPHILADELPHIA.....Sigrid Thornton \nBRENTON..........John Waters \nCYRUS JAMES......Parker Stevenson\nUNCLE CHARLES....Charles Tingwell \nANNE HESTER......Dinah Shearing \nALISTAIR RAEBURN.Adrian Wright \nMISS BARRETT.....Diane Craig \nTOM GRITCHLEY....Gus Mecurio \n\t\t\n\t\t\n \t\t \n\nFrom the Novel by Nancy Cato Written by: Colin Free, Gwenda Marsh, \n                                         Vince Moran, Peter Yeldham \nDirected by: Pino Amenta &amp; George Miller\nProduced by: Alan Hardy \n\nAll the Rivers Run is an 8 hour mini-series from Crawfords Australia, 1983.\nFilmed on location at the Port of Echuca, Victoria, Australia.  \n\t\t\n","torrent":{"xt":"urn:btih:05fc38bffae15ec3bbcd217adcd7ebe1f6e0e787","amp;dn":"All+the+Rivers+Run+Ep+1+%26amp%3B+2+HD+H264+Matroska+Video","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05fc38bffae15ec3bbcd217adcd7ebe1f6e0e787","infoHashBuffer":{"type":"Buffer","data":[5,252,56,191,250,225,94,195,187,205,33,122,220,215,235,225,246,224,231,135]},"announce":[],"urlList":[]}}