{"title":"Best Picture - 1936 - The Great Ziegfeld","uid":6714930,"size":2361199701,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:06949b330f3d2b26746988b5f363a18c90be7b6c&amp;dn=Best+Picture+-+1936+-+The+Great+Ziegfeld&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1317504999,"description":"Best Picture - 1936 - The Great Ziegfeld \n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1390kbps \nDuration.............: 3:05:32\nResolution...........: 640*480 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 1 \nFilesize.............: 2,212,846,108 \nSUBTITLES............: Englis, French, Spanish\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0027698/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0027698/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/iAKMJaAde&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/iAKMJaAde&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Great_Ziegfeld&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Great_Ziegfeld&lt;/a&gt;\n\n\nThe Great Ziegfeld is a 1936 musical film produced by MGM. A fictionalized biography of Florenz Ziegfeld from his show business beginnings to his death, it showcases a series of spectacular musical productions. The film includes original music by Walter Donaldson and Irving Berlin. Berlin's work was featured in the Ziegfeld Follies of 1918, 1919, and 1920.\n\nThe film, which premiered in Los Angeles at the elegant Carthay Circle Theatre, was the first musical film in history for which one of its cast members won an Academy Award - Luise Rainer received the Best Actress Oscar for her portrayal of Ziegfeld's first wife, Anna Held.\n\nFeatured in the film are William Powell as Ziegfeld, Myrna Loy as Billie Burke, Luise Rainer, Nat Pendleton, and Frank Morgan. Real-life Ziegfeld performers Fanny Brice and Ray Bolger play themselves. Dennis Morgan, in an uncredited role, performed &quot;A Pretty Girl Is Like a Melody&quot; (dubbed by Allan Jones). The film was originally developed at Universal Pictures in late 1934 and in their 1935 development book appears as a pre-production, to star Powell. Due to financial problems at the studio at the time, the entire production, including some already constructed sets and musical arrangements were sold to MGM. Universal retained the services of Powell however, which ultimately resulted in his appearance in the classic screwball comedy My Man Godfrey the same year as The Great Ziegfeld.\n\nPlot\n\nThe son of a highly respected music professor, Florenz &quot;Flo&quot; Ziegfeld, Jr. (William Powell) yearns to make his mark in show business. He begins by promoting Eugen Sandow (Nat Pendleton), the &quot;world's strongest man&quot;, at the 1893 Chicago World's Fair, overcoming the competition of rival Billings (Frank Morgan) and his popular attraction, belly dancer Little Egypt, with savvy marketing (allowing women to feel Sandow's muscles).\n\nLater, on an ocean liner to England, Flo runs into Billings again and discovers that he is on his way to sign a beautiful French star, Anna Held (Luise Rainer), to a contract. Despite losing all his money gambling at Monte Carlo, Flo charms Anna into signing with him instead.\n\nAt first, Anna is not a success. However, Flo manages to generate publicity by sending many gallons of milk to Anna every day for a fictitious milk bath beauty treatment, then refusing to pay the bill. The newspaper stories soon bring the curious to pack his theater. \n\nFlo and Anna then get married.However, one success is not enough for the showman. He has an idea for an entirely new kind of show, one that will &quot;glorify&quot; the American woman. Thus, the Ziegfeld Follies is born, a lavish production filled with beautiful women. This makes Anna very nervous, as she is still performing in her own show and will be unable to keep an eye on her husband. It is a smash hit, and is followed by more versions of the Follies. Soon Flo hires Fanny Brice (playing herself) away from vaudeville and gives stagehand Ray Bolger (also playing himself) his break as well.\n\nHe also tries to make a star out of Audrey Dane (Virginia Bruce), but alcoholism turns out to be her downfall. However, a short time before, Anna becomes jealous of the attention Flo pays to Audrey and divorces Flo. Afterward, Flo meets Broadway star Billie Burke (Myrna Loy) and marries her. When she hears the news, a heartbroken Anna telephones Flo and pretends to be glad for him. Flo and Billie eventually have a daughter named Patricia.\n\nFlo has more hits, but after a while, the public's taste changes, and people begin to wonder if the times have not passed him by. Stung, he vows to have four hits on Broadway at the same time. He achieves his goal - one of those four hits being Show Boat - but then the stock market crash of 1929 bankrupts him, forcing Billie to go back on the stage. Shaken by the reversal of his financial fortunes and the growing popularity of movies over live stage shows, he becomes seriously ill. In the final scene, in a half-delirium, he recalls scenes from several of his hits, exclaiming, &quot;I've got to have more steps&quot; (a remark he made several times when examining the set designs of his Ziegeld Follies) before slumping over dead in his chair.\n\nCast\n\nWilliam Powell as Florenz Ziegfeld, Jr.\nMyrna Loy as Billie Burke\nLuise Rainer as Anna Held\nFrank Morgan as Jack Billings\nFanny Brice as Herself\nVirginia Bruce as Audrey Dane\nReginald Owen as Sampson, Flo's frequently-nervous bookkeeper\nRay Bolger as Himself\nErnest Cossart as Sidney, Billing's valet, who is hired away by Flo\nJoseph Cawthorn as Dr. Ziegfeld (as Joseph Cawthorne)\nNat Pendleton as Eugen Sandow\nHarriet Hoctor as Herself\nJean Chatburn as Mary Lou\nPaul Irving as Erlanger, Billing's later partner\nHerman Bing as Costumer\nBuddy Doyle as Eddie Cantor\nAlso appearing uncredited is future First Lady Pat Nixon (as a Ziegfeld Girl), Mickey Daniels as a telegram delivery boy, and Dennis Morgan as the vocalist (dubbed by Allan Jones) in the &quot;Pretty Girl&quot; number","torrent":{"xt":"urn:btih:06949b330f3d2b26746988b5f363a18c90be7b6c","amp;dn":"Best+Picture+-+1936+-+The+Great+Ziegfeld","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06949b330f3d2b26746988b5f363a18c90be7b6c","infoHashBuffer":{"type":"Buffer","data":[6,148,155,51,15,61,43,38,116,105,136,181,243,99,161,140,144,190,123,108]},"announce":[],"urlList":[]}}