{"title":"Pink Floyd - Under Construction, MP3 @320kpbs","uid":6756265,"size":177033293,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:07021b08097e24430d6b26c4d8beaec43644397c&amp;dn=Pink+Floyd+-+Under+Construction%2C+MP3+%40320kpbs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Beolab1700","files":29,"time":1319043478,"description":"Pink Floyd's The Wall (1979) stands as one of Pink Floyd's greatest achievements,\nas well of one of the greatest achievements in rock music and live concert \nproduction. The album spawned a tour, a film, a book of the film (now quite \ncollectible), and eventually an all-star revival concert in Berlin, and finally \nin 1999 a double live album. But before The Wall was a film, a concert, or even\nan album, The Wall was just an idea... an idea under construction. The Wall went\nthrough at least two &quot;demo&quot; stages. The first was a crude recording of Roger \nWaters strumming his guitar and singing alone. Presented by Waters at the same \ntime as another concept called The Pros and Cons of Hitch Hiking, Waters' first \ndemo - still uncirculated even today - was deemed unlistenable by the rest of the\nband, but they felt it had potential. The Hitchhiking demo was set aside, but The\nWall demo was developed further. Many writing sessions later, Pink Floyd - probably\nwith assistance from Bob Ezrin - recorded a second, more complete demo. The lyrics\nwere not polished, and neither was the music. Thankfully, lyrics like &quot;I am a \nphysician/ who can handle your condition/ like a magician&quot; would be entirely \ndiscarded and rewritten before the songs were finally committed to tape in a studio,\nbut the rough lyrics and the risky musical experiments which appeared in that \nsecond demo have finally made it to the public.\n","torrent":{"xt":"urn:btih:07021b08097e24430d6b26c4d8beaec43644397c","amp;dn":"Pink+Floyd+-+Under+Construction%2C+MP3+%40320kpbs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07021b08097e24430d6b26c4d8beaec43644397c","infoHashBuffer":{"type":"Buffer","data":[7,2,27,8,9,126,36,67,13,107,38,196,216,190,174,196,54,68,57,124]},"announce":[],"urlList":[]}}