{"title":"Jazz Argentino En La Universidad -- Ruben &quot;Baby&quot; Lop","uid":6747094,"size":164510772,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:081f4249988d7d9aa5432373573e86e2af992fd8&amp;dn=Jazz+Argentino+En+La+Universidad+--+Ruben+%26quot%3BBaby%26quot%3B+Lop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"maquih79","files":-1,"time":1318742271,"description":"Ruben Lopez Furst\nJazz Argentino En La Universidad\n\nRuben &quot;Baby&quot; Lopez Furst was born in Buenos Aires on June 26, 1937 and dies in the same city on July 25, 2000. He is one of the most important pianist in the history of Argentinean Jazz.  Unlike some Argentinean Jazz musicians who decided to try their luck abroad --Leandro &quot;Gato&quot; Barbieri, Boris Claudio &quot;Lalo&quot; Schiffrin, Jorge Dalto, Jorge Anders, Fernando Gelbard and Hector Costa &quot;Costita&quot;, to name a few--, &quot;Baby&quot; opted to stay in the country.\n\nThe move moarked his career, as well as a majority of talented peers' who chose the same destiny; living solely from Jazz in Argentina was and continues to be practically impossible. Many generations of Argentinean musicians have had to diversify their careers and dedicate themselves simultaneously to performing as studio musiciains, composing music for advertisement, movies and shows and composing music for other people. The limited local market has also meant a scarce number of local recordings, despite the permeation of the music scene. Regardless, the critics have always been favorable, and Lopez has receive notable awards and mentions such as the Konex Foundation's best Jazz soloist award in 1985, 1992, and 2005, and a 1982 award from Prensario magazine which placed him among the top three Jazz pianists in Argentina.","torrent":{"xt":"urn:btih:081f4249988d7d9aa5432373573e86e2af992fd8","amp;dn":"Jazz+Argentino+En+La+Universidad+--+Ruben+%26quot%3BBaby%26quot%3B+Lop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"081f4249988d7d9aa5432373573e86e2af992fd8","infoHashBuffer":{"type":"Buffer","data":[8,31,66,73,152,141,125,154,165,67,35,115,87,62,134,226,175,153,47,216]},"announce":[],"urlList":[]}}