{"title":"Oh My Friend (2011)","uid":6751386,"size":25936340,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:085669e46d145424b166b5a43ae36cad0aab93b6&amp;dn=Oh+My+Friend+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"culuday","files":7,"time":1318888652,"description":"Oh My Friend telugu mp3 songs\n\n\nMusic director Rahul raj is a network engineer who worked in England for 3 years before becoming fulltime music director. Wife is a German. He is a Malayali.\n \nSiddharth sings 2 songs. He performs one live now, shruti joins him - a song of friendship - starts like sri chaitanya junior college. The song is siuperb fun.\n\nShruti talks in decent Telugu during her speech. Songs are fresh n young, she says.\n\nSirivennela pens 3 songs. Took 6 months to pen a song. But dil raju wanted to use it for another film and requests him for a fresh song.\n\nNavdeep does a wonderful skit on love n friendship. He says that this movie is about thin line between love n friendship.\n\nKiller dialogue by Navdeep - adi abbailaku ammailaku teliyali. Naaku kaadu ... He quickly clarifies as crowds goes frenzy\n\nVenu Sreeram - sukumar, bhaskar, vamsi, srikanth n all raju's directors supported me. have all elements of an entertainer. A spl element is also there in the movie.\n\nSiddharth sings a rock song. Maa daddy pockets song. Heavy metal stuff. True to the occasion, Sid wears Led Zepplin t shirt for this rock song.\n\nVenu sreeram follows 'written n directed by' than regular 'story - screenplay - \ndirection' credits.\n\nDirectors of dil raju (except sukumar n bhaskar) are the guests for the night.\n\nKrishna chjaitanya pens 4 songs. He says that music director Anil was my best friend. Completed 100 songs. Sri chaitanya junior college song was composed by anil who died recently. \n\nDOP vijay offered to work for free after listening to story. He speaks quite good telugu.\n\nDil raju - prema desam was my fav film in youth. ppl danced in theaters. Happy Days has also witness the same frenzy. I am sure Oh My Friend will create magic.\n\nDil Raju - Film explores the subject of friendship. This film is about unconditional friendship.\n\nDil Raju - Venu and srikanth came to us when we were down for a couple films and gave us courage. Venu shot OMF in 85 days.\n\nVenu selected music director rahul raj after listening to his songs on net.\n\nSid talks about close releases of pokiri n bommarillu in 2006. Now dookudu and oh my friend releasing with50 days gap.\n\nSid - Venu sreeram is the 9th debut director for me. He waited for me to 2 and half \nyears. I played character of chandu. Wish that I will get dookudu luck for OMF just like I got Pokiri luck for Bommarillu.\n\n11 - 11 - 11 is the release date of Oh My Friend. A Nelson number.","torrent":{"xt":"urn:btih:085669e46d145424b166b5a43ae36cad0aab93b6","amp;dn":"Oh+My+Friend+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"085669e46d145424b166b5a43ae36cad0aab93b6","infoHashBuffer":{"type":"Buffer","data":[8,86,105,228,109,20,84,36,177,102,181,164,58,227,108,173,10,171,147,182]},"announce":[],"urlList":[]}}