{"title":"Ashampoo Snap v5.1.5[NepsterJay]","uid":7518493,"size":20430266,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:099bf87c1f38db6cf5fbbac419cd5e90ce8be904&amp;dn=Ashampoo+Snap+v5.1.5%5BNepsterJay%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NepsterJay","files":1,"time":1344545943,"description":"Ashampoo Snap is a feature rich screen capturing tool, for taking screenshots and screencasts.\n\nLike most screen capture tools, you can set hot keys for many of the capture features with Ashampoo Snap. You can choose to capture a window, fixed region, scrolling window, a free style region and more. You can also choose the output format, BMP, JPG, PNG or PDF. Once you've take your shot, there is a basic editing suite, where you can add some effects, text, arrows and so on. The interface is unusual, but really easy to use.\n\nWith video capture, Ashampoo Snap is also really easy - choose what you want to capture, whether it's the full desktop, a portion, or a particular application, and click start. And if you want to capture onscreen video, there's a special setting on Ashampoo Snap for that too.\n\nAshampoo Snap is not the simplest capture application available, but it's certainly rich in features, and is well designed. The video capture is really good, and makes simple screencasts and tutorials really easy to do. It's by no means a professional video editing studio, but for most people it will do just fine.\n\nLanguage: English \nOS: Windows 2000/ XP / Vista / 7 / 8","torrent":{"xt":"urn:btih:099bf87c1f38db6cf5fbbac419cd5e90ce8be904","amp;dn":"Ashampoo+Snap+v5.1.5%5BNepsterJay%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"099bf87c1f38db6cf5fbbac419cd5e90ce8be904","infoHashBuffer":{"type":"Buffer","data":[9,155,248,124,31,56,219,108,245,251,186,196,25,205,94,144,206,139,233,4]},"announce":[],"urlList":[]}}