{"title":"Beyond Good and Evil Portable - [Espera]","uid":6746814,"size":1698898571,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:09ef9c3808f7e95a580051556a1c90df5a942336&amp;dn=Beyond+Good+and+Evil+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1318723007,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Beyond Good And Evil 1 Click.exe&quot;\n3.Enjoy.\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nBeyond Good &amp; Evil is an action-adventure video game developed and published by Ubisoft and released in late 2003 for the GameCube, Microsoft Windows, PlayStation 2, and Xbox platforms. The story follows the adventures of Jade, an investigative reporter and martial artist, who works with a resistance movement to reveal a planet-wide alien conspiracy. The player controls Jade and allies, solving puzzles, fighting enemies, and obtaining photographic evidence.\n\nA full HD, re-mastered, version of the game was released on Xbox Live Arcade in March 2011 and on PlayStation Network in June 2011.[2][3] It features improved character models, textures, and soundtrack. Achievements, trophies and online leaderboards were also added.[4]\n\nMichel Ancel, creator of the Rayman series, envisioned the game as the first part of a trilogy. Beyond Good &amp; Evil was a commercial failure due to its ill-timed release and lack of popularity; however, it was critically acclaimed and received a nomination for &quot;Game of the Year&quot; at the 2004 Game Developers Choice Awards. The sequel, Beyond Good &amp; Evil 2, is currently in development.\n\nBeyond Good &amp; Evil is an action-adventure game with elements of puzzle-solving and stealth-based games.[6] The player controls the protagonist, Jade, from a third-person perspective. Jade can run, move stealthily, jump over obstacles and pits, climb ladders, push or bash in doors and objects, and flatten herself against walls.[7] As Jade, the player investigates installations in search of the truth about a war with an alien threat.[6]\n\nIn the game's interior spaces, the player solves puzzles and make their way past enemies in order to reach areas containing photographic evidence.[6] Jade's main tools are her Dai-jo combat staff (a melee weapon), discs for attacking at range, and a camera.[8] Jade's health decreases when attacked by enemies, and health can be restored by using fictional food items &quot;Starkos&quot; and &quot;K-Bups&quot;. She can also gain extra hearts by collecting PA-1s. If Jade's health is depleted, she will restart at the last checkpoint. Certain stealth segments later in the game will automatically kill Jade if she is detected.\n\nAt times, it is only possible to advance in the game with the help of other characters. The characters are computer-controlled, and players direct them via contextual commands.[6] For example, the player can order them to perform a &quot;super attack&quot;, either pounding the ground to bounce enemies into the air, allowing the player to hit them from long distances, or knocking them off balance, making them vulnerable to attack.[9] These allies also possess a health bar and are incapacitated if their health is depleted. Jade is also able to share some of her items, such as Starkos or PA-1s.\n\nIn addition to obtaining evidence and completing assignments, Jade's camera can be used to take pictures of animal species in exchange for currency and scan objects to reveal more information about the environment.[8] When the &quot;Gyrodisk Glove&quot; is obtained, Jade can attack enemies or activate devices from a distance using the camera interface.[10] There are also various minigames and sub-missions offered by NPCs scattered throughout the world.\n\nA hovercraft is used to travel around the world, and also used for racing and in other minigames. Later, the spaceship Beluga is acquired. The hovercraft can park on board the spaceship. Both vehicles require upgrades in order to reach new areas and progress through the game. Upgrades are purchased using pearls that are collected throughout the game. Pearls can be gained by completing missions, exploring areas, filling in the animal directory or by trading credits for them. The vehicles have a boost ability, and can be repaired using a &quot;Repair Pod&quot; if damaged by enemies.\n\nThe main city serves as a hub, allowing the player access to the various areas that must be explored in order to expose the conspiracy. Jade can earn credits by defeating enemies, taking pictures or completing assignments, which can be used to purchase additional items for both Jade and her vehicles.\n\nSystem Requirements\n\nMinimum Required:\n\nCPU: Intel and AMD processors, 700 Mhz\nOperating System: Windows 98SE/ME/2000/XP\nMemory: 64 MB with 98SE, 128MB with ME/2000/XP\nDrive Space: 2.2 GB (2260 MB)\nVideo Card: Direct X 9 compatible with T&amp;L and 32 MB RAM, GeForce1 256 or Radeon 7200\nSound Card: DirectX 9 compatible DirectX version: 9.0b\n\nRecommended &amp; Preferred Configuration:\n\nCPU: Intel and AMD processors with SSE, 1.3 GHz\nOperating System: Windows 2000 (service pack 4)\nMemory: 128 MB RAM with 98SE, 256 MB with ME/XP/2000\nDrive Space: 2.2 GB (2260 MB)\nVideo Card: DirectX 9 compatible with T&amp;L and 64 MB RAM, Geforce 3 or Radeon 9500\nSound Card: EAX Advanced HD compatible DirectX version: 9.0b","torrent":{"xt":"urn:btih:09ef9c3808f7e95a580051556a1c90df5a942336","amp;dn":"Beyond+Good+and+Evil+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09ef9c3808f7e95a580051556a1c90df5a942336","infoHashBuffer":{"type":"Buffer","data":[9,239,156,56,8,247,233,90,88,0,81,85,106,28,144,223,90,148,35,54]},"announce":[],"urlList":[]}}