{"title":"The Encyclopedia of U-Boats: From 1904 to the Present {BBS}","uid":6728646,"size":42648836,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a9b9377ea1b409e36d4723dba454947a8370a19&amp;dn=The+Encyclopedia+of+U-Boats%3A+From+1904+to+the+Present+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"bigbluesea","files":-1,"time":1318034842,"description":"On the eve of World War I, the art of submarine warfare was barely a dozen years old; no nation had submarine-qualified officers serving at the senior staff level and no nation had developed any method for detecting submarines, or attacking them if found. Ancient prejudice against submarines remained: they did not &quot;fit&quot; in the classic, balanced structure of a navy - where battleships were king. However, by the end of WWI they had changed the face of naval warfare forever. This excellent and comprehensive reference book, translated for the first time in English, traces the remarkable history of the German U-Boat, meticulously recording all the different submarine classes and types developed from the U-1, launched in 1906, through the highly successful 30's series, to the Wolf pack of WWII and beyond. Type sheets provide information on the development, service record, range, crew strength and location for each entry. Special chapters are also devoted to the most successful and colorful German U-Boat commanders including Karl Donitz, Otto Kretschmer and Gunther Prien, and the boats of WWI War and submarine shelters that can be visited in museums today.\nAbout the Author\nDr. Eberhard M(ller has written a number of books about German U-boat development and secret naval projects including Kurs Atlantik: Die deutsche UBoot-Entwicklung bis 1945 (3613016524) and Marine-Geheimprojekte: H. Walter und seine Entwicklungen (3613020750).\nProduct Details\n\n    * Hardcover: 240 pages\n    * Publisher: Greenhill Books; First edition (February 19, 2006)\n    * Language: English\n    * ISBN-10: 1853676233\n    * ISBN-13: 978-1853676239","torrent":{"xt":"urn:btih:0a9b9377ea1b409e36d4723dba454947a8370a19","amp;dn":"The+Encyclopedia+of+U-Boats%3A+From+1904+to+the+Present+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a9b9377ea1b409e36d4723dba454947a8370a19","infoHashBuffer":{"type":"Buffer","data":[10,155,147,119,234,27,64,158,54,212,114,61,186,69,73,71,168,55,10,25]},"announce":[],"urlList":[]}}