{"title":"ftvgirls.com.2005-05.Juliet.XXX.[GoldenPirates]","uid":6843701,"size":352315789,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0ab3a89ff1a2be795545aa8453c693c946462011&amp;dn=ftvgirls.com.2005-05.Juliet.XXX.%5BGoldenPirates%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoldenPirates","files":-1,"time":1322287185,"description":"Another torrent from goldenpirates.org\n\nno viruses, no shit, no Bullshit, just pure PORN!\n\nSite:   &lt;a href=&quot;\nhttp://www.ftvgirls.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ftvgirls.com&lt;/a&gt;\n\nTeam:             &lt;a href=&quot;\nhttp://goldenpirates.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://goldenpirates.org&lt;/a&gt;\n\nUploader/Ripper: goldenPirates\n\n\nMore Golden releases here:             &lt;a href=&quot;\nhttp://thepiratebay.se/user/Goldenpirates&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Goldenpirates&lt;/a&gt;\nand here:             &lt;a href=&quot;\nhttp://blog.goldenpirates.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blog.goldenpirates.org/&lt;/a&gt;\n\nEnjoy! \n\nThis torrent contains two videos, (split into several files), and four photosets.  \n\nPreviews and screenshots:\n &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?15o6owyp83ab3re3n7ughgalzk3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?15o6owyp83ab3re3n7ughgalzk3&lt;/a&gt;   cover &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?yjtyrp7fx0ydw9jwoqfp393fgxzz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?yjtyrp7fx0ydw9jwoqfp393fgxzz&lt;/a&gt;  face &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?sdnw0res744ehaplg10od2sqmepb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?sdnw0res744ehaplg10od2sqmepb&lt;/a&gt;  breasts &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?hde8wh8aa06lvo290h8c4sa0msl1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?hde8wh8aa06lvo290h8c4sa0msl1&lt;/a&gt;  vagina closed &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?4d6kqkrm1zxa83w2qx0zegbi9lru&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?4d6kqkrm1zxa83w2qx0zegbi9lru&lt;/a&gt;  vagina open &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?0r2gzfpul8bn9g87v19d3udu7kfg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?0r2gzfpul8bn9g87v19d3udu7kfg&lt;/a&gt;  ass &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?uwfzn89ukvp0xpfdzrl8ge3tuv&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?uwfzn89ukvp0xpfdzrl8ge3tuv&lt;/a&gt;    vid 1 screenshots &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?f9m5yucj4l0wa1tqbvff7nojwewn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?f9m5yucj4l0wa1tqbvff7nojwewn&lt;/a&gt;  vid 1 storyboard &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?1knuprtel052dyvnflhnfpn5uvi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?1knuprtel052dyvnflhnfpn5uvi&lt;/a&gt;   vid 2 screenshots &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?rjgje453ye1j146i7ptzi8552bt&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?rjgje453ye1j146i7ptzi8552bt&lt;/a&gt;   vid 2 storyboard\n\nThe video screenshots and storyboards are for only one file of each video.  Screenshots and storyboards for all video files are in the torrent.\n\nVideo descriptions from website:\n\nHi, I'm Juliet (that's not my real name actually, but its a name I always liked).  I have to keep my name different because I just turned 18 four months ago, and I would not want my parents to know what I just did!  My mom is Irish, and my dad is Scottish.   I was born in the US though, and moved to Arizona recently.  I don't burn like most girls with my complexion, but I stay careful to avoid too much sun (or heat!).   I suggested posing near the rose bush.  The photos ended up being more butt and pussy shots in the end.  The photographer was just intrigued by my strip of bush and took a lot of photos of it.  I save the rest of my pussy nice so guy can enjoy me, but I like to keep that part on top.\nThe question on your mind is probably 'why am I posing naked for this website?'  Well I've always been a wild girl from the start, and I'm definitely not shy.  Just the fact that I'm posing naked for the first time in my life doesn't bother me.   I messed up on my 'welcome' speech, but do you really care?  Didn't think so.  I masturbate ALL the time and even if there is a camera taping I'll get off.  I usually just use my fingers, but with a vibrator handy I used that instead.   There's two people in the room watching me so I have to get in the right frame of mind.   I like this vibrator, it is the right size and shape for me. \nI didn't know how long I was supposed to masturbate, but the videographer told me until I come.  I usually take my time and enjoy myself before I come, because I'm really sleepy afterwards.  Also the longer I take, the more wet I get.   I've been told that I can soak the bed sometimes when I'm really horny during real sex.  I think real sex is a lot more of a turn-on for me than masturbating.  This toy at least makes it cross over to that sort of feeling finger just don't give.  The guy's I've dated tell me that my pussy is very pretty and tasty, so I get munched on a lot.  They aren't very good at it though!  All the guys I've dated are about my age, maybe that's why.\nThe way I can wiggle the toy inside and rub my clit at the same time makes it really feel good.  I think I could have come right then if there weren't people all around me.  But it was coming slowly and I could feel my insides building up wetness.  You can start seeing it drip out of my pussy here.  Its neato for me to see it like this from a guy's perspective.  I did finally come, I'm not loud at all, but you can see my pussy pulsate quite madly for a few minutes.  Its true pleasure I tell you.  Now I usually don't taste myself, the videographer told me to do it!  I know it took half an hour for me to come, but I hope you enjoyed watching me have a dripping &amp; bubbly orgasm!\n\t\nI was having a great time in this second part.  I made sure I bring all my best dresses for the shoot.  Its my first time modeling (I know, its not 'mainstream' modeling but I'm too short to be a fashion model).  I think my body is in good proportions for modeling dresses.  After being photographed and videotaped for a few hours I'm totally comfy in front of the camera.  The best part is I get paid a lot for it!  The photographer is pretty funny and easy going, and the assistant helps out too.  The photos were all erotic with pussy and butthole spreads.\nI've got this superbig penis in my hands.  It feels good to the touch and makes you want to bite and nibble on it.   The assistant and me got very comfortable with each other so she asked me a lot of personal sexual questions.   I think she was trying to see if I like girls, and would want to have sex with her afterwards!  The videographer was going crazy with his camera zooming on my face and breasts.  I think the videographer wished this was his penis (literally) and so he gets every girl to give a blowjob to it.  Watch me!\nI like both large and small penises, each has their own charm.  But a penis this big is only good for hard fucking and riding.  My pussy stretches to accept it, it always does for big penises.  And I can ride it all very deep even though I'm petite.  I'm a natural, who loves being on top and riding guys as long as they can hold it.   Wearing these heels and riding from this angle was hard on my legs though.\nI took to the floor where it was a lot more comfortable using the toy.  I tried riding it again (since it is my favorite position after all!) and then went on my back to take it as deep as I could.  It fills me up good, but I think I prefer a vibrator to have an orgasm.  Looks hot though, don't you say?  It really does stretch my pussy out and it fills me up deep.  Thats not necessarily my thing though, even if it does not hurt.  Next I'm going to try the FTV Toy.\nI wanted to see what all the fuss was about with this big toy.  It really does stretch you even more than the toy before but it also really \nI think I'm the first girl to use this toy.  They custom made it to act like the FTV toy.  I think it looks better in photographs, the shots I took with it are very hot.\n\n--\n\nealDbAAdB","torrent":{"xt":"urn:btih:0ab3a89ff1a2be795545aa8453c693c946462011","amp;dn":"ftvgirls.com.2005-05.Juliet.XXX.%5BGoldenPirates%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ab3a89ff1a2be795545aa8453c693c946462011","infoHashBuffer":{"type":"Buffer","data":[10,179,168,159,241,162,190,121,85,69,170,132,83,198,147,201,70,70,32,17]},"announce":[],"urlList":[]}}