{"title":"Video Games - Sex Illuminati Conspiracy Documentary (2012) 640X4","uid":7414610,"size":767575299,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0b6ada663bb0d9ff60b46be90d3d5b4a5b275a1b&amp;dn=Video+Games+-+Sex+Illuminati+Conspiracy+Documentary+%282012%29+640X4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"one_last_round","files":1,"time":1341475798,"description":"There are five predominant topics in my film.  \n\nPart 1:  Video Game Violence\n\nWith the rise in realism, due to graphical improvements, what impact does video games violence have on the individual that's playing them?  This section will show video game clips having graphical violence.\n\nPart 2:  Military Involvement\n\nAre video games training you for real life combat?  Is the military trying to recruit people through video games?  Part two will discuss the military's influence on video games.  \n\nPart 3.  Human Augmentation.  \n\nThis section explores the idea of humans merging with technology.  The argument for this section is as followed.  Is there a possibility of losing your humanity when merging with technology?\n\nPart 4:  Sex In Games  \n\nSexual themes present in video games are shown.  Could there be a moral and social danger depending on how certain sexual content is portrayed?      \n\nPart 5:  Predictive Programming\n\nHow might video games be used to program the viewer?  Is there an agenda to get people to accept certain ideas? Are you being influenced to accept something that you aren't even aware of?\n\nPart 6:  Fallen Angel\nLastly, video games with demonic themes are covered.  Why are demonic themes present in some video games?  \n\nList of games used:\n\nAssassin's Creed, Battlefield 3, Call of Duty, Mass Effect, Conker's Bad Fur Day, Diablo III, Last of Us, Metal Gear Solid, Devil May Cry, Crysis 2, Deus EX, Duke Nukem, Grand Theft Auto, Final Fantasy, God of War, Hitman, Kane and Lynch, Twisted Metal, La Noire, Lollipop Chainsaw, Fall Out 3, Max Payne, Mortal Kombat, Red Dead Redemption,  Infamous 2, Heavy Rain, Witcher II, Prototype, Catherine, Splatterhouse, Watch Dogs, Dead Space 2, Homefront, Crackdown, Dead Rising, Shadows of the Damned\n","torrent":{"xt":"urn:btih:0b6ada663bb0d9ff60b46be90d3d5b4a5b275a1b","amp;dn":"Video+Games+-+Sex+Illuminati+Conspiracy+Documentary+%282012%29+640X4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b6ada663bb0d9ff60b46be90d3d5b4a5b275a1b","infoHashBuffer":{"type":"Buffer","data":[11,106,218,102,59,176,217,255,96,180,107,233,13,61,91,74,91,39,90,27]},"announce":[],"urlList":[]}}