{"title":"Vithagan (Tamil 2011) 1CD TC Rip 700MB TDM -=MTR=-","uid":6831654,"size":729664254,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0b84b76c8448b9b57f985ba43dfc5b76bf12a496&amp;dn=Vithagan+%28Tamil+2011%29+1CD+TC+Rip+700MB+TDM+-%3DMTR%3D-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tdkdemon","files":-1,"time":1321890989,"description":"\n\nVithagan is an Tamil action film directed by R. Parthiban that features himself in the lead along with Poorna. The film, which has been in making since 2008, released on 18th November 2011 as per schedule. 'Vithagan', which also happens to be the 50th film of Parthipan, has him in the role of a police officer, who is brainy as well as brawny. With an innovative tagline 'With the gun', 'Vithagan' has Poorna as heroine and music has been composed by Joshua Sridhar of 'Kadhal' fame. The film opened to mixed reviews.\n\nReview :\n\nFilm: 'Vithagan'; Cast: Parthiban, Poorna and Millind Soman; Producer: Manickam Narayanan; Writer-Director: Parthiban; Music Composer: Joshua Sridhar; Rating: ** 1/2\nDirector-actor Parthiban makes a comeback after a long time. He leaves behind psychological themes and opts for an action oriented cop story for his comeback movie.\nThe film, about a cop's courage, banks on a time tested and often repeated mass theme of the battle between the good and the evil.\n\nThe movie boasts of Parthibhan's typical style of filmmaking with several twists and turns. These elements gives an impression that the film will be different, but once the saga unfolds, it turns out to be a routine action masala movie.\nIt is all about the fight of a cop with underworld dons and other bad elements and it happens when he is bitten by love bug.\nACP Rowthiran (Parthiban) is an upright police officer and his brave acts against criminals make headlines. Predictably, he becomes the target of his corrupt senior officers.\nMeanwhile, he meets Mary (Poorna), a call centre employee. She initially misunderstands him, but once she learns about his mission, she falls for his valour.\nMeanwhile Rowthiran's mysterious past is revealed and after a sequence of events, he is put behind the bars.\nThe rest of the story shows how Rowthiran cleverly plans to settle score with a leading gangster, played by Milind Soman.\nParthibgan maintains the suspense element well, but fails to sustain the momentum as he restores to predictable events to take the story forward. The protagonist is shown as a brawny cop, but he indulges in mindless killings in the second half. In the process, he also kills the interest of the viewers in the movie.\nBut Parthiban, the dialogue writer, steals the show. As an actor, his body language and dialogue delivery are powerful.\nPoorna carries herself well.\nMilind Soman is one of the plus points of the film - his performance is strengthened by Goutham Menon's dubbing.\nJoshua Sridhar has tuned a couple of hummable songs. The title song featuring Parthiban's son Rocky Parthiban is interesting.\n'Vithagan' begins promisingly but loses steam and ends a predictable fare.\n\n\nBanner: Seventh Channal\nCast: Parthiban, Poorna\nDirection: Parthiban\nProduction: Manickam Narayanan\nMusic: Joshua Sridhar\nLyricist: Ra.Parthiban\nLabel: Kutty Audio\nSource: Untouched @ Kishan\nRipper: Kishan\nSize: 700MB\n\nCredits : Kishan\n\n\n &lt;a href=&quot;\nhttp://picturestack.com/887/623/OBhvlcsnap201khL.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://picturestack.com/887/623/OBhvlcsnap201khL.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://picturestack.com/887/623/2kjvlcsnap201HLf.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://picturestack.com/887/623/2kjvlcsnap201HLf.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://picturestack.com/887/623/8Oivlcsnap201wtG.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://picturestack.com/887/623/8Oivlcsnap201wtG.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://picturestack.com/887/623/mCfvlcsnap201fHh.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://picturestack.com/887/623/mCfvlcsnap201fHh.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://picturestack.com/887/623/S6bvlcsnap201W6e.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://picturestack.com/887/623/S6bvlcsnap201W6e.png&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0b84b76c8448b9b57f985ba43dfc5b76bf12a496","amp;dn":"Vithagan+%28Tamil+2011%29+1CD+TC+Rip+700MB+TDM+-%3DMTR%3D-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b84b76c8448b9b57f985ba43dfc5b76bf12a496","infoHashBuffer":{"type":"Buffer","data":[11,132,183,108,132,72,185,181,127,152,91,164,61,252,91,118,191,18,164,150]},"announce":[],"urlList":[]}}