{"title":"Father Figure - Ann Widdecombe  (Unabridged)","uid":6715579,"size":219847441,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0ba9f3d03b7b82d9fb9b14f4c033427b9d116494&amp;dn=Father+Figure+-+Ann+Widdecombe++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":11,"time":1317555948,"description":"Ann Widdecombe - Father Figure (Unabridged) - Read by Carole Boyd\n\n\nSource CD\nDuration approx 10:09 hours \nFhG MPEG 1 Layer III 48 Kbps CBR \n44100Hz, 16-bit, Mono\n\n\nThe book\n\nJason Kirk is a thirty-two year old teacher who believes he is happily married until he returns home one day to find that his wife has left him, taking their two young children with her. Suddenly Jason finds the role of father denied to him as he is separated from his children and reduced to the role of visitor. The law is weighted against him and his wife produces a series of excuses to withhold contact with Jake, eight and Leah, three. Jason, who had wanted to bring his children up to maturity on a daily basis, not only has to face the pain of this loss but endures the misery of persecution by the Child Support Agency. He discovers he is not alone, that among friends and colleagues are others enduring the same situation. FATHER FIGURE is an enthralling, thought-provoking novel of modern fatherhood. \n\n\nThe author\n\nAnn Widdecombe is best known as a Member of Parliament and for her broadcasting and journalism, but long had ambitions to write novels. She was born in 1947 and grew up moving around the country and abroad with her parents, as her father served in the Admiralty. She was educated at the Universities of Birmingham and Oxford. She writes her novels on long train journeys and in Singapore when she visits her Chinese nanny. \n\n\nThe reader\n\nCarole Boyd (born 1947) is a British actress. She has had a career in theatre, television and radio, and plays Lynda Snell in BBC Radio 4's The Archers.\n\nBoyd trained at the Birmingham School of Speech and Drama, where she won the principal national prize for voice, and the Carleton Hobbs Award. Her TV appearances include Hetty Wainthrop Investigates, Virtual Murder, Mrs Melly in Bodger and Badger, and she did the voices in Postman Pat since 1991 of all the female characters, Sara Clifton, Dr. Sylvia Gilbertson, Mrs Goggins, Miss Rebecca Hubbard, Julia Pottage, Dorothy Thompson, Lucy Selby, Katy and Tom Pottage, Charlie Pringle, Julian Clifton, Sarah Gilbertson and Bill Thompson (except Granny Dryden who is still voiced by Ken Barrie). In 2006, she played Esther Hartlieb in the film The Thief Lord.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:0ba9f3d03b7b82d9fb9b14f4c033427b9d116494","amp;dn":"Father+Figure+-+Ann+Widdecombe++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ba9f3d03b7b82d9fb9b14f4c033427b9d116494","infoHashBuffer":{"type":"Buffer","data":[11,169,243,208,59,123,130,217,251,155,20,244,192,51,66,123,157,17,100,148]},"announce":[],"urlList":[]}}