{"title":"Scooby-Doo Multi dvd 01 DVD5 (Subs Dutch) TBS","uid":6769856,"size":4416181336,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0e4329408010b2e1610cc26d36167f16c811c8c0&amp;dn=Scooby-Doo+Multi+dvd+01+DVD5+%28Subs+Dutch%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Marjanb","files":-1,"time":1319541685,"description":"Scooby-Doo Multi dvd 01\n\n\nDisk 01\nAloha, Scooby-Doo (2005)\nScooby-Doo and the Alien Invaders (2000)\nScooby-Doo and the Loch Ness Monster (2004)\nScooby-Doo and the Monster of Mexico (2003)\nScooby-Doo Meets The Harlem Globetrotters (1972)\n\n\n\nAloha, Scooby-Doo (2005)\nScooby en de leden van de Mystery Gang gaan naar Hawaii om mee te doen aan een internationale surfwedstrijd. Helaas wordt de wedstrijd al vrij snel verstoord door de vulkaan op het eiland, die om een of andere reden dreigt uit te barsten. Als ook nog een van de surfers plotseling verdwijnt, gaan de vrienden op onderzoek uit en krijgen het aan de stok met de geheimzinnige geest Wiki-Tiki\n\nAloha, Scooby-Doo (2005)\nScooby and the Mystery Gang members go to Hawaii to participate in an international surfing competition. Unfortunately the game is soon disrupted by the volcano on the island, which for some reason threatens to burst. If even one of the surfers suddenly disappears, the friends start to investigate and get it to stick with the mysterious ghost Wiki-Tiki\n\n------------------------------------------------------------------------------------------------------------------------------\n\n\n\nScooby-Doo and the Alien Invaders (2000)\nScooby en de andere leden van de Mystery Gang stuiten op een complot waarin niet alleen de overheid, maar ook buitenaardse wezens, een humeurige kok en een garagehouder bij betrokken zijn\n\nScooby-Doo and the Alien Invaders (2000)\nScooby and the other members of the Mystery Gang encounter a plot in which not only government but also aliens, a grumpy cook and a garage owner involved\n-------------------------------------------------------------------------------------------------------------------------\n\n\n\nScooby-Doo and the Loch Ness Monster (2004)\nScooby en de leden van Mystery Inc gaan naar Schotland om daar de jaarlijkse Highland Games te presenteren. Helaas worden de spelen verstoord door het legendarische monster van Loch Ness. Het beest is namelijk behoorlijk woedend omdat de spelen op zijn geboortegrond worden gehouden\n\nScooby-Doo And The Loch Ness Monster (2004)\nScooby and the members of Mystery Inc. go to Scotland to serve the annual Highland Games to present. Unfortunately, the play disturbed by the legendary Loch Ness monster. The beast is in fact quite angry because the games are held on his native soil\n----------------------------------------------------------------------------------------------------------------------\n\n\n\nScooby-Doo and the Monster of Mexico (2003)\nScooby en de leden van Mystery Inc maken een reisje naar een klein dorpje in Mexico om de e-mail-vriend van Freddy op te zoeken. Helaas wordt het dorpje geterroriseerd door een monster dat alleen kan worden bedwongen door de zogenaamde Vloek van Chupacapra ongedaan te maken.\n\nScooby-Doo and the Monster of Mexico (2003)\nScooby and the Mystery Inc. members make a trip to a small village in Mexico to the e-mail friend of Freddy to find. Unfortunately, the village terrorized by a monster that can only be overcome by the so-called Curse of Chupa Capra undo.\n-------------------------------------------------------------------------------------------------------------------\n\nScooby-Doo Meets The Harlem Globetrotters (1972)\nScooby-Doo en het Mystery, Inc. team scoren driepunters aan de lopende band wanneer ze samen met enkele legendarische baskelspelers - de Harlem Globetrotters - op spokenjacht trekken. Bij een bezoek aan een bizzar kustdorpje jagen de geest van Paul Revere en een vuurspuwende zeeslang Scooby en zijn maatjes de stuipen op het lijf! Maar gelukkig schieten de Fabulous Harlem Globetrotters hen net op tijd ter hulp.\n\nScooby-Doo Meets The Harlem Globetrotters (1972)\nScooby-Doo and the Mystery, Inc.. team score three-pointers on the assembly line when she and some legendary baskelspelers - the Harlem Globetrotters - to ghost hunt draw. When visiting a coastal village bizzare chase the spirit of Paul Revere and a fire-breathing sea serpent Scooby and the gang the true meaning of fear! But luckily the Fabulous Harlem Globetrotters shoot them just in time to help.\n------------------------------------------------------------------------------------------------------------------\n\n\n\t\n Category\t:Video\n Format\t:DVD5\n Source\t:(S)VCD\n Subtitle\t:Dutch subs \n Genre\t:Animation\n Language\t:English audio\n Status\t:Done Uploading\n Files\t:93 Files\n Size\t:4.18 GB\n\nEnjoy the Movie's\n\n************************************\n\nKom ook eens kijken :\n &lt;a href=&quot;\nhttp://www.black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.black-sam.org&lt;/a&gt;\n\nEnjoy\n\n\n*************************************\n","torrent":{"xt":"urn:btih:0e4329408010b2e1610cc26d36167f16c811c8c0","amp;dn":"Scooby-Doo+Multi+dvd+01+DVD5+%28Subs+Dutch%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e4329408010b2e1610cc26d36167f16c811c8c0","infoHashBuffer":{"type":"Buffer","data":[14,67,41,64,128,16,178,225,97,12,194,109,54,22,127,22,200,17,200,192]},"announce":[],"urlList":[]}}