{"title":"BBC Art of America - Modern Dreams XviD AC3.avi","uid":6848234,"size":734371840,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:119dfe960cfb00cc80176a55f8ef69e53835eea6&amp;dn=BBC+Art+of+America+-+Modern+Dreams+XviD+AC3.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pharos01","files":1,"time":1322424831,"description":"58:31\n\nAndrew Graham-Dixon gets under the skin of the modern American metropolis. Starting his journey at the foot of the Statue of Liberty, which he describes as a pioneering early skyscraper, Andrew discovers how the ambitions of visionary artists and architects helped America remove itself from the shadow of Europe and become the most advanced civilisation on earth.\n\nAndrew travels to downtown Manhattan to explore the grimy world of early 20th century painters John Sloan and George Bellows, and visits Stockbridge in Massachusetts to find out how the world of Norman Rockwell is not as sentimental as it first seems. In Chicago, he explores the visionary mind of architect Louis Sullivan and travels to the decaying outskirts of the city to see the underside of the American dream.\n\nHe uncovers the impact the Great Depression had on artists such as Edward Hopper and Arshile Gorky, and finds out how this struggle inspired America's first internationally-acclaimed art movement - Abstract Expressionism. He pays a pilgrimage to Jackson Pollock's perfectly-preserved studio in Long Island to discover the secrets of his unique drip technique, before flying across America to take in one of modern art's most moving experiences, Mark Rothko's chapel in Houston, Texas.\n\nSTBHR-HD TS source MPEG/MPA streams\n\nVCodec: XviD 2pass MPEG 720*400\nACodec: AC3 192Kbps\n\nEnjoy,\n\nPls help seed","torrent":{"xt":"urn:btih:119dfe960cfb00cc80176a55f8ef69e53835eea6","amp;dn":"BBC+Art+of+America+-+Modern+Dreams+XviD+AC3.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"119dfe960cfb00cc80176a55f8ef69e53835eea6","infoHashBuffer":{"type":"Buffer","data":[17,157,254,150,12,251,0,204,128,23,106,85,248,239,105,229,56,53,238,166]},"announce":[],"urlList":[]}}