{"title":"Democracy Now - 06 oct 2011","uid":6725368,"size":458097785,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:11d4be673e36c81034ee77f6cdaef8bfd0463257&amp;dn=Democracy+Now+-+06+oct+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1317924760,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 06, 2011\n\n- Thousands Join Occupy Wall Street March; 28 Arrested\n- Greeks Rally, Strike Against Austerity Cuts\n- Afghans Protest U.S. on 10-Year Anniversary of Invasion\n- U.S. Threatens to Cut UNESCO Funding for Palestine Vote\n- Secret Panel Determines U.S. &quot;Kill List&quot;\n- Activists: Up to 12,000 Prisoners Hunger Striking in California\n- Groups Sue Over Keystone XL Tar Sands Oil Pipeline Construction\n- Palin Opts Out of GOP Race\n- 3 Killed, 7 Wounded in California Shooting\n- Study: Openly Gay Males 40% Less Likely to Receive Job Interviews\n- Obama Hosts Honduran President at White House\n- Bahrain Orders New Trial for Jailed Medics\n- South Africa Prevents Dalai Lama Visit\n- Apple Founder Steve Jobs Dies at 56\n- Civil Rights Leader Fred Shuttlesworth Dies at 89\n\n\nSpecial reports\n\n- Occupy Wall Street March Gets Massive Turnout; 28 Arrested in Police Crackdown\n\nLabor unions and students joined the growing Occupy Wall Street movement in New York City on Wednesday in the largest march since the protest began 20 days ago. Tens of thousands marched from Foley Square to Zuccotti Park, renamed &quot;Liberty Plaza,&quot; the site of the protest encampment where hundreds have been sleeping since Sept. 17. The march was peaceful ,but police later beat a handful of protesters with batons after they toppled a police barricade in an attempt to march down Wall Street. Police say a total of 28 people were arrested. We hear from eyewitnesses to an altercation between police and protesters at Wall Street.\n\n\n- &quot;We Have Come Together&quot;: Inspired By Occupy Wall Street, Unions Join Activists for Historic March\n\nThe Occupy Wall Street march was endorsed by a coalition of labor groups including the Transport Workers Union, National Nurses United, SEIU 1199, and the United Federation of Teachers. We hear the voices of union leaders addressing the boisterous crowd at Foley Square in Lower Manhattan before the march headed to the Financial District.\n\n\n- Bronx Hip-Hop Duo Rebel Diaz, Live From Occupy Wall Street March\n\nThe hip-hop brother duo Rebel Diaz attended the Occupy Wall Street march in Lower Manhattan yesterday, and stopped to tell Democracy Now! why they came down from the South Bronx to join thousands of others demanding change. As they walked along Broadway towards Zuccotti Park - the heart of the protest encampment - they performed a song written about the occupy movement spreading across the United States.\n\n\n- Decrying Debt and Budget Cuts, Students Stage Walk-Out to Join Growing Occupy Wall Street Movement\n\nStudents made up a large contingent of Wednesday's march in support of Occupy Wall Street. A national day of student walk-outs was held to protest budget cuts and to show support for Occupy Wall Street. According to the website OccupyColleges.org, walkouts occurred at 75 schools across the nation including many in New York City. Democracy Now! met up with several students who walked out of classes at the City University of New York, the New School and New York University to attend Wednesday's march in Lower Manhattan. &quot;I think a lot of students are in the direct lines of sing on this economic crisis is selling people a terrible bill of goods.People got the impression that they are able go to school and have a well paying job, some semblance of security and inclusion in a professional, responsible life,&quot; one of the students says. &quot;We what have seen a lot with students across the sea in Europe and students in Puerto Rico and Chile is that this is really a mirage.&quot;\n\n\n- &quot;We Are the 99%&quot;: Voices From the Occupy Wall Street March\n\nPeople of all ages and backgrounds were on hand for Wednesday's Occupy Wall Street march that drew tens of thousands into the streets in downtown New York City. Democracy Now!'s Amy Goodman reports from the street to bring you some of their voices.\n\n\n- Naomi Klein: Protesters Are Seeking Change in the Streets Because It Won't Come From the Ballot Box\n\nAmong the thousands at last night's Occupy Wall Street protest here in New York City was award-winning journalist and author Naomi Klein. She is the author of the bestselling book, &quot;The Shock Doctrine: The Rise of Disaster Capitalism.&quot; She also wrote &quot;No Logo,&quot; a book that has become a cultural manifesto for critics of unfettered capitalism worldwide. Klein joins us to discuss the Occupy Wall Street movement and why it is being belittled in the corporate media. &quot;My biggest fear was that the Obama presidency was was going to lead this generation of young people into political cynicism and political apathy,&quot; Klein says. &quot;But instead, they are going to where the power is. They are realizing the change is not coming in Washington because politicians are so controlled by corporate interest, and that that is the fundamental crisis in this country.&quot;\n\n\n- Naomi Klein: Keystone XL Oil Pipeline Controversy Shows How Wall Street Is Occupying U.S. Gov't\n\nLast month, award-winning journalist and author Naomi Klein was in Washington, D.C., where she was arrested along with more than 1,000 people in two-week campaign of civil disobedience outside the White House against the proposed Keystone XL pipeline, which would carry oil from Canada's tar sands field to Gulf Coast refineries. Now in New York City to support the Occupy Wall Street protest, Klein joins us to discuss the connections between the two struggles, and the cozy relationship between the White House, the U.S. State Department that is considering the proposed pipeline, and Keystone XL lobbyists.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:11d4be673e36c81034ee77f6cdaef8bfd0463257","amp;dn":"Democracy+Now+-+06+oct+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11d4be673e36c81034ee77f6cdaef8bfd0463257","infoHashBuffer":{"type":"Buffer","data":[17,212,190,103,62,54,200,16,52,238,119,246,205,174,248,191,208,70,50,87]},"announce":[],"urlList":[]}}