{"title":"Robert.Ludlums.-.The.Osterman.Weekend.(1983)","uid":7419036,"size":669328286,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:124c67ebc6d98a9b80c15404a7d82208cab0a57d&amp;dn=Robert.Ludlums.-.The.Osterman.Weekend.%281983%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"00rimme","files":5,"time":1341607655,"description":"The Osterman Weekend (1983)\n\nA man discovers that his best friends are actually spies -- or are they?\n\nJohn Tanner (Rutger Hauer) is the host of a television news show who once a year spends a long weekend with three of his best friends from college, Bernard Osterman (Craig T. Nelson), Joseph Cardone (Chris Sarandon), and Richard Tremayne (Dennis Hopper). Tanner is approached by Lawrence Fassett (John Hurt), a CIA agent who has evidence proving that his three pals are actually agents working with the Soviet Union. With Tanner's reluctant approval, his house is wired with video surveillance equipment so that the CIA can monitor what Osterman, Cardone, and Tremayne say and do over their weekend together in hopes of putting the traitors behind bars. However, Tanner soon realizes that Fassett's agenda is not all that it appears to be. \n\nThis movie plays like a 1980's naive first written draft of the Bourne ID.  &quot;The structure is a mess (the film was re-cut against Peckinpah's wishes), which ultimately makes it difficult to tell whether its oddly compelling qualities are the result of a coherent artistic strategy or the cynical carelessness of a director sidelined.&quot; That being said, Enjoy.","torrent":{"xt":"urn:btih:124c67ebc6d98a9b80c15404a7d82208cab0a57d","amp;dn":"Robert.Ludlums.-.The.Osterman.Weekend.%281983%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"124c67ebc6d98a9b80c15404a7d82208cab0a57d","infoHashBuffer":{"type":"Buffer","data":[18,76,103,235,198,217,138,155,128,193,84,4,167,216,34,8,202,176,165,125]},"announce":[],"urlList":[]}}