{"title":"Democracy Now - 07 oct 2011","uid":6727811,"size":455962401,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:12c4b2f23159917ef2c447a2cc4564cc9bced450&amp;dn=Democracy+Now+-+07+oct+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1318007893,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 07, 2011\n\n- &quot;Occupy&quot; Protests Grow Across the U.S., Reported Gatherings in 847 Cities\n- Police Raid Protest Encampment in San Francisco\n- Obama: Occupy Wall Street Reflects Wide &quot;Frustration&quot;\n- Obama Backs Millionaire Surtax\n- Nobel Peace Prize Awarded to Trio of Women\n- Libyan Civilians Trapped in Fierce Sirte Clashes\n- Afghans Protest the United States on 10-Year War Mark\n- Syria Death Toll Tops 2,900 in Pro-democracy Protest Crackdown\n- Attacks on Palestinians Increase in West Bank\n- Obama Echoes Mullen on Pakistan-Militant Ties\n- Clashes Erupt as Thousands of Chilean Students Protest\n- New Zealand Warns of Oil Spill &quot;Disaster&quot;\n- California Pulls Out of Foreclosure Settlement Talks\n\n\nSpecial reports\n\n- Nobel Peace Prize Awarded to Trio of Women for Championing Gender Equality, Peace-Building\n\nThe 2011 Nobel Peace Prize has been awarded to a trio of recipients: Yemeni activist Tawakul Karman; Liberian President Ellen Johnson-Sirleaf; and Liberian peace activist Leymah Gbowee. The three women were cited &quot;for their non-violent struggle for the safety of women and for women's rights to full participation in peace-building work.&quot; The trio of laureates follow only a dozen other women among 85 men to have won the prize over its 110-year history. We play an excerpt from this morning's announcement by Nobel Prize Committee Chairperson Thorbjoern Jagland in Norway.\n\n\n- Yemeni Activist Tawakul Karman, First Female Arab Nobel Peace Laureate: A Nod for Arab Spring\n\nIn an interview, Yemeni activist Tawakul Karman said her Nobel Peace prize is a victory for Yemen and for all of the uprisings of the Arab Spring. Kaman is a 32-year-old journalist and the head of the Yemeni non-profit group, Women Journalists Without Chains. She was detained for a time during the political unrest earlier this year. She is the first Arab female to win the Nobel Peace Prize and is believed to the youngest winner of the peace prize to date, slightly edging out the Irish activist Mairead Corrigan who won in 1976. We get reaction from British journalist Iona Craig, who has been closely following the uprising in Yemen. &quot;This nobel peace prize will actually in some ways go towards protecting her. Now she will become an even greater international figure and certainly if the regime sought to detain her again, I think they would create a huge problem for themselves,&quot; Craig says.\n\n\n- Liberian President Ellen Johnson Sirleaf, Activist Leymah Gbowee Honored for Peace, Equality Work\n\nFor Liberian President Ellen Johnson-Sirleaf ,the Nobel Peace Prize announcement comes as she wraps up her re-election campaign. Voters in Liberia head to the polls on Tuesday. The other Liberian Nobel-winner, Leymah Gbowee, is the founder of the Women For Peace movement, credited by some for bringing an end to the civil war in 2003. The movement started humbly in 2002 when Gbowee organized a group of women to sing and pray for an end to fighting in a fish market. We speak to Emira Woods, a Liberia native and co-director of Foreign Policy In Focus at the Institute for Policy Studies in Washington.\n\n\n- Ten Years After U.S. Invasion, Afghan War Rages On With No End in Sight\n\nIt was 10 years ago today when former President George W. Bush announced the beginning of the war on Afghanistan. It has now has become the longest-running war in U.S. history and there is no end in sight. The Taliban remains in control of major parts of the nation. Peace talks have collapsed. Civilian and troop casualties continue to mount. There have been a number of major setbacks in just the past few weeks. On Sept. 13, militants attacked the U.S. embassy and the NATO headquarters in Kabul. A week later, the Taliban claimed responsibility for assassinating former Afghan president Burhanuddin Rabbani, who headed the Afghan Peace Council. Just this week, the Wall Street Journal reported Afghan President Hamid Karzai has given up on negotiating with the Taliban. To discuss what the future has in store for a nation long-ravaged by war, we speak with Afghanistan by &quot;Reena,&quot; a 19-year-old member of the Revolutionary Association of the Women of Afghanistan. &quot;Reena&quot; is a pseudonym and her face is concealed since all RAWA members maintain anonymity for security reasons. We're also joined by independent journalist Anand Gopal, who has reported extensively from Afghanistan and is completing a book on the war.\n\n\n- Rev. Jesse Jackson Honors the Late Civil Rights Stalwarts Fred Shuttlesworth and Derrick Bell\n\nThis week, the Civil Rights movement lost two of its torch-bearers. Rev. Fred Shuttlesworth died at the age 89 and Derrick Bell died at the age of 80. Rev. Shuttlesworth led the struggle to end segregation in Birmingham, Alabama. He was the last of the civil rights movement's &quot;Big Three,&quot; founding the Southern Christian Leadership Conference along with Rev. Dr. Martin Luther King, Jr. and the Rev. Ralph David Abernathy. A legal scholar and civil rights activist, Derrick Bell sought to expose American racism through his books, articles and career sacrifices. As the first tenured black professor at Harvard Law School, Bell gave up his position in protest of the school's allegedly discriminatory hiring practice. For more on the lives and legacies of Fred Shuttlesworth and Derrick Bell, we're joined by Rev. Jesse Jackson, president and founder of the Rainbow/PUSH Coalition.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:12c4b2f23159917ef2c447a2cc4564cc9bced450","amp;dn":"Democracy+Now+-+07+oct+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12c4b2f23159917ef2c447a2cc4564cc9bced450","infoHashBuffer":{"type":"Buffer","data":[18,196,178,242,49,89,145,126,242,196,71,162,204,69,100,204,155,206,212,80]},"announce":[],"urlList":[]}}