{"title":"Ein Lied fur Beko","uid":6758478,"size":1090380196,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1326ae7304069a7f3710d8860f58214ec5c9dc51&amp;dn=Ein+Lied+fur+Beko&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Globetroller","files":1,"time":1319117308,"description":"Film von und mit Nizamettin Aric\nEin Lied fur Beko - Klamek ji bo Beko (1992) \nDeng-Sprache Kurdish sub.Deutsch\n\nDie Kurden sind ein nomadisierendes Volk, wobei sie unter Nomadisieren gerne etwas anderes verstehen wÃƒÂ¼rden als ein Leben ohne eigene Heimat. Der bekannte und beliebte kurdisch-tÃƒÂ¼rkische SÃƒÂ¤nger und Regisseur Nizamettin AriÃƒÂ§ bringt uns in seinem Spielfilm Ã‚Â«Ein Lied fÃƒÂ¼r BekoÃ‚Â» auf ungemein einfÃƒÂ¼hlsame Art seine ursprÃƒÂ¼ng-liche Heimat nÃƒÂ¤her, ein Kurdistan, das vor allem aus Schlagzeilen von Menschen auf der Flucht bekannt ist. Beko lebt im tÃƒÂ¼rkischen Teil Kurdistans. Versehentlich wird er von Spezialtruppen festgenommen, schafft aber die Flucht. Es gelingt ihm, den Euphrat zu durchqueren und die TÃƒÂ¼rkei zu verlassen. \nIm syrischen Kurdistan beginnt er seine Suche nach dem Bruder Cemal, von dem er weiss, dass er in den kurdischen Teil des Irak gelangen wollte. Doch er findet ihn nicht, und so bleibt er auf Anraten von Partisanen zunÃƒÂ¤chst in einem Berglager kurdischer Nomaden und Kinder, die da elternlos leben. Ã‚Â«Ein Lied fÃƒÂ¼r BekoÃ‚Â» ist der erste in kurdischer Sprache gedrehte Film. Er wurde unter illegalen Bedingungen an der armenischen Grenze zur TÃƒÂ¼rkei gedreht. Der Film ist von einer ÃƒÂ¼berzeugenden Schlichtheit und Aufrichtigkeit, getragen von der WÃƒÂ¼rde des Ausdrucks. Nicht umsonst hat er ÃƒÂ¼berall, wo er gezeigt wurde, die Herzen des Publikums erobert.\n\nEin Lied fur Beko war der erste in kurdischer Sprache gedrehte Spielfilm. Er wurde unter illegalen Bedingungen an der armenischen Grenze zur TÃƒÂ¼rkei gedreht. Der Film ist getragen von ÃƒÂ¼berzeugender Schlichtheit und Aufrichtigkeit. \nJurypreis am Festival von Fribourg\nRegie und Drehbuch: Nizamettin Aric\nDarsteller/innen: Nizamettin Aric, Bezara Arsen, Lusika Hesen, Cemale Jora, Fila Tital, Nuriye Tital, Temure Jora, Sirine Sinco, Xasea Rizgo, Berivana Feqi, Leylea Guhar, Rusteme Cemal, Arsen Poladow, Agite Cimo, Rizgoye Resit, Aschot Abrahamian, Galina Novenz, Aschot Yedingarian\nProduktion: Margarita Woskanjan\nKamera: Thomas Mauch\nLaufzeit: 100 min\nQualitÃƒÂ¤t ist nicht sehr gut\n &lt;a href=&quot;\nhttp://de.wikipedia.org/wiki/Kurdischer_Film&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://de.wikipedia.org/wiki/Kurdischer_Film&lt;/a&gt;\n","torrent":{"xt":"urn:btih:1326ae7304069a7f3710d8860f58214ec5c9dc51","amp;dn":"Ein+Lied+fur+Beko","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1326ae7304069a7f3710d8860f58214ec5c9dc51","infoHashBuffer":{"type":"Buffer","data":[19,38,174,115,4,6,154,127,55,16,216,134,15,88,33,78,197,201,220,81]},"announce":[],"urlList":[]}}