{"title":"Coast To Coast AM 09.20.11 Planet X, Consciousness, &amp; Comet ","uid":6693612,"size":55232402,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:13ea9840873f5db8bceae66ba1a0f44645de3c98&amp;dn=Coast+To+Coast+AM+09.20.11+Planet+X%2C+Consciousness%2C+%26amp%3B+Comet+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"1337bits","files":1,"time":1316691553,"description":"Date:\t09-20-11\nHost:\tGeorge Noory\nGuests:\tDoug Elwell, Deborah Pratt, Richard C. Hoagland\n\nDuring the middle two hours, publisher of Mysterious World books, Doug Elwell, discussed his research on ancient references to Planet X which connects the work of Zecharia Sitchin to Biblical writings. He noted that astronomers have actually been looking for Planet X for &quot;over 100 years&quot; and clarified that the use of 'X' is merely to denote that the object remains, so far, unknown. &quot;It's not some cheesy science fiction thing,&quot; he declared, &quot;it's a legitimate scientific endeavor.&quot; Elwell described his interpretation of Planet X as a combination of mainstream science theories on the object along with the voluminous work of Zecharia Sitchen. According to Elwell's research, Planet X circles through our solar system about every 2,000 years and crosses through the asteroid belt.\n\nElwell observed that numerous ancient texts appear to allude to Planet X and asserted that the object is actually the &quot;core concept behind the Bible.&quot; He noted that, in the Bible, Jesus said that, much like his birth, his return would be preceded by the arrival of a bright star, which Elwell interprets, in both cases, to be Planet X. Additionally, he said that if we &quot;take mythology at face value,&quot; various ancient cultures wrote about their highest deities facing off in battle against a &quot;dragon&quot; of some kind. All of these references, Elwell theorized, suggest a &quot;cosmic war&quot; between God and the fallen angels, who come to Earth every time Planet X arrives in the hopes of raising an army to &quot;attack heaven, itself.&quot;\n\nQuantum Leap &amp; Consciousness\nIn the first hour, writer/producer Deborah Pratt discussed her work on the TV series Quantum Leap as well as consciousness. She attributed the massive popularity of the program to the strong chemistry between the main characters as well as the concept that past mistakes could be fixed which &quot;gave people hope.&quot; On consciousness, she opined that &quot;we are in a shift&quot; and stressed that mankind needs to harness the power of their &quot;collective mass&quot; to shape the future into a positive place. Pratt has set up a special website where Coast listeners can get a free e-download of the first book in her Vision Quest trilogy.\n\nComet Elenin\nFinal hour guest Richard C. Hoagland shared his thoughts on Comet Elenin, Friday's impending satellite re-entry, and 2012. He decried the hysteria surrounding Elenin, declaring that he'd &quot;never seen any object so hyped and so lied about than this little nothing, wimpy thing.&quot; Hoagland also voiced suspicions over the origins of the comet's discovery, noting that Leonid Elenin, the man who discovered it, has seemingly rebuffed nearly all press surrounding the object. He encouraged listeners to avoid what he sees as &quot;fear conditioning&quot; by the media surrounding Elenin and surmised that something about the approaching comet threatens the world elite. As such, Hoagland mused that &quot;someone in power is deathly afraid of it, so it must be a good thing.&quot;\n\n\n\n\n\nGeneral\n\nCoast To Coast AM 09.20.11 Planet X,\nConsciousness, &amp; Comet Elenin - C2CP2P\n\nFormat : MPEG Audio\nFile size : 52.7 MiB\nDuration : 2h 33mn\nOverall bit rate : 48.0 Kbps\n\n\nAudio\nFormat : MPEG Audio\nFormat version : Version 1\nFormat profile : Layer 3\nDuration : 2h 34mn\nBit rate mode : Constant\nBit rate : 48.0 Kbps\nChannel(s) : 1 channel\nSampling rate : 44.1 KHz\nCompression mode : Lossy\nStream size : 52.7 MiB (100%)","torrent":{"xt":"urn:btih:13ea9840873f5db8bceae66ba1a0f44645de3c98","amp;dn":"Coast+To+Coast+AM+09.20.11+Planet+X%2C+Consciousness%2C+%26amp%3B+Comet+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13ea9840873f5db8bceae66ba1a0f44645de3c98","infoHashBuffer":{"type":"Buffer","data":[19,234,152,64,135,63,93,184,188,234,230,107,161,160,244,70,69,222,60,152]},"announce":[],"urlList":[]}}