{"title":"XBOX360 Resident Evil 6 PRE-Order Demo","uid":7409691,"size":879382528,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:15420ae0093fc729b1088ed6dadc45cebccc4717&amp;dn=XBOX360+Resident+Evil+6+PRE-Order+Demo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"XGameX","files":-1,"time":1341347381,"description":"Blending action and survival horror, Resident Evil 6 promises to be the dramatic \nhorror experience of 2012. Resident Evil favorites Leon S. Kennedy and Chris Redfield are joined by new characters, including Jake Muller, to face a bioterrorist threat on a global scale, as the narrative moves between North America, the war-torn Eastern European state of Edonia and the Chinese city of Lanshiang.\n\nResident Evil 6 features three distinct, yet interwoven story threads, each with their own pair of protagonists for either solo or co-op play, both offline and online. Leon S. Kennedy is paired with US government agent Helena Harper, while Chris Redfield teams up with fellow BSAA member Piers Nivans. Finally, gun for hire and son of the infamous Albert Wesker, Jake Muller, is joined by Sherry Birkin, the daughter of former key Umbrella scientists, William and Annette. All six must face a new horror - the highly virulent C-virus that has been unleashed on an unsuspecting and unprepared world, creating new and deadly transformations.","torrent":{"xt":"urn:btih:15420ae0093fc729b1088ed6dadc45cebccc4717","amp;dn":"XBOX360+Resident+Evil+6+PRE-Order+Demo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15420ae0093fc729b1088ed6dadc45cebccc4717","infoHashBuffer":{"type":"Buffer","data":[21,66,10,224,9,63,199,41,177,8,142,214,218,220,69,206,188,204,71,23]},"announce":[],"urlList":[]}}