{"title":"rangmilanti-700MB.x264.ac3-DDR","uid":6770346,"size":730640287,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:173301cb70b48751330aa81be35862cacd114a12&amp;dn=rangmilanti-700MB.x264.ac3-DDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1319551823,"description":"DDR Presents\n\nRang Milanti (2011)\n(Or the &quot;Queen of Hearts&quot;)\n\nDVD Rip - 697MB (1-CD) - X.264\n\n\nTech Specs ~\n &lt;a href=&quot;\nhttp://img805.imageshack.us/img805/2190/rmdata.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img805.imageshack.us/img805/2190/rmdata.png&lt;/a&gt;\n\nSynopsis:\n\nKamalini and Kamalika are two sisters. Kamalini (Churni Ganguly) a famous actress, is married to Deep (Saswata Chatterjee), a failed actor who is wonderful at dubbing. She wants him to concentrate on his career but he is singularly without ambition. She is attracted to Prashant (Riingo) a successful director. Kamalika (Riddhima) is our queen of hearts. She loves her four friends DJ (Gaurav Chattopadhyay), Rik (Gaurav Chakraborty), (Tanaji Dasgupta) and Tito (Indrasheesh Ray) to distraction but can't decide who to marry. All of them want to marry her too, and decide to leave the choice to her.\n\nEnter Dr. Anu Bhowmik a pschologist recommended by Deep. He devises a series of tests for the four suitors and Kamalika has to give them marks. The highest scorer wins the Queen of Hearts. Thus starts a game of hilarious proportions as the suitors, unknowingly compete with each other. In the midst of this they all befriend a young Italian single mother Lisa (Eliza Kazan) who is searching for her boyfriend.\nKamalini reunites with Deep, Prashant is shown up to be a cad. Lisa finds her lover and they extract 25 lakhs for the beby's maintenance which she gives to charity and joins a NGO, Deep and Kamalini adopt the baby and all is well with the world. But wait! Can Kamalika find her true love?\n\nComments:\n\nThis is a film for fun not logic. If you search for logic you will lose your way totally. Deep impersonates as Anu Ghatak and his own wife can't recognise him. You and I can of course! Kamalika can't either, but that is expected. She seems just a shade better than a congenital idiot in the film. Kamalika finds her love and parts with him because he kisses her and then reunites because he kisses her! Lunacy is woven into every frame of the film... But wait! Its a slapstick comedy after all and there are some nice touches like using film names for each of the tests (along with some old posters).\n\nI liked the way the character of is sketched out. Its the only one which is sketched to any depth. He is a tailor and the scene in which he brings a dress sewn by him personally on Kamalika's birthday is very nice. Tito the filmmaker is somewhat overdrawn and speaks in the idion of a film all the time and drags a bit. Saswata is very funny as he impersonates a woman on the radio. There are some nice moments..\n\nThree actors carry the film on their shoulders. Saswata is the hero in the background and is superlative inn both his roles. Churni Ganguly looks beautiful and acts naturally and Tanaji as is very natural without taking recourse to melodrama. The young uns pass muster because they are young and energetic. Editing is slick and Gopi Bhagat's cinematography is excellent in indoor sequences and very good otherwise. There is a beautiful raga by Ustaad Rashid Khan but the nusic is otherwise nondescript.\n\nI thought that the film just dragged a bit. There were some sequences that were needless. The role of the Italian girl was needed but was not woven into the script with any amount of naturalnesss. It was a case of too much of a good thing...\n\nBut what the heck! it isn't a film for the intellect. Its meant for sheer fun and while it isn't the greatest of comedies, its pleasant to watch...\n\nUploader's Notes:\n\nThe DVD quality is good and needed very little effort to rip. Despite the size, I was able to tweak it into a 700MB size. The sound as ripped is slightly artificial to my ears but will probably pass muster.\n\nIMDB Link:\n\nNot available\n\n\nScreens ~\n &lt;a href=&quot;\nhttp://img5.imageshack.us/img5/6876/rmle.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img5.imageshack.us/img5/6876/rmle.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/221320155544157&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/221320155544157&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/8ff754155544442&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/8ff754155544442&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/d3b8c7155544339&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/d3b8c7155544339&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/c4a733155544275&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/c4a733155544275&lt;/a&gt;","torrent":{"xt":"urn:btih:173301cb70b48751330aa81be35862cacd114a12","amp;dn":"rangmilanti-700MB.x264.ac3-DDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"173301cb70b48751330aa81be35862cacd114a12","infoHashBuffer":{"type":"Buffer","data":[23,51,1,203,112,180,135,81,51,10,168,27,227,88,98,202,205,17,74,18]},"announce":[],"urlList":[]}}