{"title":"Warehouse 13 Season 3 complete","uid":6760815,"size":4406477214,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:188a45a7148407091c6caa1daa62da6b9a605f14&amp;dn=Warehouse+13+Season+3+complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"stu181","files":11,"time":1319155386,"description":"Season 3, Episode 1  Aired: 7/11/2011\n\nThe New Guy\n\nPete tries to adjust to a new partner while investigating a string of bizarre deaths in Denver. The last words of the victims leads the agents to an old friend. Meanwhile, Artie and Claudia try to stop a lightning storm in the Warehouse.\n\n\nSeason 3, Episode 2  Aired: 7/18/2011\n\n\n\nTrials\n\nPete and Myka try to locate an artifact responsible for victims losing their minds... literally. Meanwhile, Steve and Claudia go to Boston to find Typhoid Mary's knife, which can transfer illnesses and injuries from one person to another.  \n\nSeason 3, Episode 3  Aired: 7/25/2011\n\nLove Sick\n\nArtie and Claudia team up with Dr. Vanessa Calder and Hugo Miller to deal with an artifact that has created a computer virus that transforms people into clay. Meanwhile, Pete and Myka wake up at the warehouse, naked with no memory of their night together, and try to retrace their steps and discover what happened to Steve.\n\nSeason 3, Episode 4  Aired: 8/1/2011\n\n\n\nQueen For A Day\n\nPete's ex-wife Amanda visits to tell Pete that she's remarrying, and inadvertently picks up an artifact that turns anyone she touches into her undying slave. Meanwhile, Claudia and Steve go to a Civil War reenactment to recover U.S. Grant's flask.  \n\n\nSeason 3, Episode 5  Aired: 8/8/2011\n\n3 . . . 2 . . . 1\n\nPete and Myka are forced to team up with Helena to seek her advice on an artifact that she dealt with in 19th century London... and has turned back up in the present day to wreak havoc. \n\n\nSeason 3, Episode 6  Aired: 8/15/2011\n\nDon't Hate The Player\n\nThe agents and Claudia team up to free Douglas Fargo and another gamer from a virtual reality fantasy world. Meanwhile, Steve and Artie try to steal an artifact painting in New York but run up against FBI agent Sally Stukowski. \n\n\n\nSeason 3, Episode 7  Aired: 8/22/2011\n\nPast Imperfect\n\nPete helps Myka catch a dangerous killer--the man who murdered her previous partner. Meanwhile, Artie, Claudia, and Steve interrogate a dog that is a key witness to the theft of an artifact. \n\n\nSeason 3, Episode 8  Aired: 8/29/2011\n\nThe 40th Floor\n\nA mystery organization launches an attack on the Warehouse Regents, trapping them in a skyscraper. While Myka and Artie try to get them to safety, Pete and Claudia try to find the artifact responsible. \n\n\nSeason 3, Episode 9  Aired: 9/12/2011\n\nShadows\n\nWhile Claudia and Myka investigate the case of a woman who can disintegrate anyone who angers her, Pete and his mother deal with their issues after being reunited. \n\n\n\nSeason 3, Episode 10  Aired: 9/19/2011\n\nInsatiable\n\nWhile Myka and Pete deal with a zombie plague spread by an unknown artifact, Claudia tries to reach Jinks\n\n\n\nSeason 3, Episode 11  Aired: 10/3/2011\n\nEmily Lake/Stand\n\nSykes reveals his plan to get revenge on the Regents and recover the Collodi Bracelet, a plan that will cost one agent their life. \n\n\n\nSeason 3, Episode 12  Aired: 12/0/2011\n\nThe Greatest Gift\n\nPete inadvertently activates an artifact that creates an alternate reality where he never existed. To restore reality as he knows it, Pete must track down his friends, who have new lives and no memory of him. \n\n","torrent":{"xt":"urn:btih:188a45a7148407091c6caa1daa62da6b9a605f14","amp;dn":"Warehouse+13+Season+3+complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"188a45a7148407091c6caa1daa62da6b9a605f14","infoHashBuffer":{"type":"Buffer","data":[24,138,69,167,20,132,7,9,28,108,170,29,170,98,218,107,154,96,95,20]},"announce":[],"urlList":[]}}