{"title":"DOLPHIN TALE RMVB GLOBE","uid":6744586,"size":251944000,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1c14d46822ec124a6eeb54df22cfadb0e09bc9cd&amp;dn=DOLPHIN+TALE+RMVB+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1318633594,"description":"* RMVB CAM  * 01H43M32S  * Worked with the Dub plugins\n\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* RECOMMENDED PLAYERS :\n\n\n- RMVB PLAYER or - MEDIACOPE \n\nor convert to your prefered video type for any other player\n\n\n* INTRO :\n\nDolphin Tale is a 2011 family drama film directed by Charles Martin Smith from a screenplay by Karen Janszen and Noam Dromi starring Harry Connick, Jr., Ashley Judd, and Morgan Freeman, and is based on the book of the same name. The film is \\&quot;inspired by the amazing true story of Winter\\&quot;, a bottlenose dolphin that was rescued off the Florida coast and taken in by the Clearwater Marine Aquarium, in the process losing its tail and having to be fitted with a prosthetic one.\n\n\n* Plot  :\n \nThe initial scenes of the movie show a school of dolphins in their natural state, followed by a crab fisherman returning a crab trap to the ocean after emptying the trap of its contents.\n A young boy, Sawyer Nelson (Nathan Gamble), is biking along the beach when a fisherman calls for help after finding an injured bottlenose dolphin tangled in a crab trap. The two call for assistance, and rescue workers from the Clearwater Marine Hospital, run by Dr. Clay Haskett (Harry Connick Jr.), take the injured dolphin for treatment.\nClay\\'s daughter Hazel (Cozi Zuehlsdorff) names the dolphin Winter, as two prior dolphins (Summer and Autumn) were successfully returned to the ocean, and believes that using seasons as names will continue the streak. She allows Sawyer to see Winter; Clay initially does not like the arrangement since Sawyer is not trained in marine animal care; however, after noticing that Winter responds well whenever Sawyer is around, he is allowed to visit. Afterwards Sawyer (who was enrolled in summer school due to him failing or nearly failing all his classes during the year) skips classes to daily visit Winter.\n\n\n\n\n\n* enjoy ..\n\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2011\n\n\n\n","torrent":{"xt":"urn:btih:1c14d46822ec124a6eeb54df22cfadb0e09bc9cd","amp;dn":"DOLPHIN+TALE+RMVB+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c14d46822ec124a6eeb54df22cfadb0e09bc9cd","infoHashBuffer":{"type":"Buffer","data":[28,20,212,104,34,236,18,74,110,235,84,223,34,207,173,176,224,155,201,205]},"announce":[],"urlList":[]}}