{"title":"Guilty Gear Gold","uid":6729876,"size":1203056921,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1cfbbcf6917f1cdbc0d60c753cfbafee19ecd4a0&amp;dn=Guilty+Gear+Gold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"marco699","files":-1,"time":1318096875,"description":"Fighting a rare genre for the PC, is one of the world's most popular gaming consoles. Guilty Gear - a reference series, made with a truly Japanese taste. Fighters perfectly balanced, and each has its own set of grueling mind bending techniques. The collection of Guilty Gear Gold includes all three games of this legendary series on the PC - \n\nBy Your Side - the second game in the series Guilty Gear.\nis a two-dimensional fighting game in which the player can choose one of the fourteen characters and compete in the arena with an opponent from among the same characters, which vary greatly and the appearance and fighting style.\n\nGuilty Gear Isuka - the latest game in the series, released on the PC - are interested in their team competitions. Simultaneously on the same computer can play up to four players!\n\nGuilty Gear X2 # Reload - hit game in the series - can boast a nine game modes, among which are especially worth noting Mission - single task of varying difficulty.\n\nFeatures:\n&quot;Multi-Gauge System for a perfect balance of combat\n&quot;Astounding combos and fighting techniques that are unique to each soldier\n&quot;Graphics in a unique style of anime\n&quot;Downhole soundtrack consisting of songs of Japanese rock music\n&quot;The possibility of simultaneous games on one computer for up to four players\n&quot;A lot of game modes: single game, two on two battle, team battle against the computer opponent\n&quot;20 fantastic men: each with its own arsenal and a set of techniques, including the instant murder\n&quot;9 game modes, including Mission - about a hundred tasks of varying difficulty\n&quot;A bonus and secret game modes with unrealistically powerful foes and updated methods\n\nFeatures:\nBased on the original release\nSupport for network game in Reload\nRePacked by [R.G. Catalyst]\n\nSystem requirements:\n- Operating system: Microsoft Ã‚Â® Windows Ã‚Â® 98SE/Me/2000/XP/Vista/Seven\n- Processor: Pentium Ã‚Â® II 500 MHz\n- Memory: 64 MB RAM\n- Video: 32 MB\n- Sound card: compatible with DirectX Ã‚Â® 8.1\n- Free space on hard disk: 1,8 GB\n\n\nINSTALL: \n\n1:click on set up \n\n2: Install is in russain but easy to work out\n\n3: games are in 100% english","torrent":{"xt":"urn:btih:1cfbbcf6917f1cdbc0d60c753cfbafee19ecd4a0","amp;dn":"Guilty+Gear+Gold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cfbbcf6917f1cdbc0d60c753cfbafee19ecd4a0","infoHashBuffer":{"type":"Buffer","data":[28,251,188,246,145,127,28,219,192,214,12,117,60,251,175,238,25,236,212,160]},"announce":[],"urlList":[]}}