{"title":"Minecraft 1.0 Easy Installer 3.0.0 ~kaise123~","uid":6849994,"size":48900738,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1e76a5c64a3ac91eed172864bfe9b751569bd19e&amp;dn=Minecraft+1.0+Easy+Installer+3.0.0+%7Ekaise123%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kaise123","files":-1,"time":1322480213,"description":"Uploading with dial-up again sorry for the first few people... \n************************ Kaise123 ***************************\nMinecraft installer 3.0.0 for minecraft 1.0.0\nREAD THIS !!!BEFORE!!! (Especially the troubleshooting section) You E-Mail me for help\nI will be using the same name on all my torrents now to avoid confusion with the names (Sorry)\n\nThis Minecraft installer was compiled by kaise123 (Kai)\n\nThis installer has 3 options for Basic minecraft without mods, minecraft with mods, and minecraft with a mod for improving performance (For slow computers) It is easy to choose which version you want in the installer. All versions have an in-built list of cracked minecraft servers.\n\nI take no credit for the loader, which was created by AngelDE98, AnjoCaido, Mojang (The base), Kartracer97, Smoolak, JBExtrem, Zebz213 and others.\nI merely added all the mods and the 'cracked' loader and made a convenient easy-to-use installer that gives you options =)\nThe mods are owned by their respective creators and I take no credit for their creation. To see the page the mods came from just Google the mod's name.\n\nThis is an easy-to-use, user-friendly way of putting minecraft on your computer.\n\nYou can contact me via e-mail &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;88f6e3e9e1fbedb9babbc8efe5e9e1e4a6ebe7e5&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;~. Or add me on Skype (kaiwaugh)\n\nKnown Bugs:\nSometimes some of the Zombe mods don't work in some places\nThe No-Clip mode doesn't work\nPlease report ANY non-normal minecraft errors or bugs to me!\n\n################### ABOUT ####################\n\nThis installer can install minecraft without mods (Vanilla Minecraft) and with Mods\nWhen installed in the multiplayer menu there is already a list of cracked servers for you to play. The top one is mine :)\n\nTo play just run the installer, choose what version you wish to install and than click on the icon either on your desktop or in the start menu. If you have a slow internet connection it may take longer to load because it loads the news page.\n\nThe modded version includes thease mods:\n\nZombe's Modpack - A multitude of different mods (Press F7 In-Game for options)\nWorldEdit CUI - Allows you to see your worldedit selection\nTooManyItems - In-Game item spawning\nSingle-Player commands - Allows you to use commands and worldedit in single player\nRei's Minimap - A better map than the inbuilt minecraft one that shows other players and mobs (If supported by server)\nConsole - A better console for minecraft multiplayer\nModloader - Used for better mod compatibility\n*Optifine* - Improves minecraft performance by adding various tweaks. Only in the OptiFine Version.\n\n################## CHANGES ###################\n\nChanged this version:\nVersion 3.0.0\nFor Minecraft 1.0.0\n\n+ Updated to minecraft full release\n+ Added Console mod\n+ Added loading screen because sometimes it takes a while to come up (15sec max)\n* Changed from Zan's minimap to Rei's minimap because Lawhran has decided to stop updating his mods.\n* Updated all mods to the 1.0.0 version. Some new features\n* Changed the way the loader opens so that the 'Command window shows, disappears and nothing happens' problem is fixed.\n* Updated the readme layout and added some stuff i should have before, Learned how to use spell-correct :)\n- Removed Dynamic Lights\n\n################# Controls ##################\n\nThe controls for basic minecraft are in the controls section in 'Options'. Other Controls (For the modded version only) are below:\n\nF = Fly On/Off\nE = Fly Up\nQ = Fly Down\nLSHIFT = Fly/walk faster (different from 1.8's sprint feature)\nF6 = NoClip while flying (SSP/CSP ONLY) (Not working for me on 1.0 ??)\nBackspace = Path tracker (See where you have walked)\nL = Shows where Hostile Mobs can spawn (Yellow = Night only, Red = Anytime)\nO = (in the inventory) = Enables/Disables TooManyItems\nF7 = Shows Zombe's modoack menu\nM = Shows minimap menu\nBackSlash = Minecraft console\nIn single player press the chat button and type &quot;help&quot; to see single player commands commands.\n\n############## TROUBLESHOOTING ###############\n\nIf you find that mods don't work, RE-install using the installer and try again. If it still does not work RE-install again and try without an internet connection and see if that works\n\nMinecraft lags??? Try the optifine version. Even though the game may look like it has crap graphics it still needs a half-decent PC to run on.\n\nJava Error? (EG: A Java Run Time Environment was not found on your computer) Install the latest java. 64 Bit computers often need both the 64 AND the 32 bit version.\n\n#######################################\nIf you appreciate my work, click the +1 Button at the top, so others can see that it is a good torrent :)","torrent":{"xt":"urn:btih:1e76a5c64a3ac91eed172864bfe9b751569bd19e","amp;dn":"Minecraft+1.0+Easy+Installer+3.0.0+%7Ekaise123%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e76a5c64a3ac91eed172864bfe9b751569bd19e","infoHashBuffer":{"type":"Buffer","data":[30,118,165,198,74,58,201,30,237,23,40,100,191,233,183,81,86,155,209,158]},"announce":[],"urlList":[]}}