{"title":"ROCK OF AGES xvid cam - GLOBE","uid":7402961,"size":1428778304,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:214d1fc8222d48c36291e2d168d33f4d61fe3c5c&amp;dn=ROCK+OF+AGES+xvid+cam+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1341160458,"description":"* XVID CAM  * 01H56M15S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n* Plot :\n\nIn 1987, Sherrie Christian (Julianne Hough) travels from Tulsa, Oklahoma, to Los Angeles with dreams of becoming a famous singer while barback Drew Boley (Diego Boneta) prepares for another night of work at &quot;The Bourbon Room,&quot; a popular nightclub on the Sunset Strip (&quot;Sister Christian&quot; / &quot;Just Like Paradise&quot; / &quot;Nothin' but a Good Time&quot;). As Sherrie approaches The Bourbon, her suitcase, containing her favorite records, is stolen. Seeing the incident, Drew tries to catch the robber, but fails. He comforts Sherrie and, upon learning of her situation, he gets her a job at the Bourbon Room as a waitress.\n\nThe club's owner, Dennis Dupree (Alec Baldwin), and his right-hand man, Lonny Barnett (Russell Brand), are trying to find a way to deal with unpaid taxes that are threatening the club, wishing their love of rock 'n' roll could keep it alive. Drew and Sherrie go to a Tower Records store and look through the used records for sale, both confessing their dreams of becoming famous (&quot;Juke Box Hero&quot; / &quot;I Love Rock 'n' Roll&quot;). Dennis and Lonny finally decide to book Stacee Jaxx (Tom Cruise), a famous rock star who has recently announced that he will be resigning from his band, Arsenal, to perform at the Bourbon in hopes of raising enough money to clear up their debt. Upon hearing of Jaxx's upcoming concert, Patricia Whitmore (Catherine Zeta-Jones), the religious conservative wife of Mayor Mike Whitmore (Bryan Cranston), organizes her church to protest in front of the Bourbon Room, planning to shut them down in an attempt to rid L.A. of its &quot;sex, drugs, and rock 'n' roll&quot; image (&quot;Hit Me With Your Best Shot&quot;).\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:214d1fc8222d48c36291e2d168d33f4d61fe3c5c","amp;dn":"ROCK+OF+AGES+xvid+cam+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"214d1fc8222d48c36291e2d168d33f4d61fe3c5c","infoHashBuffer":{"type":"Buffer","data":[33,77,31,200,34,45,72,195,98,145,226,209,104,211,63,77,97,254,60,92]},"announce":[],"urlList":[]}}