{"title":"Bruce Cockburn...Life Short Call Now(2006) [FLAC]","uid":6695336,"size":379283434,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2207fff5a0f843958fa5f130b35e764c4440bebf&amp;dn=Bruce+Cockburn...Life+Short+Call+Now%282006%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":16,"time":1316759417,"description":"[img]http://i.imgur.com/UZRRN.jpg[/img]\n[color=Green]Life Short Call Now [2006] Cooking Vinyl Records 381[/color] \n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n[01] Life Short Call Now \t\t(5:32)\n[02] See You Tomorrow \t\t(4:20)\n[03] Mystery \t\t\t(5:50)\n[04] Beautiful Creatures \t\t(5:09)\n[05] Peace March \t\t\t(3:20)\n[06] Slow Down Fast \t\t\t(3:39)\n[07] Tell The Universe \t\t(5:14)\n[08] This Is Bagdad \t\t\t(6:21)\n[09] Jerusalem Poker \t\t\t(5:33)\n[10] Different When It Comes To You\t(2:20)\n[11] To Fit In My Heart \t\t(6:06)\n[12] Nude Descending a Staircase \t(4:23)\n\nBruce Cockburn displayed his aesthetic restlessness with his instrumental album Speechless in 2005. Those who have followed his career over the past four decades wondered where he would go next, or indeed if there was anywhere he could go. The question has been answered in spades on Life Short Call Now. Along with his regular band, Cockburn has employed an orchestral 27-piece string section to expressionistically color a good number of these 12 songs with help from producer Jon Goldsmith. Lyrically, Cockburn has returned to the terrain he alone inhabits: intimate observations of the personal, the spiritual, the sociopolitical and environmental concerns. As is also his wont, there are no sloganeering anthems in these songs. From the title track that opens the album, he looks across the Montreal landscape and observes it, not in a journalistic way, but as someone inside it, and asks poignantly. &quot;Can one man fit in a normal life?&quot; The solitary person in the midst of unions, holy and unholy, can find no way to properly say goodbye or welcome. Ani DiFranco sings backing vocals on &quot;See You Tomorrow,&quot; where Cockburn turns the tables on himself as he observes a mercenary, and though he understands the man's empty soul he envies his freedom from guilt to accomplish his task. Isolation in the midst of watching women walk mirrors the pain of sin and of loneliness for the beloved and seeks wholeness which he expresses that beyond &quot;these chains of flesh&quot; there is completion. The gentleness of his approach is also notable. Cockburn isn't raging here, he's expressing the hidden, the unseen, the unspeakable. Check the lovely, languid folk song &quot;Mystery,&quot; where he embraces what is unknowable infinitely despite his fear and his hunger for it. A four-piece horn section adorns the mix on the outside, underscoring the questions in the grain of the singer's voice. What happens as the record unfolds is the work of a poet who happens to be a brilliant musician, who has refined his craft not as an aesthete, but as a hands-dirtied participant not only in the process, but in its realization: check the gorgeous falsetto that croons above the swell of strings in &quot;Beautiful Creatures.&quot; He asks straight up, from the gut: &quot;When the skin is peeled off it/What is there to say?&quot; And then says it: The beautiful creatures are/going away...&quot; In many ways, there is a tenderness here that Cockburn's listeners haven't encountered since &quot;Humans,&quot; where fear, desire, shock, awe and boundless love poured from his songs. And they do so here, too, tempered by a bloody but unbowed veteran of love, despair, spiritual hunger, desolation and the acknowledgement of community. Always a guitar to accompany that voice, always six strings whispering through the singer and carrying him through not only emotions, but scenes, places, times, encounters, to be able to speak clearly and directly, yet softly, with one exception: &quot;This Is Baghdad.&quot; Here the observer battles the brokenness inside himself as he observes -- Cockburn spent part of 2004 there -- the mindless destruction for the sake of nothing whatsoever. The display of might by American troops under the guidance of a fearful leader is revealed for what it is: the display of power for its own sake, which is for the sake of nothing. The deep end of the string section hovers around his 12-string, and the hypnotic pulse of Gary Craig's drums. There are three fine instrumentals here as well. &quot;Peace March,&quot; is driven by that now-trademark fluid guitar kissed with a brushed snare, a tempered bassline which reveals the refined texture of a master painter. &quot;Jerusalem Poker&quot; with its handclapped percussion is a jazz tune with its syncopated guitar and muted flugelhorn. The album's final cut, too, named for Marcel Duchamp's infamous &quot;Nude Descending a Staircase&quot; is introduced by radio static, and then seamlessly flows into a guitar driven jazz tune with Cockburn playing a Byrdland and doing his best Wes Montgomery as strings shimmer and spiral down; a muted trumpet pushes down on the proceeding as more found sounds carry it--before the final cocking of what seems like a gun as silence abruptly drapes the entire proceeding. Life Short Call Now is absent of metonymy or metaphor; it reports from the inside what is, and what should never be with balance, as well as yearning for convergence. \n\ncd ripped by EAC(thanks cheerup)\n\nplease seed\n\n[url]http://dickthespic.org/2011/03/11/bruce-cockburn/[/url]","torrent":{"xt":"urn:btih:2207fff5a0f843958fa5f130b35e764c4440bebf","amp;dn":"Bruce+Cockburn...Life+Short+Call+Now%282006%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2207fff5a0f843958fa5f130b35e764c4440bebf","infoHashBuffer":{"type":"Buffer","data":[34,7,255,245,160,248,67,149,143,165,241,48,179,94,118,76,68,64,190,191]},"announce":[],"urlList":[]}}