{"title":"The Jim Bohannon Show 24-Oct-11 CF mp3 32K","uid":6769858,"size":28592462,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:23ac7cbbd8f536620c9de2ee465d02ff3276dd87&amp;dn=The+Jim+Bohannon+Show+24-Oct-11+CF+mp3+32K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"iChatter","files":2,"time":1319541744,"description":"The Jim Bohannon Show 24-Oct-11 CF mp3 32K\nCommercial Free\n\n\nMonday, October 24, 2011\n\nOn The Jim Bohannon Show...\nThere is a lot of unhappiness with America right now - and that's within the borders of our own country. The anger comes from the Right and the Left, with both the tea party forces and the &quot;Occupy&quot; protesters unhappy with the direction the nation is taking. Can it be that the American experiment in democracy is failing, and that the country's best days are behind her? Despite our woes, America is still the strongest nation or Earth, and the richest, but you would be hard-pressed right now to find anyone particularly optimistic about the future. According to our guest tonight, in just a few decades, the America we have known and cherished will be gone forever. Pat Buchanan makes a return visit to explain why, taken from his new book &quot;Suicide of a Superpower: Will America Survive to 2025?&quot; (published by Thomas Dunne Books). The concept of the American Melting Pot, where other cultures were absorbed into the American whole and making it richer, is being abandoned as we now pursue separateness: the multiracial, the multicultural, the multilingual, and the multiethnic, and in so doing are losing the identity that has made our nation so successful over the generations.\n\nEven when times are good, we Americans have a hard time wrapping our heads around important economic concepts. Helping to expand our knowledge was the book &quot;Basic Economics,&quot; from our guest tonight, Thomas Sowell. But Mr. Sowell has written on many topics over the past decades, and the very best of his work has now been collected in the book &quot;The Thomas Sowell Reader&quot; (published by Basic Books). While economics is well-represented, the book also covers social, cultural, legal, educational, and political issues. The sources range from Dr. Sowell's letters, books, newspaper columns, and articles in both scholarly journals and popular magazines. It is often difficult to find clear thinking on the issues today, but in Dr. Sowell we have a national resource we would be wise to heed. (His website is www.TSowell.com.)","torrent":{"xt":"urn:btih:23ac7cbbd8f536620c9de2ee465d02ff3276dd87","amp;dn":"The+Jim+Bohannon+Show+24-Oct-11+CF+mp3+32K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23ac7cbbd8f536620c9de2ee465d02ff3276dd87","infoHashBuffer":{"type":"Buffer","data":[35,172,124,187,216,245,54,98,12,157,226,238,70,93,2,255,50,118,221,135]},"announce":[],"urlList":[]}}