{"title":"WarcraftIII+FrozenThrone","uid":7426930,"size":1136115712,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:259c620bd6d8b13dd3ca18aecb88abc12b390c81&amp;dn=WarcraftIII%2BFrozenThrone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1341831152,"description":"Warcraft III: Reign of Chaos (often referred to as War3 or WC3 or RoC) is a real time strategy video game released by Blizzard Entertainment on July 3, 2002 (US). It is the second sequel to Warcraft: Orcs &amp; Humans, and it is the third game set in the Warcraft Universe. An expansion pack, The Frozen Throne, was released on July 1, 2003 (US).\n\nWarcraft III contains four playable races: Humans and Orcs, which had previously appeared in Warcraft: Orcs &amp; Humans and Warcraft II: Tides of Darkness, and the Night Elves and Undead, which were introduced to the Warcraft mythos in this installment. Warcraft III's single-player campaign is laid out similarly to that of StarCraft (another Blizzard game), being told through all four of the game's races in a progressive manner. In the expansion there are two additional races: the Draenei, a race of eredar who are cursed to be abominations, and the Naga, a race of vile serpents and other creatures that come from the depths of the sea. Multiplayer mode allows for play against other people, via the internet, instead of playing against computer-controlled characters as is done in the single-player custom game mode. Due to the dual storylines of the previous Warcraft games, the story can only be understood if using the proper storylines of one of the campaigns in the previous games, being the Orc Campaign on Warcraft: Orcs &amp; Humans and the Human Campaigns on both the Warcraft II: Tides of Darkness and Warcraft II: Beyond the Dark Portal.\n\nThe game proved to be a best seller and one of the most anticipated and popular computer game releases ever, with 4.5 million units shipped to retail stores and over one million units sold within a month. Warcraft III won many awards including &quot;Game of the Year&quot; from more than six different publications.","torrent":{"xt":"urn:btih:259c620bd6d8b13dd3ca18aecb88abc12b390c81","amp;dn":"WarcraftIII%2BFrozenThrone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"259c620bd6d8b13dd3ca18aecb88abc12b390c81","infoHashBuffer":{"type":"Buffer","data":[37,156,98,11,214,216,177,61,211,202,24,174,203,136,171,193,43,57,12,129]},"announce":[],"urlList":[]}}