{"title":"Clint.Eastwood.Pale.Rider(1985)","uid":7419783,"size":711145088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:262de1d113ca6aa2da8585c597db38f2c216809a&amp;dn=Clint.Eastwood.Pale.Rider%281985%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"00rimme","files":5,"time":1341629683,"description":"Pale Rider (1985)\n\nA mysterious and possibly otherworldly stranger comes to the rescue of a frontier town in this Western. The peace of a small mining community is shattered when Coy LaHood (Richard Dysart), the ruthless proprietor of a powerful strip-mining company, arrives in town with his son Josh (Christopher Penn) and a posse of hired guns to drive out the townspeople and take control of the territory. Megan (Sydney Penny), a young girl whose pet was killed in the melee, prays to God for someone to defend the village from the marauders; soon, the Preacher (Clint Eastwood) arrives on a pale horse, and joins forces with Hull Barrett (Michael Moriarty), the unofficial leader of the miners and one of the few who attempts to defend himself, to take a stand against LaHood and his men. As the Preacher and Barrett try to organize the miners to fight the invaders, both Megan and her mother Sarah (Carrie Snodgrass) find they're drawn to the Preacher, who keeps to himself and seems to have more than his share of secrets.\n\n    Josh LaHood: [preacher has just hit Club in the groin with a sledgehammer - Josh LaHood looks at Club when he gets back up on his horse and they start to ride away] You think you can make it?\n    Club: Ice! Ice!\n\n&quot;A lesser Western by Eastwood's standards, but many a filmmaker would consider this a career high point.&quot; Enjoy","torrent":{"xt":"urn:btih:262de1d113ca6aa2da8585c597db38f2c216809a","amp;dn":"Clint.Eastwood.Pale.Rider%281985%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"262de1d113ca6aa2da8585c597db38f2c216809a","infoHashBuffer":{"type":"Buffer","data":[38,45,225,209,19,202,106,162,218,133,133,197,151,219,56,242,194,22,128,154]},"announce":[],"urlList":[]}}