{"title":"Truth &amp; Beauty- A Friendship by Ann Patchett - pdf,mobi,KK","uid":6746041,"size":705363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26adec9509b90da730d3e16b55f18b68f2f598ff&amp;dn=Truth+%26amp%3B+Beauty-+A+Friendship+by+Ann+Patchett+-+pdf%2Cmobi%2CKK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"karaokeking123","files":-1,"time":1318690682,"description":"Truth &amp; Beauty- A Friendship by Ann Patchett - pdf,mobi,KK\n\n What happens when the person who is your family is someone you aren't bound to by blood? What happens when the person you promise to love and to honor for the rest of your life is not your lover, but your best friend? In Truth &amp; Beauty, her frank and startlingly intimate first work of nonfiction, Ann Patchett shines a fresh, revealing light on the world of women's friendships and shows us what it means to stand together. \n\nAnn Patchett and Lucy Grealy met in college in 1981, and, after enrolling in the Iowa Writers' Workshop, began a friendship that would be as defining to both of their lives as their work was. In her critically acclaimed and hugely successful memoir, Autobiography of a Face, Lucy Grealy wrote about losing part of her jaw to childhood cancer, the years of chemotherapy and radiation, and then the endless reconstructive surgeries. In Truth &amp; Beauty, the story isn't Lucy's life or Ann's life, but the parts of their lives they shared. This is a portrait of unwavering commitment that spans twenty years, from the long, cold winters of the Midwest, to surgical wards, to book parties in New York. Through love, fame, drugs, and despair, this book shows us what it means to be part of two lives that are intertwined.  \n\n\nEnjoy!","torrent":{"xt":"urn:btih:26adec9509b90da730d3e16b55f18b68f2f598ff","amp;dn":"Truth+%26amp%3B+Beauty-+A+Friendship+by+Ann+Patchett+-+pdf%2Cmobi%2CKK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26adec9509b90da730d3e16b55f18b68f2f598ff","infoHashBuffer":{"type":"Buffer","data":[38,173,236,149,9,185,13,167,48,211,225,107,85,241,139,104,242,245,152,255]},"announce":[],"urlList":[]}}