{"title":"Ouran High School Host Club Ep.1 (Eng. Sub) [imsourav]","uid":6716747,"size":41142902,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:28f49f91f4cb91ccd7a664bf0130422c022a0a07&amp;dn=Ouran+High+School+Host+Club+Ep.1+%28Eng.+Sub%29+%5Bimsourav%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PirateBoy","files":1,"time":1317586653,"description":"\n\n=======================\n===========================\nOuran High School Host Club\n===========================\n=======================\n\nGenre:    Drama/Comedy\n======\n\nDescription:\n=========\nHaruhi is a poor tomboyish student at a school for the ultra-wealthy, able to attend because of a scholarship, and unable to even afford a uniform. One day, she stumbles across the decidedly peculiar but very popular Ouran Host Club. She tries to leave, but accidentally breaks a vase, and unable to pay for it, she's told that she'll have to stay and do odd jobs. That is, until they decide she would be more valuable as a club member. Not realizing she's female due to her appearance, they fix her up and give her a male uniform. She's an instant hit, so they decide to have her keep up the charade even after they find out the truth. Haruhi, being average almost to a fault, doesn't know what to make of the unconventional activities of the Host Club (or of the even more unconventional members), but having little choice, she plays along. Before long, real bonds are formed, friends made, and Haruhi finds herself accepted in a way she could never have been otherwise in this affluent school.\n\nEpisode Details:\n=============\n\n01 \t&quot;Starting Today, You are a Host!&quot;\n\nScholarship student Haruhi Fujioka arrives at the elite private school Ouran Academy where she is mistaken for a boy due to her male appearance and personality. Haruhi stumbles upon the host club, in abandoned &quot;Music Room 3&quot;, while looking for a quiet place to study and, while trying to escape, accidentally breaks an vase costing eight million yen. To pay off the debt, Haruhi is forced to become a host and obtain one hundred &quot;requests&quot; from customers. One by one, the other host members come to realize Haruhi's true gender except for Tamaki Suou. Haruhi later gets into a fight with Ayanokoji, one of Tamaki's jealous customers, changing her quota to one thousand customers. The fight is broken up when Haruhi and Ayanokoji are doused with water, requiring Haruhi to change into a dry girl's, uniform. At this point, Tamaki walks in on her while she is undressed, discovering her to be a girl.\n\nFormat:  .mp4\n======\n\nEnglish Subtitle by:   Speedy Joe\n===============\n\nUploader Notes:\n==============\n\nIts one of the best animes in the comedy genre....please check it out...:)\n\nSeed...enjoy... :)","torrent":{"xt":"urn:btih:28f49f91f4cb91ccd7a664bf0130422c022a0a07","amp;dn":"Ouran+High+School+Host+Club+Ep.1+%28Eng.+Sub%29+%5Bimsourav%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28f49f91f4cb91ccd7a664bf0130422c022a0a07","infoHashBuffer":{"type":"Buffer","data":[40,244,159,145,244,203,145,204,215,166,100,191,1,48,66,44,2,42,10,7]},"announce":[],"urlList":[]}}