{"title":"My.Evil.Sluts.8.DiSC2.XXX.DVDRip.XviD-Jiggly","uid":6693683,"size":732095375,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2991855b82b23e0bcfe1f6c19dc9407dfc9fd9a3&amp;dn=My.Evil.Sluts.8.DiSC2.XXX.DVDRip.XviD-Jiggly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":4,"time":1316649626,"description":"Screens: &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=e0vksibprdzvjduwdi7b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=e0vksibprdzvjduwdi7b.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=462u3i1zgqpe6a9gprn3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=462u3i1zgqpe6a9gprn3.jpg&lt;/a&gt;\n\n\n\nCast: Bambi, Barbie White, Daisy Marie, Honey Demon, Lea Lexus, Lucy Cattiva, Puma Swede, Sandy, Valentina Blue, Zafira\n\nSpecial 2-Disc Set. Cruel Media honcho Raul Cristian takes us to the dark side of lesbian lust in My Evil Sluts 8, a sick celebration of all-girl perversions featuring an international cast of sexy girls who love girls. In seven scenes spread over four-and-a-half hours, these beauties prove that members of the fairer sex can be just as pussy-crazed as any man! The double-disc DVD includes photo slideshow.Busty, tattooed and adorable, sweet Latina Daisy Marie gets her little, shaved poontang sampled by blonde Sandy. They grind their pussies together, invade each other with large dildos, and Sandy fingers Daisy`s twat until the foxy senorita squirts girl-juice into her palm.Next, Sandy joins Amazonian blonde Puma Swede in the bedroom, where they drill one another with a strap-on; the statuesque, big-boobed bitch stuffs panties in Sandy`s hole and makes her suck feet while jamming her bare toes into Puma`s cunt.Two stunning brunettes, voluptuous supermodel Zafira and her skinny, freckled friend Bambi, bang each other`s pussy with big, fake cocks.Dark-haired Honey Demon and her blonde buddy Valentina Blue trade tongue and toy action in a poolside lickathon.Lovely, petite blonde Barbie White and silver spandex-clad Lucy Cattiva have a fingering and cunnilingual party.Bouncy-bottomed blonde Lea Lexis teases the camera in a solo masturbation session, gagging on long dildos, reaming her winking asshole and flaunting her perfect, supple, bare feet.And lastly, Puma returns for some kinky vibrator self-pleasure, with a little help from Sandy`s probing fingers. What a wicked bunch of sluts!","torrent":{"xt":"urn:btih:2991855b82b23e0bcfe1f6c19dc9407dfc9fd9a3","amp;dn":"My.Evil.Sluts.8.DiSC2.XXX.DVDRip.XviD-Jiggly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2991855b82b23e0bcfe1f6c19dc9407dfc9fd9a3","infoHashBuffer":{"type":"Buffer","data":[41,145,133,91,130,178,62,11,207,225,246,193,157,201,64,125,252,159,217,163]},"announce":[],"urlList":[]}}