{"title":"Satan's Circus - Mike Dash   (2007 - True Crime Story)","uid":6773794,"size":185199413,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2c24cfa32da5126d1981031688f6e9e266c8f1aa&amp;dn=Satan%5C%27s+Circus+-+Mike+Dash+++%282007+-+True+Crime+Story%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neil1966hardy","files":14,"time":1319662519,"description":"Nearly five million men and women have served the United States as police officers. Only one has been executed for murder.\n\nThey called it Satan's Circus, a square mile of Midtown Manhattan where vice ruled, sin flourished, and depravity danced in every doorway. At the turn of the 20th century, murder was so common in the vice district that few people were surprised when the loudmouthed owner of a shabby casino was gunned down on the steps of its best hotel. But when, two weeks later, an ambitious district attorney charged young policeman Charley Becker with ordering the murder, even the denizens of Satan's Circus were surprised. The handsome lieutenant was a decorated hero, the renowned leader of New York's vice-busting Special Squad. Was he a bad cop leading a double life, or a pawn felled by the sinister rogues who ran Manhattan's underworld?\n\nWith appearances by the legendary and the notorious, Satan's Circus brings to life an almost-forgotten Gotham. Chronicling Charley Becker's rise and fall, the audiobook tells of the raucous, gaudy, and utterly corrupt city that made him, and recounts not one but two sensational murder trials that landed him in the electric chair.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:2c24cfa32da5126d1981031688f6e9e266c8f1aa","amp;dn":"Satan%5C%27s+Circus+-+Mike+Dash+++%282007+-+True+Crime+Story%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c24cfa32da5126d1981031688f6e9e266c8f1aa","infoHashBuffer":{"type":"Buffer","data":[44,36,207,163,45,165,18,109,25,129,3,22,136,246,233,226,102,200,241,170]},"announce":[],"urlList":[]}}