{"title":"Alien Species and Evolution {BBS}","uid":6853375,"size":1485236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2cf2c58cb74135f1e8dd9c6284200cf5eeefdc96&amp;dn=Alien+Species+and+Evolution+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1322605492,"description":"In Alien Species and Evolution, biologist George W. Cox reviews and synthesizes emerging information on the evolutionary changes that occur in plants, animals, and microbial organisms when they colonize new geographical areas, and on the evolutionary responses of the native species with which alien species interact.\n\nThe book is broad in scope, exploring information across a wide variety of taxonomic groups, trophic levels, and geographic areas. It examines theoretical topics related to rapid evolutionary change and supports the emerging concept that species introduced to new physical and biotic environments are particularly prone to rapid evolution. The author draws on examples from all parts of the world and all major ecosystem types, and the variety of examples used gives considerable insight into the patterns of evolution that are likely to result from the massive introduction of species to new geographic regions that is currently occurring around the globe.\n\nAlien Species and Evolution is the only state-of-the-art review and synthesis available of this critically important topic, and is an essential work for anyone concerned with the new science of invasion biology or the threats posed by invasive species.\n\n\n# Paperback: 400 pages\n# Publisher: Island Press; 1 edition (June 25, 2004)\n# Language: English\n# ISBN-10: 1559630094\n# ISBN-13: 978-1559630092","torrent":{"xt":"urn:btih:2cf2c58cb74135f1e8dd9c6284200cf5eeefdc96","amp;dn":"Alien+Species+and+Evolution+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cf2c58cb74135f1e8dd9c6284200cf5eeefdc96","infoHashBuffer":{"type":"Buffer","data":[44,242,197,140,183,65,53,241,232,221,156,98,132,32,12,245,238,239,220,150]},"announce":[],"urlList":[]}}