{"title":"Beyond the Fringe (1964) - Satirical Revue","uid":7401365,"size":1297617264,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2d003e731a9a2d065f993b1e6fea0960383d3291&amp;dn=Beyond+the+Fringe+%281964%29+-+Satirical+Revue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"guidoanselmi","files":-1,"time":1341083698,"description":"Conceived in the late 1950s, &quot;Beyond the Fringe&quot; brought together an Oxford medical student (Jonathan Miller), an Oxford history student (Alan Bennett), a musician (Dudley Moore) and a comedian (Peter Cook) who wrote and performed a satirical revue that, after a shaky tour of the provinces, took London by storm and in 1962 arrived in America for a two-year run on Broadway. All four creator/performers went on to major careers on stage and screen, most notably Moore, whose Hollywood films included &quot;Arthur&quot; and &quot;10.&quot; The quartet comedy - though high-brow - is now seens as a link between the zaniness of Britain's Goons and the cheeky, surreal comedy of the Beatles and Monty Python's Flying Circus. \n\nThis is the only known video of &quot;Fringe,&quot; taped during a gala final performance in London's West End in 1964. Miller had left the show in New York but was coaxed back for a final go. All copies of the tape, which was shown on British television and possibly as a special run in a few American movie theaters, were thought destroyed for many years until one turned up. \n\nVideo cameras 50 years ago were primitive and produced a black-and-white,low-resolution image by today's standards. And sadly, this is not the show at its best - I know because I saw &quot;Fringe&quot; in 1962 during a tryout run in DC. After hundreds of performances, the actors seem weary of the material and some either drop lines or ad-lib bits of dialogue. Still, it is the only preservation of an important show - and much of it remains very, very funny.","torrent":{"xt":"urn:btih:2d003e731a9a2d065f993b1e6fea0960383d3291","amp;dn":"Beyond+the+Fringe+%281964%29+-+Satirical+Revue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d003e731a9a2d065f993b1e6fea0960383d3291","infoHashBuffer":{"type":"Buffer","data":[45,0,62,115,26,154,45,6,95,153,59,30,111,234,9,96,56,61,50,145]},"announce":[],"urlList":[]}}