{"title":"Age of Wonders Portable - [Espera]","uid":6772658,"size":155357653,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2f80772433e0c4a52b1c0d8ca3a8b3373a3c0d5b&amp;dn=Age+of+Wonders+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1319629365,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Age Of Wonders 1 Click.exe&quot;\n3.Enjoy.\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nAge of Wonders is a turn-based strategy PC-game often likened to Master of Magic. Originally titled World of Wonders, the game incorporated several role-playing video game elements that were dropped when simultaneous turns were implemented. The game was co-developed by Triumph Studios and Epic Games, Dutch and American game developers respectively, and published by Gathering of Developers in 1999. This game is notable for its detailed description of mythical creatures.\n\nThe game had two sequels, Age of Wonders 2: The Wizard's Throne, and Age of Wonders: Shadow Magic.\n\nPlayers have an isometric view of the map, which consists of hexagonal tiles, and can have up to three layers (surface, caverns, and depths). Units are arranged into groups (also known as parties or stacks) of up to eight units; a single such group occupies one tile. Cities occupy between one and four tiles, and other structures generally occupy a single tile.\n\nEach player leads a certain race. There are 12 races available in the game, though not all of them may be present on every map, and of those which are, not all may be playable. List of races includes traditional fantasy Elves, Lizardmen, Humans, Goblins, Dark Elves, Undead, Orcs, Dwarves and Halflings, as well as several unique ones such as Frostlings, Azracs, and Highmen. Races, as well as units not belonging to any specific race, such as dragons and giants, have a certain alignment, which can be good, neutral, or evil. According to their alignment and certain other factors, cities and independent units of one race can be friendly or hostile towards another race. This can manifest itself in different ways; for example, an orc city is not likely to surrender to the elves, and if conquered, may revolt unless there is a strong military presence in it to oppress the population. Units of hostile races forced to fight alongside each other in a single group will have lower morale, and are more likely to desert. Race relations can be improved by acts of goodwill towards other races, such as upgrading their cities, or hampered by razing, looting, or migrating cities belonging to that race. Diplomacy can also affect this and even an alliance with one race might affect the relation of another race. There are also several spells which have a global effect on race relations.\n\nThere are two resources, gold and mana. Gold is used to build units, buy heroes, cities and spells (in Wizard Towers), upgrade cities. Mana is used to cast and research spells and use altars.\n\nSystem requirements\n\nIntel Pentium 166 CPU, \n32MB RAM, \n350MB hard disk, \n4x CD-ROM drive","torrent":{"xt":"urn:btih:2f80772433e0c4a52b1c0d8ca3a8b3373a3c0d5b","amp;dn":"Age+of+Wonders+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f80772433e0c4a52b1c0d8ca3a8b3373a3c0d5b","infoHashBuffer":{"type":"Buffer","data":[47,128,119,36,51,224,196,165,43,28,13,140,163,168,179,55,58,60,13,91]},"announce":[],"urlList":[]}}