{"title":"Ancient Aliens   (History Channel - Seasons 1 and 2)","uid":6775167,"size":14543749166,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:302a98042d2939b08ecc748c864f478a69b38843&amp;dn=Ancient+Aliens+++%28History+Channel+-+Seasons+1+and+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neil1966hardy","files":33,"time":1319715769,"description":"Ancient Aliens\n\n\n &lt;a href=&quot;\nhttp://www.history.com/shows/ancient-aliens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.history.com/shows/ancient-aliens&lt;/a&gt;\n\nSeason one (2010)\n\n101 (2) &quot;The Evidence&quot; April 20, 2010\nThis episode suggests that aliens made contact with primitive humans, and cites as evidence, Indian Sanskrit texts that are suggested to describe flying machines called Vimanas; Egyptian megaliths that are said to show precision cutting work thought to be too advanced for the time; and Jewish Zohar writings that are said to describe a &quot;manna machine&quot; similar to chlorella algae processing of today.\n\n102 (3) &quot;The Visitors&quot; April 27, 2010\nThe episode proposes that alien visitations have occurred around the globe, and cites as evidence, claims that the Dogon people were given galactic knowledge by a star god; the Hopi and Zuni celebrations of Kachinas (or &quot;gods from the sky&quot;) that are symbolized with headdress that are said to resemble modern space helmets; and that the Chinese Huangdi was a Han leader who came to Earth on a yellow dragon which is suggested to have been a metaphor for a spaceship.\n\n103 (4) &quot;The Mission&quot; May 4, 2010\nThis episode posits that extraterrestrials have a mission plan for Earth and mankind, and cites as evidence, Sumerian tablets that allegedly describe the Anunnaki as a race of creatures that came to Earth to mine gold; the purpose of cattle mutilations; the mile-long &quot;band of holes&quot; near Pisco, Peru; Egyptian hieroglyphs that are said to depict hybrid creatures that are part man/part animal; and crystal skulls and crop circles that are said to contain messages from aliens.\n104 (5) &quot;Closer Encounters&quot; May 18, 2010\nThis episode suggests that alien encounters have been documented in various historical texts, citing as evidence, the 13th century book Otia Imperialia which describes an incident in Bristol, England ascribed to UFOs; the log entries of Christopher Columbus that report lights in the sky; stories of cigar-shaped craft allegedly seen over Europe during the Black Plague; and Medieval art that supposedly depicts disc-shaped objects floating in the heavens.\n\n105 (6) &quot;The Return&quot; May 25, 2010\nThis episode proposes that aliens have contacted man as recently as the 20th century, citing examples such as the Battle of Los Angeles and the Roswell UFO incident. It also looks at the modern SETI project and speculates what would happen if aliens answered back; what protocols exist to determine who would speak on behalf of mankind, and how we would communicate.\n\n\n\nSeason two (2011)\n\n201 (7) &quot;Mysterious Places&quot; October 28, 2010\nThis episode examines locations around the Earth that are proposed &quot;hot spots&quot; of UFO activity; such as the Bermuda Triangle; Mexico's &quot;Zone of Silence&quot; an area of land said to naturally disrupt radio signals; the portal-like structure at Peru's Puerta de Hayu Marka; and the curious rock formations of the Marcahuasi Plateau.\n\n202 (8) &quot;Gods and Aliens&quot; November 4, 2010\nThis episode looks at legends about powerful gods and fearsome monsters that are said to have similarities between them even though these legends are found in different cultures separated by vast distances, and this episode also suggests that these legends may be eyewitness accounts of alien visitations. Also discussed are tales of gods interacting with humans, imparting wisdom and technology and impregnating women to create demigods who are supposedly the offspring of human/alien unions.\n\n203 (9) &quot;Underwater Worlds&quot; November 11, 2010\nThis episode suggests that various underwater structures and ruins said to have been found around the globe may have been used by extraterrestrials; such as the temple ruins found under Lake Titicaca in Peru; the geometric structures of Yonaguni off the coast of Japan, and ancient Indian texts that allegedly describe other sunken cities yet to be discovered.\n\n204 (10) &quot;Underground Aliens&quot; November 18, 2010\nThis episode hypothesizes that various underground places may have been extraterrestrial lairs; such as a lost cave in Ecuador said to hold metal tablets containing alien knowledge; the underground city of Derinkuyu in Turkey; Native American legends of &quot;inner-earth&quot; beings; and rumors of a secret U.S. Military-base supposedly built alongside aliens inside the Archuleta Mesa near Dulce, New Mexico.\n\n205 (11) &quot;Aliens and the Third Reich&quot; November 25, 2010\nThis episode speculates that Nazi Germany had experimented with advanced alien technology and built flying machines; such as the Haunebu and the Die Glocke (The Bell); and rumors that some of this technology may have made its way to the United States and helped jump start the Apollo program.\n\n206 (12) &quot;Alien Tech&quot; December 2, 2010\nThis episode proposes that some advanced weapon technologies currently in development, such as laser and sonic weapons, are rediscovered technologies used by advanced beings in the past. Also discussed are theories that aliens provided gravity manipulation devices to help man construct colossal stone structures around the world.\n\n207 (13) &quot;Angels and Aliens&quot; December 9, 2010\nThis episode looks at various stories of angelic visitations that to some ancient astronaut theorists read more like alien encounters than divine appearances, and suggests they are not supernatural beings, but visitors from distant planets.\n\n208 (14) &quot;Unexplained Structures&quot; December 16, 2010\nThis episode suggests that various sites around the world; such as GÃƒÂ¶bekli Tepe in Turkey; the Incan ruins of SacsayhuamÃƒÂ¡n in Peru; the Carnac stones of France; and Zorats Karer in Armenia, show construction techniques and mathematical concepts that were not believed to have been known at the time, and that this knowledge was gained from alien visitors.\n\n209 (15) &quot;Alien Devastations&quot; December 23, 2010\nThis episode surmises that aliens may have caused various disasters, as depicted in the Bible and other texts, or even tried to warn man of them; such as Noah of the Great Flood. Also proposed is that some disasters ushered changes in human evolution and that our leaps in technology over the centuries were achieved with alien help.\n\n210 (16) &quot;Alien Contacts&quot; December 30, 2010\nThis episode proposes that extraterrestrials may have contacted various humans throughout history, such as Moses and Joan of Arc, to help guide and inspire them to achieve great things; or to pass on important messages for humanity; such as a supposed binary message given to a UFO-contactee during the 1980 Rendlesham Forest incident who believes it is the coordinates to a mythical island called Hy-Brazil.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:302a98042d2939b08ecc748c864f478a69b38843","amp;dn":"Ancient+Aliens+++%28History+Channel+-+Seasons+1+and+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"302a98042d2939b08ecc748c864f478a69b38843","infoHashBuffer":{"type":"Buffer","data":[48,42,152,4,45,41,57,176,142,204,116,140,134,79,71,138,105,179,136,67]},"announce":[],"urlList":[]}}