{"title":"SPIDERMAN: EDGE OF TIME - STRANGE - XBOX360 - REGION FREE {BOOBS","uid":6710399,"size":6777790820,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:38d20b620270dc29b5d002fb3d2b392a90345ce9&amp;dn=SPIDERMAN%3A+EDGE+OF+TIME+-+STRANGE+-+XBOX360+-+REGION+FREE+%7BBOOBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"boobsman","files":71,"time":1317331607,"description":"LT1.9 REQUIRED!!!\nDO NOT PLAY THIS GAME UNLESS YOU HAVE UPDATED TO THE LATEST FIRMWARE!!!\nIF YOU ARE ASKED TO UPDATE AND YOUR NOT RUNNING LT1.9 STOP THE GAME!!!\n\nIn Spider-Man: Edge Of Time, Spider-Man faces one of his greatest challenges ever - saving Spider-Man. Developed by Activision-owned studio Beenox, Spider-Man: Edge Of Time challenges the player to take on the roles of both classic Amazing Spider-Man and Spider-Man 2099 to correct a time stream gone awry and prevent a catastrophic future brought on by the early and untimely death of Peter Parker.\n\nSpider-Man: Edge Of Time is a focused, action-packed adventure set in two connected and evolving timelines, from the contemporary times of the Amazing Spider-Man to the corrupted future world of Spider-Man 2099, against the backdrop of a rich, tightly crafted narrative by acclaimed Marvel veteran Peter David (co-creator of the comic book series Spider-Man 2099). The game features all-new &quot;cause-and-effect&quot; gameplay, where players will see how the immediate and sometimes unexpected effects of their actions as one Spider-Man changes the timeline of the other Spider-Man.\n","torrent":{"xt":"urn:btih:38d20b620270dc29b5d002fb3d2b392a90345ce9","amp;dn":"SPIDERMAN%3A+EDGE+OF+TIME+-+STRANGE+-+XBOX360+-+REGION+FREE+%7BBOOBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38d20b620270dc29b5d002fb3d2b392a90345ce9","infoHashBuffer":{"type":"Buffer","data":[56,210,11,98,2,112,220,41,181,208,2,251,61,43,57,42,144,52,92,233]},"announce":[],"urlList":[]}}