{"title":"20111028-The Five.Fox News Channel.CF.avi","uid":6782646,"size":319681398,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3992c52b46568da66938b1dd57ef23a6d6727e89&amp;dn=20111028-The+Five.Fox+News+Channel.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1319969563,"description":"----------\nThe Five\n\n2011, October 28, Friday\nFox News Channel \n\nXvid/MP3 AVI - transcoded from medium-quality ReplayTV stream\n----------\n\nThe Five tonight:\n\nKimberly Guilfoyle\nBob Beckel\nEric Bolling\nDana Perino\n&amp; Greg Gutfeld\n\n[uploader news:\n\nI'm getting busier lately, hampering the listing effort. I expect this problem to intensify soon as well, and I'm not sure what will happen. For now, you can expect that if I actually watch a show, a listing will soon be forthcoming. If I don't watch, there may not be one. STOSSEL will have priority over everything if I get really pressed.\n\nMy system is not always up. To help maintain availability for newer listings, try to seed as close to 1:1 as you are able. We probably don't need heroes doing 10-20x or more, but if you're the sort that leeches and bails on the swarm with little return flow, do you have a sensible reason? You gotta do what'cha gotta do, I find no fault, this is all volunteer. But if it's not gonna hurt ya to stick around awhile, please do. Healthier swarms mean more consistent and faster availability.\n\nLastly, with exception of some of the STOSSEL shows, the content is very time-dependent and does not age well (it's current events op-ed, after all). I list STOSSEL forever, the swarm is robust for the episodes with more time-independent content. For the others, I intended to list new episodes for three weeks only, but in recent months TPBs delete feature has been non-functional, and my account has become quite clogged up with stale listings.\n\nIf the swarm has died on non-STOSSEL listings older than three weeks, I suggest you move along to newer listings. Most STOSSEL listings can get a re-seed for a dead swarm by posting a comment on the most recent show's listing. I will (eventually) see this and retrieve an offline archive for re-seed, unless a past swarm participant doesn't help you out first.\n\nThanks, and have a great Halloween!]","torrent":{"xt":"urn:btih:3992c52b46568da66938b1dd57ef23a6d6727e89","amp;dn":"20111028-The+Five.Fox+News+Channel.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3992c52b46568da66938b1dd57ef23a6d6727e89","infoHashBuffer":{"type":"Buffer","data":[57,146,197,43,70,86,141,166,105,56,177,221,87,239,35,166,214,114,126,137]},"announce":[],"urlList":[]}}