{"title":"Whitney.S01E05.HDTV.XviD-LOL[ettv]","uid":6778543,"size":191019390,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3aab07f863c1bc8a262f543dad1d10a55a8a76e3&amp;dn=Whitney.S01E05.HDTV.XviD-LOL%5Bettv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":5,"time":1319811450,"description":"Season: 1  Episode: 5\nReleased: 27th Oct 2011\nFilesize: 174.99 MB\n\nWhitney is a look at modern day love which centers around Whitney (Whitney Cummings, Chelsea Lately) and Alex (Chris D'Elia, Glory Daze), a happily unmarried couple. Together for three years, the duo is in no rush to get hitched, which seems to get a mixed response from their friends.\n\nWhitney's close circle of girlfriends includes, on one side, Lily, a romantic idealist who loves being in love, and on the other, Roxanne, a recent divorcee who is practical, cynical and dreading being single again. Lily and Roxanne's opposing points of view only exacerbate Whitney's own complicated outlook on relationships.\n\nCompleting their close-knit group is Neal, a real modern day Renaissance man - sensitive and cool, who knows a little bit about everything and happens to be dating Lily. On the other end of the spectrum is Whitney and Alex's next-door neighbor Mark, a police officer and total bachelor, who claims to be the ultimate player, but likes to talk a good game.\n\nAt the end of the day, Whitney and Alex try to have a relationship on their own terms - in a world that expects a more traditional approach.","torrent":{"xt":"urn:btih:3aab07f863c1bc8a262f543dad1d10a55a8a76e3","amp;dn":"Whitney.S01E05.HDTV.XviD-LOL%5Bettv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aab07f863c1bc8a262f543dad1d10a55a8a76e3","infoHashBuffer":{"type":"Buffer","data":[58,171,7,248,99,193,188,138,38,47,84,61,173,29,16,165,90,138,118,227]},"announce":[],"urlList":[]}}