{"title":"Something Borrowed (2011) [DVDR9][PAL][Eng-Spa-Cat]","uid":6764169,"size":8198426624,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3ab40c1971d86301db8cff13713db9828d070ab2&amp;dn=Something+Borrowed+%282011%29+%5BDVDR9%5D%5BPAL%5D%5BEng-Spa-Cat%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":1,"time":1319307925,"description":"Algo prestado (2011) [DVDR9][PAL][Eng-Spa-Cat]\n &lt;a href=&quot;\nhttp://somethingborrowedmovie.warnerbros.com/dvd/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://somethingborrowedmovie.warnerbros.com/dvd/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.algoprestado.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.algoprestado.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0491152/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0491152/&lt;/a&gt;\n\n--------\nEnglish:\n--------\nQuality: DVDFULL9\nAudio: English Dolby Digital 5.1, Dolby Digital 5.1 Castilian, Catalan Dolby Digital 5.1\nSubtitles: English, Castilian, Catalan\nExtras: Yes\nRental Version\n\n\nTitle: Something Borrowed\nOriginal title: Something Borrowed\nCountry: USA\nUSA release: 06/05/2011\nReleased in Spain: 17/06/2011\nReleased on DVD (rental): 19/10/2011\nStudio: 2S Films, Wild Ocean Films, Alcon Entertainment\nDirector: Luke Greenfield\nWritten by: Jennie Snyder Urman\nStarring: Kate Hudson, Ginnifer Goodwin, John Krasinski, Colin Egglesfield, Steve Howey, Ashley Williams, Sarah Baldwin, Grace Capra, Shirley Dluginski, Jill Eikenberry, Brandon Hunter, Anya Jordanova Bergstedt, Peyton List, Brian McCormack, Mary O'Rourke\nRating: Suitable for all audiences\n\n\nSynopsis:\nRachel (Ginnifer Goodwin) is a talented lawyer at a major law firm in New York, a loyal friend and generous, but, unfortunately, still single ... and never misses an opportunity to remind her best friend Darcy (Kate Hudson), as promised. However, after the party at the conclusion that 30 years old, Rachel, the eternal good girl, just unexpectedly into the arms of boy who has been suspended since it was only a law student, Dex (Colin Egglesfield) ... which happens to be Darcy's fiance.\n\nIn the frantic weeks before the wedding of Darcy, one thing is leading to another and Rachel is in an impossible situation, caught between its treasured friendship with Darcy and the love of his life.\n\nAt the same time Ethan (John Krasinski), confidant and conscience occasional usual Rachel is busy trying to avoid the affection of Darcy's friend, the hopelessly in love with Claire (Ashley Williams), while he is in turn secretly in love with another , and Steve Howey as the charming and irrepressible Marcus, whose intentions towards Rachel need not exclude any other woman who can get his attention.\n\nProduction notes:\n- Based on the novel by Emily Giffin Castilian whose title is 'Can I borrow it?'\n\n--------\nEspaÃƒÂ±ol:\n--------\nCalidad: DVDFULL9\nAudio: Ingles Dolby Digital 5.1, Castellano Dolby Digital 5.1, Catalan Dolby Digital 5.1\nSubtÃƒÂ­tulos: Ingles, Castellano, Catalan\nExtras: Si\nVersion Alquiler\n\n\nTÃƒÂ­tulo: Algo prestado\nTÃƒÂ­tulo original: Something Borrowed\nPaÃƒÂ­s: USA \nEstreno en USA: 06/05/2011 \nEstreno en EspaÃƒÂ±a: 17/06/2011 \nLanzamiento en DVD (alquiler): 19/10/2011 \nProductora: 2S Films, Wild Ocean Films, Alcon Entertainment \nDirector: Luke Greenfield \nGuiÃƒÂ³n: Jennie Snyder Urman \nReparto: Kate Hudson, Ginnifer Goodwin, John Krasinski, Colin Egglesfield, Steve Howey, Ashley Williams, Sarah Baldwin, Grace Capra, Shirley Dluginski, Jill Eikenberry, Brandon Hunter, Anya Bergstedt Jordanova, Peyton List, Brian McCormack, Mary O'Rourke\nCalificaciÃƒÂ³n: Apta para todos los pÃƒÂºblicos\n\n\nSinopsis:\nRachel (Ginnifer Goodwin) es una abogada de talento en un importante bufete de abogados de Nueva York, una amiga fiel y generosa, aunque, por desgracia, continÃƒÂºa soltera... como no pierde ocasiÃƒÂ³n de recordarle su mejor amiga Darcy (Kate Hudson), ya prometida. Sin embargo, tras la fiesta en la que se celebra que cumple 30 aÃƒÂ±os, Rachel, la eterna chica buena, acaba inesperadamente en brazos del chico del que ha estado colgada desde que no era mÃƒÂ¡s que una estudiante de Derecho, Dex (Colin Egglesfield)... que resulta ser el prometido de Darcy. \n\nEn las frenÃƒÂ©ticas semanas que preceden a la boda de Darcy, una cosa va llevando a la otra y Rachel se encuentra en una situaciÃƒÂ³n imposible, atrapada entre su preciada amistad con Darcy y el amor de su vida. \n\nA su vez Ethan (John Krasinski), confidente habitual y conciencia ocasional de Rachel, estÃƒÂ¡ ocupado tratando de eludir los afectos de la amiga de Darcy, la perdidamente enamorada Claire (Ashley Williams), mientras que ÃƒÂ©l estÃƒÂ¡ a su vez secretamente enamorado de otra, y con Steve Howey como el encantador e irrefrenable Marcus, cuyas intenciones para con Rachel no excluyen necesariamente a cualquier otra mujer que pueda llamarle la atenciÃƒÂ³n. \n\nNotas de ProducciÃƒÂ³n:\n- Basada en la novela de Emily Giffin cuyo tÃƒÂ­tulo castellano es 'Ã‚Â¿Me lo prestas?'\n\n","torrent":{"xt":"urn:btih:3ab40c1971d86301db8cff13713db9828d070ab2","amp;dn":"Something+Borrowed+%282011%29+%5BDVDR9%5D%5BPAL%5D%5BEng-Spa-Cat%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ab40c1971d86301db8cff13713db9828d070ab2","infoHashBuffer":{"type":"Buffer","data":[58,180,12,25,113,216,99,1,219,140,255,19,113,61,185,130,141,7,10,178]},"announce":[],"urlList":[]}}