{"title":"Cyber Update Nov.2011-------HT-15175 Cherry Torn, Rain DeGrey ","uid":6855221,"size":718638957,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3bb9f8965d84b3b3f03b27d342b243d3247a7bb0&amp;dn=Cyber+Update+Nov.2011-------HT-15175+Cherry+Torn%2C+Rain+DeGrey+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":119,"time":1322673691,"description":"From Kink.com  (Hogtied)  + Pics\n\nCyber Update Nov.2011\\HT-15175 Cherry Torn, Rain DeGrey and Iona Grace\n\n\nWelcome to another installment of the Hogtied feature movie series. This month's installment is the conclusion of&quot;The Dig&quot;. A fantasy horror abduction feature in co-production with Intersec studios, shot on location in the Catskill Mountains of New York. Starring Cherry Torn, Rain DeGrey, Iona Grace, with special co-handler PD.\n\nNoted anthropologist Helen Jackson, a professor from U.C. Berkeley, and her intern travel to the Catskill Mountains of New York State. Recent finds of a rumored ancient native culture was all it took to for the University to send their best to investigate. The Legends tell of a native people who worshipped the Raven as their God. Tribal Shamans ruled the people with fear, magic and domination over all the females of the tribe. A find like this would be historic for the University's Social Sciences department.\n\nAfter uncovering some very strange artifacts, including large avian bones, Dr. Jackson is positive she has found a lost native culture. A local guide arrives to take her team deeper into the foreboding wilderness of the Catskill Mountains to what is believed to be the actual burial site used by the tribal shamans.\n\nAt the cliffs and caves of the burial site, it doesn't take long before a nightmare of biblical proportions is unleashed on the team from Berkeley. The tribal shamans spirits still guard this sacred site, awaiting the return of their tribe. When the three beautiful women stumble upon and desecrate their most holy of ground they must be punished.\n\nDo not miss this latest installment of the Hogtied featured movie series. Shot in the beautiful Catskill Mountains of New York, this film is a tribute to the lost art of outdoor bondage and cinematography A film where the bondage and situations are the stars of the film. Where the intensity of the bondage should not be ignored. We hope you enjoy our latest effort.\n\nBONUS FEATURE ADDITIONS INCLUDES: \nBehind the scenes footage, interviews and outtakes. \n\n\n\nScreens &lt;a href=&quot; http://www.hogtied.com/site/shoot.jsp?shootId=15175&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hogtied.com/site/shoot.jsp?shootId=15175&lt;/a&gt;\n\n\nCheerz  :-)\n\n\nWhat about some feedback from some more downloaders if you want more in the future......................","torrent":{"xt":"urn:btih:3bb9f8965d84b3b3f03b27d342b243d3247a7bb0","amp;dn":"Cyber+Update+Nov.2011-------HT-15175+Cherry+Torn%2C+Rain+DeGrey+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bb9f8965d84b3b3f03b27d342b243d3247a7bb0","infoHashBuffer":{"type":"Buffer","data":[59,185,248,150,93,132,179,179,240,59,39,211,66,178,67,211,36,122,123,176]},"announce":[],"urlList":[]}}