{"title":"Age of Wonders II Portable - [Espera]","uid":6774888,"size":422881114,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3c1ad4a023bb752cb67723711ca5ca9fb554baab&amp;dn=Age+of+Wonders+II+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1319710732,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Age Of Wonders II 1 Click&quot;\n3.Enjoy.\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nAge of Wonders II: The Wizard's Throne is a turn-based, strategy PC-game in a fantasy setting. The first sequel to Age of Wonders, it was developed by Triumph Studios, a Dutch game developer.\n\nDifferences from Age of Wonders\n\nUnlike in Age of Wonders, where the player has the option of removing their leader from the map, players in Age of Wonders 2 take the role of an immortal spell-casting Wizard, who cannot be upgraded, but in certain circumstances can survive being killed.\nMagic system\n\nIn Age of Wonders, magic is used via the spell casting abilities of leaders and heroes, and global spells can be cast some distance away from the hero; use of spells in combat is restricted to battles where a hero with spell casting is present.\n\nMagic use in Age of Wonders 2 uses a &quot;domain&quot; system; spells can only be cast within the domain of the casting wizard, or the domain of an allied wizard. Magic domains can overlap with each other, and in the simple case, are centered on the Wizard. When a Wizard is present in a Wizard's Tower, the radius of the domain increases significantly, and in addition is radiated by other Wizard's Towers, Magic Relays and Heroes under the control of the player. Global spells can only be cast by the Wizard, via a spell book located in the main user interface; spells can be cast in combat by either Heroes involved in the battle, or (provided the battle takes place inside their domain) the Wizard who controls any party which entered the battle.\n\nEach sphere is mastered by two wizards (except Cosmos), only three wizards do not have a seat in the Circle of Evermore: Julia, Queen of the Elven Court; Meandor, her brother; and Merlin, a Human King.\nA war party preparing to attack a city defended by Nimue.\n\nThe other wizards are:\n\n    Water: The Jolly Merchant Marinus and The Mysterious Nimue\n    Fire: The Arrogant Yaka and The Seductive Karissa\n    Earth: The Grumpy Fangir and The Solitary Mab\n    Air: Tempest, Lord of the Skies and Artica, the Ice Queen\n    Life: The Wise Anon and The Ancient Serena\n    Death: The Twisted Nekron and Arachna, the Spider Queen\n    Cosmos: Aged Gabriel\n\nFan reaction and involvement\n\nImproved audio quality and graphics, sub-quests from various gods, more races and build options as well as two large single-player campaigns made most of the large fanbase of Age of Wonders happy migrating to Age of Wonders 2: The Wizard's Throne; this was aided by the involvement of members of the HeavenGames community in suggestions, testing and development of the game.\n\nProbably planned as an expansion pack, Age of Wonders: Shadow Magic was published later as a stand-alone game.\n\nSystem requirements\n\nPentium II 300 CPU, 64MB RAM, 500MB hard disk, 4MB DirectX compatible graphic card, 8x CD-ROM drive","torrent":{"xt":"urn:btih:3c1ad4a023bb752cb67723711ca5ca9fb554baab","amp;dn":"Age+of+Wonders+II+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c1ad4a023bb752cb67723711ca5ca9fb554baab","infoHashBuffer":{"type":"Buffer","data":[60,26,212,160,35,187,117,44,182,119,35,113,28,165,202,159,181,84,186,171]},"announce":[],"urlList":[]}}