{"title":"Fifty dead men walking","uid":6837789,"size":735278206,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3c51c2f90d511a5d7fcead075ea8a96957af5bb0&amp;dn=Fifty+dead+men+walking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TUXtorrent","files":1,"time":1322065375,"description":"Fifty Dead Men Walking is a 2008 \n\nEnglish-language crime thriller film written and directed by Kari Skogland. It is a loose adaptation of Martin McGartland's 1997 autobiography of the same name. It premiered in September 2008, and stars Jim Sturgess as Martin McGartland, an informant within the Provisional Irish Republican Army (IRA), and Ben Kingsley as Fergus, his British handler.\n \nThe film is set from 1987 until 1991, the time in which McGartland acted as an undercover informant within the IRA during The Troubles. In 1991 his cover was blown and he was kidnapped by the IRA, although he later escaped and went into hiding.\n \nAt the time of the release of the film McGartland was still in hiding. The film takes its name from McGartland's claim within his book to have saved the lives of fifty people during his time as an informant.[1]\n \nMartin McGartland disowned the film as was reported in the Sunday Times on March 29, 2009. Martin told the Sunday Times that &quot;they are saying it was based on a true story, but what is the definition of 'based on a true story'? Is it 50% true, 70% true, 10%?&quot; The Sunday Times further reported that McGartland contended &quot;that the movie is fundamentally a lie that misrepresents his career and his motivation. He believes that if Kari Skogland, the director, had stuck closer to the account he gave in his book and in a BBC documentary, then she would have had a better film.&quot;[2]\n","torrent":{"xt":"urn:btih:3c51c2f90d511a5d7fcead075ea8a96957af5bb0","amp;dn":"Fifty+dead+men+walking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c51c2f90d511a5d7fcead075ea8a96957af5bb0","infoHashBuffer":{"type":"Buffer","data":[60,81,194,249,13,81,26,93,127,206,173,7,94,168,169,105,87,175,91,176]},"announce":[],"urlList":[]}}