{"title":"Anno.2070-RELOADED","uid":6845354,"size":5288831196,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3cdccdd3fcac998c0bddb9f8f63921ed2ed24604&amp;dn=Anno.2070-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SnowCrash03","files":-1,"time":1322326562,"description":"Anno 2070 (c) Ubisoft\n\n\n11/2011 :..... RELEASE.DATE .. PROTECTION .......: SS2/Crap\n 1 :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\n \n2070. Our world has changed. The rising level of the ocean has harmed the\n coastal cities and climate change has made large stretches of land\n inhospitable\n\n \nThe latest in the award-winning strategy series, Anno 2070 offers a new\n world full of challenges, where you will need to master resources,\n diplomacy, and trade in the most comprehensive economic management system in\n the Anno series\n\n \nBuild your society of the future, colonize islands, and create sprawling\n megacities with multitudes of buildings, vehicles, and resources to manage\n Engineer new production chains such as Robot Factories, Oil Refineries and\n Diamond Mines and trade with a variety of goods and commodities\n\n\nA new era\n While adhering to the fundamentals that made the Anno franchise a success,\n the near-future setting will bring numerous new gameplay mechanics,\n architectural breakthroughs, and all new challenges. Additionally, players\n will be able to build massive cities, the scope of which has never been\n seen in prior Anno games\n Become an architect of the future\n Face the current world challenges to shape the world of tomorrow. You can\n either join the Tycoons to pursue an industrial and efficient course, or\n side with the Ecos to create a more sustainable and environmentally\n friendly direction\n An evolving, dynamic world\n Decisions will have an impact on the environment, the architectural look\n of the world, and the needs of populations\n Discover hidden depths and new resources\n The mysteries of the sea and the sky are waiting to be discovered. Take\n advantage of the transport systems of the future and develop a powerful\n economy\n The enhanced Anno with new features to master\n Smuggle wares between harbors without being detected by the coastal\n patrols or forge alliances with powerful figures to expand your influence\n\n\n\n\n1. Unrar\n 2. Burn or mount the image\n 3. Install the game.\n 4. Copy over the cracked content from the /Crack dir on the disc to your\n install dir. Then either run install.bat or copy the &quot;Profile&quot; dir to\n &quot;%USERPROFILE%Application DataUbisoftANNO 2070&quot; yourself\n 5. Block the game exes in your system firewall\n 6. Play the game. When prompted, use &quot;RELOADED&quot; as login and &quot;1&quot; as password\n to play the game offline\n\n\nPS: &quot;Return to C.O.R.E.&quot; included\n ","torrent":{"xt":"urn:btih:3cdccdd3fcac998c0bddb9f8f63921ed2ed24604","amp;dn":"Anno.2070-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cdccdd3fcac998c0bddb9f8f63921ed2ed24604","infoHashBuffer":{"type":"Buffer","data":[60,220,205,211,252,172,153,140,11,221,185,248,246,57,33,237,46,210,70,4]},"announce":[],"urlList":[]}}