{"title":"Democracy Now - 04 oct 2011","uid":6719703,"size":453919752,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3d1569f29cc46e42c980a0d14b6abf99a6cac86f&amp;dn=Democracy+Now+-+04+oct+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1317747981,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 04, 2011\n\n- Truck Bombing Kills at Least 70 in Somali Capital\n- Major Unions Throw Support Behind Occupy Wall Street Protest\n- Occupy Wall Street-Inspired Protests Spring Up Around the Country, World\n- Obama: Nation Is Not Better Off Than It Was Four Years Ago\n- Report: Fannie Mae Aware of Dubious Foreclosure Practices as Early as 2003\n- Emails Reveal Cozy Relationship Between Lobbyist, State Department\n- Obama Administration Backs Increased Arctic Ocean Oil Drilling\n- Alabama: Latino Students Disappear Due to New Far-Reaching Immigration Law\n- U.S. Lawmakers Confirm Blocking $200 Million in Aid to Palestine, Amid U.N. Statehood Bid\n- Report: Syrian Protesters Abroad Systematically Monitored, Harassed on Behalf of Regime\n- Civil Rights Attorneys Request NYPD Turn Over Records on Secret Muslim Monitoring Program\n- Mexican Officials Take Issue With Perry Suggestion to Send U.S. Troops Over Border\n- Obama Pushes Forward on Trade Agreements With South Korea, Colombia, Panama\n\n\nSpecial reports\n\n- A War of Voting: Could Redistricting and Voting Law Changes Help Republicans Win in 2012?\n\n A new report by the Brennan Center for Justice warns changes to voting laws could strip the voting rights of more than 5 million people - a higher number than the margin of victory in two of the last three presidential elections. Its findings reveal some 3.2 million people in Kansas, South Carolina, Tennessee, Texas and Wisconsin do not have the state identification they will now need to vote. Others will be kept from the voting booth by tougher restrictions for convicted prisoners and laws requiring proof of U.S. citizenship. In 2012, states that have cracked down on voting rights will account for 63 percent of the 270 Electoral College votes needed for a presidential victory. We speak with Ari Berman, author of the new article in Rolling Stone magazine, &quot;The GOP War on Voting,&quot; and with ProPublica reporter Lois Beckett, who co-wrote, &quot;The Hidden Hands in Redistricting: Corporations and Other Powerful Interests,&quot; about how money is helping re-shape Congressional districts along partisan lines, a practice known as gerrymandering.\n\n\n- Press Freedom Victory: Democracy Now! Wins Settlement Over Unlawful Arrests at 2008 GOP Convention\n\nOn Monday, we reported a final settlement has been reached in a lawsuit filed by Democracy Now! Host Amy Goodman, along with producers Sharif Abdel Kouddous and Nicole Salazar, challenging the police crackdown on journalists at the 2008 Republican National Convention in St. Paul, Minnesota. We play excerpts of a news conference of our announcement, held yesterday in Zuccotti Park in Lower Manhattan, where hundreds are camped out with the Occupy Wall Street protest. We were joined by our attorneys to announce the settlement, Steven Reiss of Weil, Gotshal &amp; Manges, and Anjana Samant of the Center for Constitutional Rights. &quot;There is a reason why freedom of the press is in the First Amendment. Because without freedom of the press, there is no democracy,&quot; Reiss says. &quot;That is a lesson that applies not just abroad. We have seen many times in recent months abroad, it applies here as well.&quot;\n\n\n- 7 Months After Revolution Ousted Mubarak, Egyptian Military Maintains Control, Suppressing Dissent\n\nOver the weekend, Egyptian political parties dropped a threat to boycott upcoming parliamentary elections, the first multi-candidate vote since the ouster longtime president, Hosni Mubarak. The parties agreed to take part in the vote after Egypt's ruling military council vowed to amend a voting law that would have made it easier for former Mubarak allies to return to government. But the military council's shift fell short of ongoing demands by opposition activists for an end to the military trials of civilians and the lifting of 30-year-old emergency laws. Meanwhile, freedom of the press in Egypt is becoming increasingly limited and a massive strike is underway by teachers and other government workers. Democracy Now! correspondent Sharif Abdel Kouddous has been reporting in Egypt since January, and he joins us in our New York studio just before he returns to Cairo.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:3d1569f29cc46e42c980a0d14b6abf99a6cac86f","amp;dn":"Democracy+Now+-+04+oct+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d1569f29cc46e42c980a0d14b6abf99a6cac86f","infoHashBuffer":{"type":"Buffer","data":[61,21,105,242,156,196,110,66,201,128,160,209,75,106,191,153,166,202,200,111]},"announce":[],"urlList":[]}}