{"title":"-XBT- Skyrim Crash Compatibility Suite","uid":7405429,"size":120027186,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3ed192ae1928382173b80584ca5ce48b4fce5696&amp;dn=-XBT-+Skyrim+Crash+Compatibility+Suite%0D%0A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"-xbt-","files":-1,"time":1341187242,"description":"If you are experiencing crashes with the newest version of Skyrim, then this is for you.\n\nBethesda released a lot of unstable changes in the 1.6 version that may cause your game to crash on certain computers.\nMoreover, if you update to the 1.6 version then all your saves which you are using the 1.6 version won't be compatible with older versions if you ever try to downgrade.\n\n==================================================\n\nCOMPATIBILITY INSTALLATION:\n\nIf you are experiencing game crashes, then these are my RECOMMENDED instructions:\n\nSTEP A) Reinstall Windows.\nYes it may be a pain in the butt, but it is the only way to guarantee you aren't working with any corrupted files.\n\nIf you lost your install DVD, then make sure you download a trusted torrent of Windows 7 Ultimate x64, and you can find a Windows 7 crack in torrent also.\n\nSTEP 0) Reinstall Skyrim using the RZR 1911 .iso version of Skyrim, available many places via torrent.\nYou probably need PowerIso (you'll need a serial number), and you can get that from torrents.\n\nOtherwise you can just burn it to a DVD to install via your DVD player. Use IMGBURN to burn the .iso image to DVD. You can get IMGBURN free from their site because it is freeware.\n\n---\n\nSTEP 1) After you reinstalled Skyrim, copy the CRACK to the install directory \n(C:Program Files (x86)The Elder Scrolls V Skyrim unless you changed the install directory during install)\n\nSTEP 2) Then copy over all the files from &quot;Update 5&quot; folder to the install directory (same place as above)\n\nSTEP 3) Then copy over all the files from &quot;SKSE&quot; folder to the install directory (same place as above)\n\nSTEP 4) Then copy over all the files from &quot;ScriptDragon&quot; folder to the install directory (same place as above)\n\nSTEP 5) Then copy the Compatible Mods Versions to the mods directory (C:GamesSkyrimMods).\nActivate them using the Mod Manager.\n\n---\n\nOPTIONAL 6) Then, only if you want, copy over all the files from Skyboost folder to the install directory (same place as above)\n\nOPTIONAL 7) Then copy over any plugins you want from &quot;ScriptDragon Plugins&quot; folder to the install directory (same place as above). YOU HAVE TO UNZIP THEM FIRST.\n\n==================================================\n\nClick on my name to get the rest of my torrents.\n\n   &lt;a href=&quot;\nhttp://thepiratebay.se/user/-xbt-&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/-xbt-&lt;/a&gt;\n\n\n-XBT-","torrent":{"xt":"urn:btih:3ed192ae1928382173b80584ca5ce48b4fce5696","amp;dn":"-XBT-+Skyrim+Crash+Compatibility+Suite%0D%0A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ed192ae1928382173b80584ca5ce48b4fce5696","infoHashBuffer":{"type":"Buffer","data":[62,209,146,174,25,40,56,33,115,184,5,132,202,92,228,139,79,206,86,150]},"announce":[],"urlList":[]}}