{"title":"The Role of Meat in the Human Diet (John McDougall)(2004)","uid":6690219,"size":688238456,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3f827ae1528391eed9f1c4482e2abe2bcdf36427&amp;dn=The+Role+of+Meat+in+the+Human+Diet+%28John+McDougall%29%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"red_gonzo","files":1,"time":1316548931,"description":"This is dr. John McDougall's amazing video lecture The Role of Meat in the Human Diet (2004) where he clearly demonstrates that the human body was never intended to process much meat  at all as our ingestive organs are specialized for processing plant food that is rich in carbohydrates. Drawing on the latest evidence about nutrition, metabolism and hunger, McDougall places emphasis on a low-fat, high-carbohydrate diet while explaining how weight is lost and gained. According to McDougall, constipation, hemorrhoids, ulcers, IBS, and colitis are a few of the chronic digestive disorders that can be prevented and cured by eating a low-fat, cholesterol-free, plant-based diet. Through an all-vegan approach this medical maverick challenges medical and pharmaceutical businesses when they prioritize profits over patients. For the past 30 years he has countered mainstream misinformation with the fad-free truth and nutrition and your health. Find out what exactly is happening as you digest animal food, how it influences your health and how important is to switch to plant-based diet to improve your life. 1h long. A must see for everyone.\n\nVideo specs:\nVideo codec: divx, 1500 kbps, 704x480, 30 fps \nAudio codec: mp3, 128 kbps, 48 kHz, stereo\n","torrent":{"xt":"urn:btih:3f827ae1528391eed9f1c4482e2abe2bcdf36427","amp;dn":"The+Role+of+Meat+in+the+Human+Diet+%28John+McDougall%29%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f827ae1528391eed9f1c4482e2abe2bcdf36427","infoHashBuffer":{"type":"Buffer","data":[63,130,122,225,82,131,145,238,217,241,196,72,46,42,190,43,205,243,100,39]},"announce":[],"urlList":[]}}