{"title":"Vietnam Australian TV  Disc 02  h264 MKV","uid":6749233,"size":2553707569,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:410fbb5b80d59144c4bee456af2f4b8a3f4a957b&amp;dn=Vietnam+Australian+TV++Disc+02++h264+MKV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Doublezed","files":-1,"time":1318825582,"description":"Plot\n\nSet in the 1960s to 1970's about Australia's involvement in the Vietnam war. On the homefront it mainly focusses on the Goddard family - Douglas (Barry Otto), Evelyn (Veronica Lang) and their children Phil (Nicholas Eadie) and Megan (Nicole Kidman.\n\nVietnam is a stunningly powerful re-enactment of the bitterly controversial issue of Australia's involvement in what was perceived as an American War.\n\nTwelve Thousand young Australians were conscripted to Vietnam. Five Hundred never returned. On television, terrible images of war were impossible to ignore - in the beginning, few voices protested, but as the war worsened and casualties increased things began to change.\n\nThe arrival of conscription into the lives of ordinary Australians changed families lives forever. VIETNAM tells the story of one such family.\n\nCast\nÃ‚Â·\tNicole Kidman as Megan Goddard\nÃ‚Â·\tAlyssa-Jane Cook as Deb\nÃ‚Â·\tJohn Allen as T.V journalist\nÃ‚Â·\tAlan Cassell as John Gorton\nÃ‚Â·\tPauline Chan as Lien\nÃ‚Â·\tBrett Climo as Ritchie\nÃ‚Â·\tMick Conway as Knifethrower\nÃ‚Â·\tCelia De Burgh as Monica Montgomery\nÃ‚Â·\tNicholas Eadie as Phil Goddard\nÃ‚Â·\tNoel Ferrier as Sir Robert Menzies\nÃ‚Â·\tLucky Grills as Sen. Shane Paltridge\nÃ‚Â·\tVirginia Hey as Journalist\nÃ‚Â·\tJim Holt as Lt Smart\nÃ‚Â·\tVeronica Lang as Evelyn Goddard\n\nProduction\n\nThe project was filmed in New South Wales, Australia, and Phuket in Vietnam, presumably in 1986. Nicole would've been just 19 years old at the time. 1986 Kennedy-Miller, the producers behind the show, later cast her in Dead Calm. Vietnam features a host of high calibre Australian television actors. Veronica Lang, Barry Otto and Nicholas Eadie made up the Goddard family, playing Megan's mother Evelyn, father Douglas and older brother Phil, respectively. Barry Otto is a 5-times nominated Australian Film Institute actor, who built up a solid body of work since his debut in the mid 1970's. He was recently seen in Australia in the small role of Administrator Allsop. Playing Evelyn is Veronica Lang, an English actress who was a familiar face on TV screens in England and Australia from 1965. She starred in Winners alongside Nicole in 1985, playing Alison Trig. Both Barry Otto and Veronica Lang also starred in Aussie soap A Country Practice, in which Nicole also appeared. Playing the pivotal role of Phil, Megan's older brother who gets drafted into the army, is Nicholas Eadie.\nRelease and Reception\nThe first episode of Vietnam aired in Australia on February 23, 1987, and received some strong reviews from the Australian press. Reviews praised the shows accuracy in portraying society's changing attitudes towards the war, as well as the family dynamic and character development. &quot;There is much to admire and little to criticize in Vietnam. Personal relationships inside and outside the family and the shift in society's attitudes have been penetratingly and evocatively observed. All the characters, including the South Vietnamese for once, have been given an empathetic point of view,&quot; wrote The Age on the day of the shows premiere. The paper added that, &quot;The direction elicits absolutely involving performances from a top-drawer cast who endow the piece with subtle flourishes and delightful finishing touches.&quot; In another review a few days later, the paper highlighted Nicole and Nicholas Eadie as the strongest points within the show - &quot;Especially fine are Nicholas Eadie as Phil, beginning as a finely crafted ordinary bloke and ending as a man who has experienced too much, and Nicole Kidman as the little sister who grows up. It is their relationship, brother and sister, which holds the whole thing together.&quot; To many it is considered one of Australia's greatest television series.\nVietnam aired in the UK in 1988.\n","torrent":{"xt":"urn:btih:410fbb5b80d59144c4bee456af2f4b8a3f4a957b","amp;dn":"Vietnam+Australian+TV++Disc+02++h264+MKV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"410fbb5b80d59144c4bee456af2f4b8a3f4a957b","infoHashBuffer":{"type":"Buffer","data":[65,15,187,91,128,213,145,68,196,190,228,86,175,47,75,138,63,74,149,123]},"announce":[],"urlList":[]}}