{"title":"Doctor Who final episode: The Wedding of River Song","uid":6742142,"size":367400054,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:44ae2ca36d2787c0a862ec02b1ed558dc29b5719&amp;dn=Doctor+Who+final+episode%3A+The+Wedding+of+River+Song&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"stu181","files":1,"time":1318548720,"description":"Plot\n\nThe Doctor, aware of his death at the fixed point of time on 22 April 2011 at Lake Silencio, attempts to track down the Silence to learn why he must die. He encounters the Teselecta shapeshifting robot and its miniaturised crew who are currently posing as one of the members of the Silence; through them, the Doctor is led to the living head of Dorium Maldovar, one of the Doctor's allies taken by the Order of the Headless Monks. Dorium reveals that the Silence is dedicated to averting the Doctor's &quot;terrifying&quot; future, warning him that &quot;On the fields of Trenzelor, at the fall of the Eleventh, when no living creature can speak falsely or fail to answer, a question will be asked - one that must never be answered. And Silence must fall when the question is asked.&quot; The Doctor continues to refuse to go to Lake Silencio until he discovers his old friend, Brigadier Lethbridge-Stewart, has passed away. The Doctor then accepts his fate. To avoid crossing his own time stream, he gives the Teselecta crew the envelopes to deliver to Amy, Rory, River Song, Canton Everett Delaware III, and a younger version of himself, inviting them to witness his death.","torrent":{"xt":"urn:btih:44ae2ca36d2787c0a862ec02b1ed558dc29b5719","amp;dn":"Doctor+Who+final+episode%3A+The+Wedding+of+River+Song","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44ae2ca36d2787c0a862ec02b1ed558dc29b5719","infoHashBuffer":{"type":"Buffer","data":[68,174,44,163,109,39,135,192,168,98,236,2,177,237,85,141,194,155,87,25]},"announce":[],"urlList":[]}}