{"title":"Browse Games torrents\t SUPREMACY MMA - MARVEL - XBOX360 - PAL / ","uid":6700424,"size":4403954300,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:450de9e4a9e9535c77df09680d9dbd841495f345&amp;dn=Browse+Games+torrents%09+SUPREMACY+MMA+-+MARVEL+-+XBOX360+-+PAL+%2F+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"boobsman","files":48,"time":1316949762,"description":"LT1.9 REQUIRED!!!\nDO NOT PLAY THIS GAME UNLESS YOU HAVE UPDATED TO THE LATEST FIRMWARE!!!\nIF YOU ARE ASKED TO UPDATE AND YOUR NOT RUNNING LT1.9 STOP THE GAME!!!\n\nSupremacy MMA brings the brutality of unsanctioned, amateur and unlicensed MMA fighting to your 360, favouring fast-and-furious gameplay and underground aesthetics over official branding and television-style presentation. The game aims to raise the bar in the MMA space by bringing an unprecedented level of fast, fluid combat, intuitive controls and true-to-the-sport brutality. It follows the rise of fighters and their individual stories as they fight their way to Supremacy.\n\nBrutal bloody combat: Realistic blood, breaks, snaps, tears and MMA pain\n\nFast arcade action: Fast, fluid Arcade fighting action. With intuitive controls It's easy to pick up and play, but hard to master\n\nAuthentic fighting styles: Choose from a wide variety of authentic styles and fighters\n\nStory mode: Work your way through different complete and dramatic storylines\n\nExperience system: Learn to block, counter, grapple, strike, parry while gaining XP and climbing your way up through the ranks to true Supremacy\n\nOnline from the ground up: Online built from the ground up for an awesome fighting experience\n\nExotic locales: From the underground gambling halls to Muay Thai training camps to Japanese arenas, you will make your way across over a dozen unique and exotic environments complete with circular rings to geometric cages","torrent":{"xt":"urn:btih:450de9e4a9e9535c77df09680d9dbd841495f345","amp;dn":"Browse+Games+torrents%09+SUPREMACY+MMA+-+MARVEL+-+XBOX360+-+PAL+%2F+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"450de9e4a9e9535c77df09680d9dbd841495f345","infoHashBuffer":{"type":"Buffer","data":[69,13,233,228,169,233,83,92,119,223,9,104,13,157,189,132,20,149,243,69]},"announce":[],"urlList":[]}}