{"title":"Democracy Now - 27 sep 2011","uid":6705564,"size":458163275,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:460d5ee5d0ab8ad56b149554c052460d42d95527&amp;dn=Democracy+Now+-+27+sep+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1317144093,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 27, 2011\n\n- Gaddafi Forces Stave Off Assault on Libyan Leader's Hometown of Sirte\n- U.S. to Sell Bahrain $53 Million in Military Equipment Following Brutal Crackdown\n- Pakistan's Imran Khan Speaks Out on ISI-Haqqani Ties\n- Poverty Rate Increases in 46 States\n- Michael Moore Addresses Ongoing &quot;Occupy Wall Street&quot; Protest\n- Israel Releases Al Jazeera Journalist Held Six Weeks Without Charge\n- Bolivia's Morales Halts Road Project Amid Mass Protests, Violent Crackdown\n- 9,000 West Papua Mining Workers Continue Strike\n- Pelican Bay Prisoners Resume Hunger Strike in California\n- Canada: 117 Arrested In Keystone XL Pipeline Protest\n- Sen. Rand Paul Blocks Legislation Strengthening Pipeline Safety Rules\n\n\nSpecial reports\n\n- U.S. Continues to Back Afghan Warlord Linked to 2006 Massacre and Torture of Prisoners\n\nNew revelations about a U.S.-backed warlord in Afghanistan are raising questions about whether the United States has violated its own laws in its aim to defeat the Taliban. The Atlantic magazine reports the United States, under both former President George W. Bush and President Obama, has actively supported the police commander in Kandahar, General Abdul Raziq, despite knowing of his involvement not just in corruption and drug smuggling, but also in major human rights abuses including killings and torture. Raziq has been a key figure in the U.S. strategy of supporting Afghan warlords in order to weaken the Taliban, working closely with U.S. special forces. He was promoted to head the police in Kandahar earlier this year after playing a key role in the U.S.-backed assault on the Taliban one year ago. The allegations against Raziq include responsibility for the torture of two teenage boys and the killing of 15 people in 2006. According to an investigation by our guest, Matthieu Aikins, for The Atlantic, the United States has continued supporting Raziq despite having been aware &quot;of credible allegations that Raziq and his men participated in a cold-blooded massacre of civilians.&quot;\n\n\n- Shock Doctrine at U.S. Postal Service: Is A Manufactured Crisis Behind Push Toward Privatization?\n\nToday, postal workers and their supporters are holding events across the country to press their demand for repealing the benefit-funding mandate, and push back against calls for their workplace to be privatized. For months, Americans have heard dire warnings about the impending collapse of the United States Postal Service due to fiscal insolvency and a drop in the use of mail service. In early September, the U.S. Postmaster General told Congress that the USPS is close to default and unveiled a series of radical proposals to cut costs by firing up to 120,000 workers, closing several thousand facilities, scaling back deliveries, and reducing benefits for retirees. But many postal workers say the much-touted crisis facing the U.S. Postal Service is not what it seems. They argue the greatest volume of mail handled in the 236-year history of the postal service was 2006. They also point to a 2006 law that forced the USPS to become the only agency required to fund 75 years of retiree health benefits over just a 10-year span, and say the law's requirements account for 100 percent of the service's $20 billion in losses over the previous four years, without which the service would have turned a profit. Last week, Republicans introduced legislation to overhaul the USPS in response to a bill proposed by Democrats that would refund a reported $6.9 billion in over-payments to the USPS retirement plan, offer early retirement and voluntary separation incentives, adjust retiree benefits prepayment requirements, and preserve employee protections set out in collective bargaining agreements. We host a debate between Chuck Zlatikin, the Legislative and Political Director of the New York Metro Area Postal Union, and Gene Del Polito, President of the Association for Postal Commerce in Washington, D.C.\n\n\n- Video Report From Libya: &quot;I Never Expected We Would Be Free&quot;\n\nIn Libya where a brigade commander of Libyan revolutionary fighters says his forces are communicating with families stuck inside of Col. Muammar Gaddafi's besieged hometown to try to secure a way out. More than one month after seizing Tripoli and effectively ending Gaddafi's rule, revolutionary forces still face fierce resistance from Gaddafi loyalists in the towns of Sirte, Bani Walid and in pockets in the country's desert south. Meanwhile, the National Transitional Council has delayed announcing an expanded interim cabinet of up to 36 members that is supposed to be more representative. Even as the fighting continues and questions remain over Libya's political future, inside the recently liberated capital city of Tripoli, the mood is largely upbeat. Democracy Now! correspondent Anjali Kamat and Jacquie Soohen of Big Noise Films were in Tripoli last week and filed and this report.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:460d5ee5d0ab8ad56b149554c052460d42d95527","amp;dn":"Democracy+Now+-+27+sep+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"460d5ee5d0ab8ad56b149554c052460d42d95527","infoHashBuffer":{"type":"Buffer","data":[70,13,94,229,208,171,138,213,107,20,149,84,192,82,70,13,66,217,85,39]},"announce":[],"urlList":[]}}