{"title":"VisualRoute 2010 Pro v14.0g Portable","uid":6743599,"size":50269871,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:463d7f39051e6b5ca8fb04e51b807552ca2b3d32&amp;dn=VisualRoute+2010+Pro+v14.0g+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"marco699","files":10,"time":1318597693,"description":"The best integrated ping, whois, and traceroute program.Identify the origin of hacker attempts, Internet abusers and spammers, identify IP locations.VisualRoute combines the tools Traceroute, Ping, and Whois into an easy-to-use graphical interface that analyzes Internet connections to quickly locate where an outage or slowdown occurs. \nIn addition, VisualRoute will identify the geographical location of IP addresses and Web servers on a global map--key information for security purposes to help identify Internet abusers and network intruders. \n\n\nVisualRoute also features an email tracking for troubleshooting email problems, a ping grapher for analyzing connectivity over time, and domain and network Whois information for quick problem or abuse reporting. Integration with Internet Explorer provides one-click traces to any Web site. \nThe ping capabilities provide a good idea of whether or not the site is live, while traceroute will help determine where along the route the problem lies. VisualRoute's traceroute provides three types of data: an overall analysis, a data table, and a geographical view of the routing. \nThe analysis is a brief description of the number of hops, where problems occurred, and the type of Web server software running at the site you are trying to reach. The data table lists information for each hop, including the IP address, node name, geographical location and the major Internet backbone where each server resides. \nThe World map gives a graphical representation of the actual path of an Internet connection. Users can zoom in/out and move the map around to position it as desired. A mouse click on a server or network name opens a pop-up Whois window, providing instant contact information for problem reporting. \nVisualRoute is available in English, French, German, Italian, Portuguese, Spanish and Swedish, and may be easily changed from one language to another. \nHere are some key features of VisualRoute 2010: \nTrace to any Remote IP or Domain from the VisualRoute Desktop or Server: \nTest connectivity from the VisualRoute desktop or server to any web server, IP address or network device. Get an instant report of the entire route and each network segment, see where data is being lost or excessive latency occurs. And by combining multiple network diagnostic tools in one easy to interface, VisualRoute provides a complete picture of connectivity performance -- with much faster results than traditional tools. \nGraphical View of Traceroute, Ping, Reverse DNS Connectivity Analysis: \nResults from several essential network diagnostic tools are integrated into an overall connectivity report, providing a graphical view of connection performance report including packet loss and latency for each network hop. Drill-down detail is easily visible with a mouse over any network hop. \nIP Location Reporting: \nThe physical geographical locations of network servers and routers is key information for understanding routing problems, viewing the actual route path on global map provides an instant of picture of routing efficiency and distances. \nNetwork Provider Reporting: \nSee the contact information for the company providing Internet access for each hop of a network route, so you can easily report network problems. \nDomain Whois Lookups: \nGet instant lookups of domain information from worldwide databases, so you can see the registered 'owner' of an IP address or domain. \nICMP and UDP Traceroutes: \nICMP is the standard diagnostic vehicle for traceroute reporting. UDP is an application protocol, UDP traceroutes extend the ICMP traceroute capability through a more accurate depiction of application routing and more 'firewall friendly' traces. VisualRoute's intelligent protocol selection system automatically switches from ICMP to UDP traceroutes where required. \nIPv6 Compatibility: \nIPv6 is the next generation of the Internet Protocol, the system by which data is transferred across the Internet. VisualRoute 2008 enables traces to IPv6 addresses, including IPv6 domain and network provider lookups. \n\nRequirements: \n128Mb memory, 40Mb disk space, 1Ghz processor \nInternet Connection \nSun Java Runtime Environment (included with VisualRoute) 1.4.2 or later \n\nWhat's New in This Release: \nVarious bug fixes and general improvements \n\n","torrent":{"xt":"urn:btih:463d7f39051e6b5ca8fb04e51b807552ca2b3d32","amp;dn":"VisualRoute+2010+Pro+v14.0g+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"463d7f39051e6b5ca8fb04e51b807552ca2b3d32","infoHashBuffer":{"type":"Buffer","data":[70,61,127,57,5,30,107,92,168,251,4,229,27,128,117,82,202,43,61,50]},"announce":[],"urlList":[]}}