{"title":"Goddecia, Anal Whore","uid":6730965,"size":56153968,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:46af3398b9202d6fda8d96dbcd7c51f75af2d12b&amp;dn=Goddecia%2C+Anal+Whore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sattori","files":1,"time":1318151404,"description":"Goddess Lycia induces you into a very deep, relaxing state of trance. You become vulnerable, suggestible, and completely open as the soft, serene music accompanies Goddess' velvet voice, drawing you more and more deeply into a state of utterly euphoric susceptibility.\n\nOnce you are emotionally open and as fully entranced as humanly possible, Goddess deeply ingrains into your brain how completely inadequate your way-too-small-to-please-a-woman &quot;penis&quot; is. She really rams it into your mind, that you are absolutely and positively incapable of ever pleasing a woman with your giggle stick, and that the only way you can ever achieve orgasm is through ANAL PENETRATION.\n\nAs you lie there in your trance, your subconscious mind absorbing all of this painfully humiliating and honest information, you will also be hearing the laughter of women and men, which will cause you the desire to cry combined with the desire to cum. Basically, you will be feeling more and more helpless and emotionally beaten down, but your &quot;penis&quot; will be getting more and more sexually aroused, your little ballzies more full, heavy, and desperate to release. Too bad the only way you can cum is if you get permission from a Domme and then fuck your ass, lol\n\n.mp3, 256kb/s, about 30 min. ","torrent":{"xt":"urn:btih:46af3398b9202d6fda8d96dbcd7c51f75af2d12b","amp;dn":"Goddecia%2C+Anal+Whore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46af3398b9202d6fda8d96dbcd7c51f75af2d12b","infoHashBuffer":{"type":"Buffer","data":[70,175,51,152,185,32,45,111,218,141,150,219,205,124,81,247,90,242,209,43]},"announce":[],"urlList":[]}}