{"title":"Muhammad - His life based on earlier sources by Martin Lings.epu","uid":7398857,"size":966798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47c7bb48aa1cc0dfb81dbd750df6382fec05389a&amp;dn=Muhammad+-+His+life+based+on+earlier+sources+by+Martin+Lings.epu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"haneeft","files":1,"time":1341005220,"description":"Acclaimed worldwide as the definitive biography of the Prophet in the English language. Martin Lings' life of Muhammad is unlike any other. Based on Arabic sources of the eighth and ninth centuries, of which some important passages are translated here for the first time, it owes the freshness and directness of its approach to the words of men and women who heard Muhammad speak and witnessed the events of his life. Martin Lings has an unusual gift for narrative. He has adopted a style which is at once extremely readable and reflects both the simplicity and grandeur of the story. The result is a book which will be read with equal enjoyment by those already familiar with Muhammad's life and those coming to it for the first time. This book was given an award by the government of Pakistan, and selected as the best biography of the Prophet in English at the National Seerat Conference in Islamabad in 1983. In 1990, after the book had attracted the attention of Azhar University, the author received a decoration from President Mubarak.\n\nAbout the Author\nMartin Lings, formerly Keeper of Oriental Manuscripts in the British Museum and the British Library, is the author of four works on Islamic mysticism, 'A Sufi Saint of the Twentieth Century', 'What is Sufism?', 'Sufi Poems' and 'The Book of Certainty', all published by the Islamic Texts Society.\n\nepub format tested on iPhone &amp; iPad\t\t","torrent":{"xt":"urn:btih:47c7bb48aa1cc0dfb81dbd750df6382fec05389a","amp;dn":"Muhammad+-+His+life+based+on+earlier+sources+by+Martin+Lings.epu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47c7bb48aa1cc0dfb81dbd750df6382fec05389a","infoHashBuffer":{"type":"Buffer","data":[71,199,187,72,170,28,192,223,184,29,189,117,13,246,56,47,236,5,56,154]},"announce":[],"urlList":[]}}