{"title":"The Texas Chainsaw Massacre(2003)DVDRip.AC3(ENG)-DROCK","uid":6700062,"size":735986359,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:47f8c294103de1101f98eca988f3d42f95e39859&amp;dn=The+Texas+Chainsaw+Massacre%282003%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1316939493,"description":"One of the most infamous horror films of the 1970s is revisited in this remake produced by action-spectacle maven Michael Bay. In the summer of 1973, four teenagers -- Erin (Jessica Biel), Morgan (Jonathan Tucker), Kemper (Eric Balfour), and Andy (Mike Vogel) -- are driving through Texas on a road trip when they pick up a hitchhiker, Pepper (Erica Leerhsen), who is on her way to Mexico to score some dope. With Pepper adding to the party atmosphere, the other four decide to join her, but as they're passing through a small town in Travis County, they see a bloody and distraught girl (Lauren German) wandering by the side of the road, and after stopping to help her, they realize she's been involved in something horribly traumatic. As the kids try to help the girl piece together the story of what happened, they find themselves drawn into the web of a murderous family of subnormal cannibals. Inspired -- like the original Texas Chainsaw Massacre, Psycho, The Silence of the Lambs, and Deranged -- by the crimes of Wisconsin multiple murderer Ed Gein, this remake of The Texas Chainsaw Massacre also features narration by John Larroquette, who narrated the original film (it was his first screen credit), as well as supporting performances by R. Lee Ermey, Andrew Prine, and Andrew Bryniarski.\n\nRipped with Handbrake.\n\nLength: 1 Hour 38 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:47f8c294103de1101f98eca988f3d42f95e39859","amp;dn":"The+Texas+Chainsaw+Massacre%282003%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47f8c294103de1101f98eca988f3d42f95e39859","infoHashBuffer":{"type":"Buffer","data":[71,248,194,148,16,61,225,16,31,152,236,169,136,243,212,47,149,227,152,89]},"announce":[],"urlList":[]}}