{"title":"Mixerland - Za Nebo (2011)","uid":6697091,"size":141151392,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:481f6d49dc413eb8c83e996c0058e56199bea985&amp;dn=Mixerland+-+Za+Nebo+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mixer1975","files":17,"time":1316831264,"description":"Mixerland finally finished working on their new album \\\\\\&quot;Za Nebo\\\\\\&quot; (Behind the Sky), which can be named the best! The group has existed since 1992, and managed to write a lot of diverse music, but this album, was a watershed in the history of Mixerland, unique product of its kind! Mixerland - an electronic extravaganza of Depeche Mode and Kraftwerk, wicked guitar of Korn and Steve Vai, soulful vocals of A-Ha and Radiohead, frenetic drive of Marilyn Manson and Rammstein, noble polyphony of Sweet and Uriah Heep, weighted conceptual of Yes and Pink Floyd! Mixerland texts are a philosophical neo-romantic decadence. Many musicians try to stir rock and electronica, but the bottling that Mixerland do you hardly tasted before. Mixerland achieved such a bouquet of flavors and sounds, which would have dreamed of the most eminent maestro cases of electronic and acoustic. Mixerland - an international project. To record an album, we had to travel 15 500 miles! Mix more than 1000 tracks! Spend hundreds of hours in the studio! \\\\\\&quot;Za Nebo\\\\\\&quot; is the best group\\\\\\'s album, which includes their classics in fresh arrangements and brand new songs! Listen and enjoy! \n\n","torrent":{"xt":"urn:btih:481f6d49dc413eb8c83e996c0058e56199bea985","amp;dn":"Mixerland+-+Za+Nebo+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"481f6d49dc413eb8c83e996c0058e56199bea985","infoHashBuffer":{"type":"Buffer","data":[72,31,109,73,220,65,62,184,200,62,153,108,0,88,229,97,153,190,169,133]},"announce":[],"urlList":[]}}