{"title":"Coast To Coast AM - 23.10.2011 - Sci-Fi, Superheroes, &amp; the","uid":6768551,"size":53724896,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:48c173d7d5738033b758f5961d56da02253b93e2&amp;dn=Coast+To+Coast+AM+-+23.10.2011+-+Sci-Fi%2C+Superheroes%2C+%26amp%3B+the+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ViViDSOL","files":4,"time":1319488750,"description":"Host: George Knapp\nGuests: Jeffrey Kripal\n\nChair of Religious Studies at Rice University, Jeffrey Kripal, talked about how various sci-fi writers and comic book creators have intertwined myth, religion, and the paranormal into their works, sometimes inspired by their own mystical or paranormal experiences. For instance Allan Moore, the creator of Watchmen, had a &quot;magical conversion&quot; after his encounter with a multi-dimensional demon in 1994, and comic book writer Grant Morrison (known for X-Men) had a mystical encounter in Nepal with &quot;5th-dimensional mercury-like silver beings that showed him all sorts of things,&quot; Kripal detailed. We're in the midst of a &quot;boiling cultural soup&quot; with increasing paranormal themes which add up to a super-story or grand mythology that human beings are &quot;essentially mini-gods in disguise,&quot; who are developing greater abilities and capacities, he explained.\n\nOne reason we're seeing these paranormal themes play out so strongly in film and pop-culture is because they aren't considered seriously in universities, and the science world, he said. Science doesn't have a handle on the mind and consciousness, and &quot;that's ultimately what the paranormal is about,&quot; he continued.\n\nHe looked at the creation of various superheroes, such as Superman (one of the first, his name was likely derived from Nietzsche's term ÃƒÅ“bermensch), and Spider-Man, whom he noted bears a similarity to certain descriptions of aliens. In fact, Barney Hill described Spider-Man type eyes for the alien that abducted him, said Kripal, adding that &quot;we're in a situation where something real has happened and we're getting bleed-through from the popular culture.&quot; One of the first descriptions of what we consider aliens was in Etidorpha, a novel published in 1895, that contained bizarre illustrations of a being with an immense forehead and no eyes. It's speculated that the book's author John Lloyd was experimenting with hallucinogenic or visionary plant substances which triggered his imagination.\n\nWebsite(s):\n\n   kripal.rice.edu\n\nBook(s):\n\n   Mutants and Mystics\n   Authors of the Impossible: The Paranormal and the Sacred","torrent":{"xt":"urn:btih:48c173d7d5738033b758f5961d56da02253b93e2","amp;dn":"Coast+To+Coast+AM+-+23.10.2011+-+Sci-Fi%2C+Superheroes%2C+%26amp%3B+the+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48c173d7d5738033b758f5961d56da02253b93e2","infoHashBuffer":{"type":"Buffer","data":[72,193,115,215,213,115,128,51,183,88,245,150,29,86,218,2,37,59,147,226]},"announce":[],"urlList":[]}}