{"title":"Frank Zappa - Tinsel Town Rebellion [Live] [1981][MP3]-trother","uid":6746621,"size":64861970,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4ec02af1c51c2fc112d75c741bf63666b7937ce3&amp;dn=Frank+Zappa+-+Tinsel+Town+Rebellion+%5BLive%5D+%5B1981%5D%5BMP3%5D-trother&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"trother","files":-1,"time":1318715052,"description":"            @@                       @@     @@\n           @@@                      @@@    @@@\n          @@@@@@  @@@@@    @@@@@   @@@@@@ @@@        @@@@@    @@@@@\n          @@@@@  @@@@@@@  @@@ @@@  @@@@@  @@@       @@@ @@@  @@@@@@@\n           @@@   @@@  !@ @@@   @@@  @@@   @@@@@@   @@@   @@@ @@@  !@\n           @@@   @@@     @@@   @@@  @@@   @@@@@@@  @@@   @@@ @@@\n           @!@   @!@     @!@   @!@  @!@   @!@  @!@ @!@@ @!@  @!@\n           !!@   !!@     !!@   !!@  !!@   !!@  !!@ !!@@      !!@\n            :!:   :!:     :!: :!:    :!:  :!:  :!:  :!:! :!   :!:\n             ::    ::      ::::       ::   ::  :::   ::::      ::\n                                               :::\n             ~ Frank Zappa - Tinsel Town Rebellion [Live] [1981] ~   \n                                           :::\n                                          :::\n\n\n                         1. Fine Girl\n                     \n                         2. Easy Meat\n\n                         3. For the Young Sophisticate\n\n                         4. Love of My Life\n\n                         5. I Ain't Got No Heart\n\n                         6. Panty Rap\n\n                         7. Tell Me You Love Me\n\n                         8. Now You See It- Now You Don't\n\n                         9. Dance Contest\n\n                        10. The Blue Light\n\n                        11. Tinsel Town Rebellion\n\n                        12. Pick Me, I'm Clean\n\n                        13. Bamboozled by Love\n\n                        14. Brown Shoes Don't Make It\n\n                        15. Peaches III \n\n\n\nFrom the Label:\n\nOriginally released in 1981 as a double (mostly) live album, now on one CD. At this time FZ began to appropriate punk rock for his own satiric purposes, and the title track takes an hilariously vicious look at the spoiled-brat punk bands that had begun to proliferate on the Sunset Strip. Sexual buffoonery was also one of his favorite topics here, in such pointed numbers as &quot;Fine Girl,&quot; &quot;Easy Meat,&quot; &quot;Bamboozled By Love.&quot; There's some good audience-interaction bits here as well, including one where he successfully solicits panties from female fans.\n\n\nBiography:\n\nComposer, guitarist, singer, and bandleader Frank Zappa was a singular musical figure during a performing and recording career that lasted from the 1960s to the '90s. His disparate influences included doo wop music and avant-garde classical music; although he led groups that could be called rock &amp; roll bands for much of his career, he used them to create a hybrid style that bordered on jazz and complicated, modern serious music, sometimes inducing orchestras to play along. As if his music were not challenging enough, he overlay it with highly satirical and sometimes abstractly humorous lyrics and song titles that marked him as coming out of a provocative literary tradition that included Beat poets like Allen Ginsberg and edgy comedians like Lenny Bruce. Nominally, he was a popular musician, but his recordings rarely earned significant airplay or sales, yet he was able to gain control of his recorded work and issue it successfully through his own labels while also touring internationally, in part because of the respect he earned from a dedicated cult of fans and many serious musicians, and also because he was an articulate spokesman who promoted himself into a media star through extensive interviews he considered to be a part of his creative effort just like his music. The Mothers of Invention, the '60s group he led, often seemed to offer a parody of popular music and the counterculture (although he affected long hair and jeans, Zappa was openly scornful of hippies and drug use). By the '80s, he was testifying before Congress in opposition to censorship (and editing his testimony into one of his albums). But these comic and serious sides were complementary, not contradictory. In statement and in practice, Zappa was an iconoclastic defender of the freest possible expression of ideas. And most of all, he was a composer far more ambitious than any other rock musician of his time and most classical musicians, as well.","torrent":{"xt":"urn:btih:4ec02af1c51c2fc112d75c741bf63666b7937ce3","amp;dn":"Frank+Zappa+-+Tinsel+Town+Rebellion+%5BLive%5D+%5B1981%5D%5BMP3%5D-trother","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ec02af1c51c2fc112d75c741bf63666b7937ce3","infoHashBuffer":{"type":"Buffer","data":[78,192,42,241,197,28,47,193,18,215,92,116,27,246,54,102,183,147,124,227]},"announce":[],"urlList":[]}}