{"title":"Frozen Planet S01E02 Spring 1080i HDTV","uid":6791367,"size":3510196752,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4f8e8518a30a8f0b7747a7e38539c6b79bd14931&amp;dn=Frozen+Planet+S01E02+Spring+1080i+HDTV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bornintheguz","files":2,"time":1320277395,"description":"Spring arrives in the polar regions, and the sun appears after an absence of five months; warmth and life return to these magical ice worlds - the greatest seasonal transformation on our planet is underway.\n\nMale Adelie penguins arrive in Antarctica to build their nests - it takes a good property to attract the best mates and the males will stop at nothing to better their rivals! But these early birds face the fiercest storms on the planet.\n\nIn the Arctic, a polar bear mother is hunting with her cubs. Inland, the frozen rivers start to break up and billions of tons of ice are swept downstream in the greatest of polar spectacles. This melt-water fertilizes the Arctic Ocean, feeding vast shoals of Arctic cod and narwhal. The influx of freshwater accelerates the breakup of the sea-ice - an area of ice the size of Australia will soon vanish from the Arctic.\n\nOn land, a woolly bear caterpillar emerges from the snow having spent the winter frozen solid. Caterpillars normally become moths within months of hatching, but life is so harsh here that the woolly bear takes 14 years to reach adulthood. Once mature it has only days to find a mate before it dies! Alongside the caterpillars white Arctic wolves race to raise their adorable cubs before the cold returns.\n\nIn Antarctica vast numbers of seabirds arrive on South Georgia joining the giant albatross and king penguins that have been there all winter. Elephant seals fight furious battles over females on a beach that contains the greatest mass of animals on the planet.\n\nFinally, the female Adelie penguins arrive, chased from the water by killer whales. Mating and chick rearing lie ahead of them.\n\n\n\nTorrent contains alternative ac3 audio for those having problems with original aac audio.","torrent":{"xt":"urn:btih:4f8e8518a30a8f0b7747a7e38539c6b79bd14931","amp;dn":"Frozen+Planet+S01E02+Spring+1080i+HDTV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f8e8518a30a8f0b7747a7e38539c6b79bd14931","infoHashBuffer":{"type":"Buffer","data":[79,142,133,24,163,10,143,11,119,71,167,227,133,57,198,183,155,209,73,49]},"announce":[],"urlList":[]}}