{"title":"HISTORY OF POP AND ROCK MUSIC - part 325","uid":6748998,"size":377745286,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:516830425332a8b1a23d0384f55a420d5fd37aa2&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+325&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zlatkopupovac","files":-1,"time":1318816160,"description":" \n\n                      PART  325\n\n\n               01. RICKY NELSON  - I Got A Feeling  (1958)\n               02. RICKY NELSON  - Hello, Mary Lou  (1961)\n               03. RICKY NELSON  - Travelin' Man (1961)\n               04. RICKY NELSON  - Garden Party  (1972)  \n\n\n\n     &quot;Hello Mary Lou&quot; is a song written by U.S. singer Gene Pitney and Cayet Mangiaracina and performed by Ricky Nelson in 1961. It reached #9 on the Billboard music charts on May 28, 1961, although the other side of the single, &quot;Travelin' Man&quot;, hit #1. In the United Kingdom, where it was the unrivalled A-side, it hit #2, and it was a hit in much of Europe, particularly Norway, where it spent 14 weeks at #1. The song is from his sixth album called &quot;Rick Is 21&quot; .\n    &quot;Garden Party&quot; is a 1972 hit song for Rick Nelson and the Stone Canyon Band from the album &quot;Garden Party&quot;. The song tells the story of Nelson being booed off the stage at Madison Square Garden, seemingly because he was playing his newer, country-tinged music instead of the 1950s-era rock that he had been successful with earlier, and his realization that &quot;you can't please everyone, so you've got to please yourself&quot;.Garden Party&quot; reached number six on the Billboard Hot 100 chart in the fall of 1972; it was Nelson's last Top 40 hit on the pop chart. The song also topped the Billboard easy listening chart for two weeks and reached number 44 on Billboard's Country Singles chart.\n\n     On October 15, 1971, a Rock 'n Roll Revival concert was given at Madison Square Garden in New York City. The playbill included many greats of the early rock era, including Chuck Berry, Bo Diddley, and Bobby Rydell.Nelson came on stage dressed in the then-current fashion, wearing bell-bottoms and a purple velvet shirt, with his hair hanging down to his shoulders. He started playing his older songs &quot;Hello Mary Lou&quot; and &quot;She Belongs to Me&quot;, but then he played The Rolling Stones' &quot;Country Honk&quot; (a country version of their hit song &quot;Honky Tonk Women&quot;) and the crowd began to boo. While some reports say that the booing was caused by police action in the back of the audience, Nelson took it personally and left the stage. He watched the rest of the concert backstage and did not reappear on stage for the finale.\n\nFrom Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:516830425332a8b1a23d0384f55a420d5fd37aa2","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+325","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"516830425332a8b1a23d0384f55a420d5fd37aa2","infoHashBuffer":{"type":"Buffer","data":[81,104,48,66,83,50,168,177,162,61,3,132,245,90,66,13,95,211,122,162]},"announce":[],"urlList":[]}}