{"title":"Gran Turismo 3 (NTSC KALISTO  DVDrip ) REUP_BY_PIRATE_CENTER","uid":6701196,"size":659299895,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:51719055b7cefc4a2c8276da709b0e7e18c8ff24&amp;dn=Gran+Turismo+3+%28NTSC+KALISTO++DVDrip+%29+REUP_BY_PIRATE_CENTER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"habinka","files":1,"time":1316976528,"description":"\n\n\nThe Gran Turismo series is considered by many to be the single greatest racing franchise of all time and Polyphony Digital's latest, Gran Turismo 3 A-spec could be the best game that the series has to offer. With unprecedented graphical excellence and an insane amount of depth, you'll be hard pressed to find any other racing game with the overall play value that GT3 brings to the table.\n\nThis guide will show you everything that the game has to offer, including complete details on all of the game's tracks, cars, prize cars and race series. Plus, for those looking for a little help, we offer up some driving instructions, track strategies, tips, and advanced tuning instructions. To cut to the chase, this Gran Turismo 3 A-spec strategy guide will provide you with everything you need to know about GT3.\n\nNOTE: This guide should be considered a work in progress, as not all of the sections have been completely finished. The i.LINK Battle Mode section is still completely under construction and we're still planning to add more information to the Driving 101 section pertaining to the License Tests and will add more detailed strategies to the section on the Tracks. ","torrent":{"xt":"urn:btih:51719055b7cefc4a2c8276da709b0e7e18c8ff24","amp;dn":"Gran+Turismo+3+%28NTSC+KALISTO++DVDrip+%29+REUP_BY_PIRATE_CENTER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51719055b7cefc4a2c8276da709b0e7e18c8ff24","infoHashBuffer":{"type":"Buffer","data":[81,113,144,85,183,206,252,74,44,130,118,218,112,155,14,126,24,200,255,36]},"announce":[],"urlList":[]}}