{"title":"The Jim Bohannon Show 13-Oct-11 CF mp3 32K","uid":6744362,"size":28595701,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:53f5661336163bcbcf8251d7409fbb87905ee8ed&amp;dn=The+Jim+Bohannon+Show+13-Oct-11+CF+mp3+32K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"iChatter","files":2,"time":1318626455,"description":"The Jim Bohannon Show 13-Oct-11 CF mp3 32K\nCommercial Free\n\nThursday, October 13, 2011\nOn The Jim Bohannon Show...\n\nA lot of questions remain about the recently foiled plot to assassinate the Saudi Arabian ambassador to the U.S. by bombing a Washington, DC, restaurant. President Obama said today of the man accused in the plot -quote- &quot;[we] know that he had direct links, was paid by, and directed by individuals in the Iranian government.&quot; But what part of the Iranian government, which has been vehement in its denials that they were involved in a plot that some have called audacious, and others both convoluted and ham-fisted? Signs point to the Quds Force, a special unit of Iran's Revolutionary Guards tasked with exporting the Iranian Revolution abroad. It reports directly to the Supreme Leader of Iran, Ayatollah Ali Khamenei. Were they looking for deniability or did they just choose an incompetent operator? No matter which part of the Iranian regime was responsible for the plot, it's certain to worsen the already-abysmal relations between Iran and the U.S., which is calling on the rest of the world to levy harsher sanctions on the Tehran government. Does this plot constitute an act of war against the United States? That's the opinion of our guest tonight, Dr. Paul Bonicelli, executive vice president of Regent University in Virginia Beach, VA.\n\nEnergy - we use a lot of it, and it's plenty costly. Whether it's gasoline for our cars, coal for our electricity, natural gas for cooking, or the emerging green technologies, we need to be aware of how we use energy and how we can conserve it into the future. October is Energy Awareness Month, but the fact is we need to be more aware about our energy usage every month. Leading the way in this effort is a small community just outside of Houston, TX. There, twelve families are congregated on what's known as Innovation Avenue. The homes there have been outfitted with advanced energy technology - things like home energy monitors and smart appliances to solar panels and street lights - to provide the homeowners better information about, and control over, how they use energy. The families will provide feedback over the next two years on how the energy solutions and technologies have impacted their electricity use. The project is being backed by Reliant Energy, a division of NRG, Inc., the largest retailer of green power in the country. We'll talk about why this project is so important for the future with energy efficiency expert William Clayton, Reliant's vice president of Customer Care Operations, and Bob Vila, long-time home improvement guru best known for hosting the television programs This Old House for PBS and his own Bob Vila's Home Again.","torrent":{"xt":"urn:btih:53f5661336163bcbcf8251d7409fbb87905ee8ed","amp;dn":"The+Jim+Bohannon+Show+13-Oct-11+CF+mp3+32K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53f5661336163bcbcf8251d7409fbb87905ee8ed","infoHashBuffer":{"type":"Buffer","data":[83,245,102,19,54,22,59,203,207,130,81,215,64,159,187,135,144,94,232,237]},"announce":[],"urlList":[]}}