{"title":"The Process of Economic Development ,3rd Edition{BBS}","uid":6712440,"size":4296345,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:557731b60039d3c81c756c3be5d8509db2b03a50&amp;dn=The+Process+of+Economic+Development+%2C3rd+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317407831,"description":"The third edition of The Process of Economic Development offers a thorough and up-to-date presentation of development economics.  This landmark text will continue to be an invaluable resource for students, teachers and researchers in the fields of development economics and development studies.\n\nMuch has happened in the developing world since the appearance of the second edition in 2002. The period has seen remarkable growth rates in countries such as China and India, the accession of a number of post-communist economies to the European Union, financial crisis in Argentina and continuing desperate poverty in many African countries.  This third edition reflects these developments and includes new material on the following:\n\n    * national systems of innovation including information technology in India\n\n    * the ongoing impact of globalization\n\n    * the continuing programmes of foreign aid across all developing countries.\n\nCypher and Dietz's text is the development economics text par excellence as it takes a much more practical, hands-on view of the issues facing developing countries than its overly mathematical rivals.  It will appeal to all those studying this important subject area.\nAbout the Author\n\nJames M. Cypher is Research Professor, Doctoral Program in Development Studies, Universidad AutÃƒÂ³noma de Zacatecas, Mexico.\n\nJames L. Dietz is Professor at the Department of Economics at California State University, Fullerton, USA.\nProduct Details\n\n    * Paperback: 640 pages\n    * Publisher: Routledge; 3 edition (August 30, 2008)\n    * Language: English\n    * ISBN-10: 0415771048\n    * ISBN-13: 978-0415771047","torrent":{"xt":"urn:btih:557731b60039d3c81c756c3be5d8509db2b03a50","amp;dn":"The+Process+of+Economic+Development+%2C3rd+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"557731b60039d3c81c756c3be5d8509db2b03a50","infoHashBuffer":{"type":"Buffer","data":[85,119,49,182,0,57,211,200,28,117,108,59,229,216,80,157,178,176,58,80]},"announce":[],"urlList":[]}}