{"title":"Jay Dobyns - En mot hundra - 2010 - Daisy","uid":6785997,"size":262041579,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5a1f29f49582e554fb309cee3715916a8f1ebdcb&amp;dn=Jay+Dobyns+-+En+mot+hundra+-+2010+-+Daisy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"munimulan","files":-1,"time":1320091933,"description":"Jay Dobyns var undercover-agent. Hans mal var att bli fullvardig medlem i Hells Angels.\n\nDet amerikanska samhallet har lange kampat med de kriminella motorcykelgangens tillvaxt, polisens oformaga att stoppa gangkrigen och allmanhetens stigande osakerhet. Det finns ett satt att stoppa mc-gangens framfart. Men det ar inte latt. Att placera en agent innanfor murarna till en mc-klubb kraver ar av forberedelser. Och en alldeles sarskild person med ett extraordinart psyke. Skulle detta vara mojligt i Sverige?\n\nJay Dobyns hade lang erfarenhet som federal agent inom ATF (Bureau of Alcohol, Tobacco, Firearms and Explosive) nar han fick det svaraste uppdraget hittills, att infiltrera Hells Angels. Jay gick sa langt att han i praktiken blev sitt alias &quot;hangarounden&quot; Bird. I sin stravan att bli fullvardig HA-medlem dricker han hart, saljer vapen, spoar upp konkurrerande bikers och inte minst, lamnar sin familj i sticket.\n\nEn mot hundra. Jag infiltrerade Hells Angels har samma kusliga nerv som Quentin Tarantinos film Reservoir Dogs och samma autenticitet som Donnie Brasco. Men det har ar verkligheten. Jay Dobyns alias Bird har blivit slagen, skjuten och torterad. Ingen polis har hittills natt sa langt in i hjartat av en Hells Angels-klubb. Han och hans familj lever nu under hot.\n\n\nUpplÃƒÂ¤sare: HÃƒÂ¥kan Julander ","torrent":{"xt":"urn:btih:5a1f29f49582e554fb309cee3715916a8f1ebdcb","amp;dn":"Jay+Dobyns+-+En+mot+hundra+-+2010+-+Daisy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a1f29f49582e554fb309cee3715916a8f1ebdcb","infoHashBuffer":{"type":"Buffer","data":[90,31,41,244,149,130,229,84,251,48,156,238,55,21,145,106,143,30,189,203]},"announce":[],"urlList":[]}}