{"title":"Distant Shores [MKV]","uid":7421821,"size":4005355186,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5ad1b70a2135d32f40b65c96294fc17c95ce7a50&amp;dn=Distant+Shores+%5BMKV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"hitalker","files":13,"time":1341686085,"description":"This is in the file contents.txt\n================================\n\nDistant Shores is a comedy-drama first shown in the UK on ITV1 in January 2005.\n\nPeter Davison plays high flying London plastic surgeon Bill Shore. His marriage is on the rocks and his wife Lisa played by Samantha Bond has got a six month research job on a small Northumbrian island called Hildasay. Bill reluctantly agrees to relocate on the island with his wife, goth daughter, son and dog.\n\nSeries 2 was produced, but has yet to air on ITV. It has aired in Canada and in some European countries, but not in the UK. And ITV has said they have no plans to screen it.\n\n===\n\nThe files here are MKV-x264-AAC files, recoded from AVI files available in an earlier torrent to correct aspect ratio and letterboxing issues.\n\nWindows Media Player cannot play them without an additional codec pack such as &quot;DivX Plus Codec Pack&quot; (http://www.divx.com/en/software/divx-plus/codec-pack). \nUse VLC instead (http://www.videolan.org/vlc/).\n\nIf you like this, PLEASE SEED it to others!\n\n===\n\nEpisode #1.1\nJan. 5, 2005\nSmug, urbanite plastic surgeon Bill Shore begrudgingly agrees to accompany his wife and two children to a remote island in the Northumberland Strait populated by oddballs in an attempt to save his marriage.\n \nEpisode #1.2\nJan. 12, 2005\nA local island festival finds Bill convinced the townspeople are going to sacrifice him, Kate pursuing Ben with embarrassing results and Harvey going it alone in a three-legged race. Meanwhile things heat up between Lisa and Duncan.\n \nEpisode #1.3\nJan. 19, 2005\nLisa tries to keep Duncan at bay by reconciling his and Laneyr's marriage and Bill tries to get to the bottom of a young girl's depression.\n \nEpisode #1.4\nJan. 25, 2005\nBill is tasked with saving the island by helping a disgruntled patient threatening to sue the community find true love with the local shop girl; a beach rendezvous between Lisa and Duncan does not go unwitnessed.\n \nEpisode #1.5\nFeb. 2, 2005\nAs Laneyr and Duncan's wedding day approaches, Bill attempts to save the life of an islander while reconciling his wife's infidelity.\n \nEpisode #1.6\nFeb. 9, 2005\nThe series finale finds a violent storm approaching the island as Lisa ponders staying and Bill returning to London without her and the children.\n\nEpisode #2.1\nLisa takes it upon herself to write the obituary of the island's newspaper editor when he dies, and Bill faces a woman from his past who unexpectedly moves to the island; Kate returns from her European trip without Ben.\n \nEpisode #2.2\nJun. 26, 2008\nBill tries to convince Lisa to stay on Hildasay while avoiding telling her about his financial woes; Laneyr is convinced her baby hates her; Kate meets the island's new owner, Jake.\n \nEpisode #2.3\nJun. 26, 2008\nSome unfortunate discoveries abound on the island of Hildasay when Kate faces a consequence of her one night stand with Jake, and Bill happens upon an unfavorable remedy to his performance anxiety.\n","torrent":{"xt":"urn:btih:5ad1b70a2135d32f40b65c96294fc17c95ce7a50","amp;dn":"Distant+Shores+%5BMKV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ad1b70a2135d32f40b65c96294fc17c95ce7a50","infoHashBuffer":{"type":"Buffer","data":[90,209,183,10,33,53,211,47,64,182,92,150,41,79,193,124,149,206,122,80]},"announce":[],"urlList":[]}}