{"title":"Does God Get Diarrhea","uid":6701276,"size":34762428,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b332c51cc94b5c39f5061a217534b66a0de83ac&amp;dn=Does+God+Get+Diarrhea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rosie1966","files":2,"time":1316979829,"description":"Product Description\nIn a world where religion is traditionally free from ridicule, out comes a book that clearly steps over the line and smashes the protective veil that surrounds all of the lies, myths, and fairy tales. McGaffer wastes no time in hammering religion with logic, crude humor, and blatant disrespect. Does God Get Diarrhea demonstrates the extreme absurdity of Christianity by tearing apart the Bible's asinine claims, critiquing the miracles of Christ, and exposing God as a hateful, bloodthirsty, mass murderer. Not for the faint of heart, this book definitely doesn't beat around the burning bush when it comes to tolerating barbaric ideals and primitive creation theories. Does God Get Diarrhea delivers what many non-believers have been too fearful to say for thousands of years with a huge twist of robust humor. The title itself is enough to raise the eyebrows of even the most liberal minded individuals and is guaranteed to offend almost everyone. Laugh your way through this book as you discover the gruesome reality of religion, the serious damage it has caused to our society, and the grim fate of a superstitious planet. Warning: This book contains graphic content, foul language, and reason. All of which can be hazardous to your health. &quot;Disgusting...an intolerant and insensitive rant unsuitable for anyone.&quot; - Reverend J.A. David, Pentecostal Minister &quot;Pure filth and toilet humor. McGaffer has a complete lack of respect for religion.&quot; - Joseph F., Christian Author and Pastor &quot;McGaffer will be first in line to have his head sliced off on Judgment Day, and I can't think of anyone more deserving.&quot; - Mark L., Christian Extremist &quot;Horribly offensive...this book should be banned from shelves.&quot; - Mary P., Sunday School Teacher\n\nAbout the Author\nOdin Zeus McGaffer was born of a virgin on December 25th over 2,000 years ago. Much of his life remains a mystery, but crackpot theologians believe that he was a virgin carpenter with communist tendencies. McGaffer was murdered by his loving father, rose from the dead, and came back to Earth to consume large quantities of beer and fried cheese sticks. Although there is no solid evidence that supports the claims made in this biography, it cannot be disproven. Therefore you should believe this biography, in it's entirety, without good reason or justification.\n\nProduct Details\n\nPaperback: 216 pages\nPublisher: CreateSpace (January 7, 2010)\nLanguage: English\nISBN-10: 145050213X\nISBN-13: 978-1450502139\nProduct Dimensions: 8.6 x 5.8 x 0.5 inches\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:5b332c51cc94b5c39f5061a217534b66a0de83ac","amp;dn":"Does+God+Get+Diarrhea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b332c51cc94b5c39f5061a217534b66a0de83ac","infoHashBuffer":{"type":"Buffer","data":[91,51,44,81,204,148,181,195,159,80,97,162,23,83,75,102,160,222,131,172]},"announce":[],"urlList":[]}}