{"title":"Cyber Update Nov.2011------WP-16775  Lorelei Lee and Jessie Co","uid":6843613,"size":779941540,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5b62d1a145b2a679397f5abb6479bbecba2a226b&amp;dn=Cyber+Update+Nov.2011------WP-16775++Lorelei+Lee+and+Jessie+Co&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":398,"time":1322243387,"description":"From Kink.com    (Wiredpussy)  + Pics\n\n\n\nThe holiday season brings out the worst in people. Whether it's family get-togethers or shopping for that perfect gift, one-upsmanship is the true meaning of this time of year. Not wanting to look frumpy for her office party, Jessie Cox enlists the help of Lorelei Lee to get rid of those last 10 pounds. But unorthodox personal trainer Lorelei takes Jessie's lack of motivation personally and takes an interest in getting her ass in shape. Tied to a bench with an acrylic butt plug stuffed up Jessie's luscious bubble butt, Lorelei shows Jessie that there is no gain with no pain, moving on to sticky pads on her abs, electrical metal clothes pins on her pert, erect but most of all hard nipples. Lorelei brings orgasm after orgasm out of her wet, willing hole with The Samurai. Finding Jessie's form lacking, Lorelei takes control of her muscle contractions, while suspending her in the air by her wrists. Lorelei finds Jessie's ass irresistible paying particular attention to it by making her cum with a metal ass hook  sparking with electricity, of course  that slides into her willing yet quivering butthole. Finally, with Jessie's arms in a box tie, Lorelei works on her client's cardio while chasing her with a zapper and violet wand, alternating between the two. She uses the wand and zapper during the cool down, which consists of Jessie on the receiving end of a hard, rough and strap-on fucking, compelling her pussy to the heights of ecstasy that only submission brings. \n\n\n\nScreens &lt;a href=&quot; http://www.wiredpussy.com/site/shoot.jsp?shootId=16775&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.wiredpussy.com/site/shoot.jsp?shootId=16775&lt;/a&gt;\n\n\nCheerz  :-)","torrent":{"xt":"urn:btih:5b62d1a145b2a679397f5abb6479bbecba2a226b","amp;dn":"Cyber+Update+Nov.2011------WP-16775++Lorelei+Lee+and+Jessie+Co","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b62d1a145b2a679397f5abb6479bbecba2a226b","infoHashBuffer":{"type":"Buffer","data":[91,98,209,161,69,178,166,121,57,127,90,187,100,121,187,236,186,42,34,107]},"announce":[],"urlList":[]}}