{"title":"Democracy Now - 28 sep 2011","uid":6707629,"size":456441166,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5cd38cfe9087a1a58e329c2855e1b268d28e51af&amp;dn=Democracy+Now+-+28+sep+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1317228644,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 28, 2011\n\n- Study: Workers Facing Costlier Health Premiums\n- Listeria Outbreak Kills 13 in U.S.\n- Study: 30,000 Cases of Border Patrol Abuses Since 2008\n- Report: FBI Keeps Names on Watch-List Despite Exoneration\n- Gaddafi Reported to Be Near Algerian Border\n- Israel Authorizes 1,100 New Settlement Homes\n- U.N. Official: Palestinian Authority Ready to Govern State\n- Hundreds Protest U.S. in Pakistan\n- Bahraini Court Upholds Sentences for Protest Leaders\n- Republicans Launch New Probe of Planned Parenthood\n- Danish Firm Protests Drug Use in Florida Execution\n- Postal Workers Hold Nationwide Protests Against Cuts, Funding-Mandate\n\n\nSpecial reports\n\n- &quot;Something Has Started&quot;: Michael Moore on the Occupy Wall St. Protests That Could Spark a Movement\n\nOscar-winning filmmaker, best-selling author,and provocateur laureate Michael Moore joins us for the hour. One of the world's most acclaimed - and notorious - independent filmmakers and rabble-rousers, his documentary films include Roger and Me; Bowling for Columbine for which he won the Academy Award, Fahrenheit 9/11, SICKO; and Capitalism: A Love Story. In the first part of our interview, Moore talks about the growing &quot;Occupy Wall Street&quot; protests in Lower Manhattan, which he visited on Monday night. &quot;This is literally an uprising of people who have had it,&quot; Moore says. &quot;It has already started to spread across the country in other cities. It will continue to spread. ... It will be tens of thousands and hundreds of thousands of people ... Their work ahead is not as difficult as other movements in the past ... The majority of Americans are really upset at Wall Street ... So you have already got an army of Americans who are just waiting for somebody to do something, and something has started.&quot;\n\n\n- &quot;Here Comes Trouble&quot;: Michael Moore Tells The Formative Tales Behind His Filmmaking, Rabble-Rousing\n\nFor more than two decades, Michael Moore has been one of the most politically active, provocative and successful documentary filmmakers in the business. We talk to Moore about his new memoir, &quot;Here Comes Trouble: Stories from My Life,&quot; which comprises 20 biographic vignettes that capture how his political and sociological viewpoints developed. He also discusses the numerous attacks and death threats he received after speaking out against former President George W. Bush, after winning a 2003 Academy Award for his film, Bowling for Columbine. He first discussed these fears and necessity to hire a security team on Democracy Now! last year, which ultimately encouraged him to write publicly about these incidents in his memoir.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:5cd38cfe9087a1a58e329c2855e1b268d28e51af","amp;dn":"Democracy+Now+-+28+sep+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cd38cfe9087a1a58e329c2855e1b268d28e51af","infoHashBuffer":{"type":"Buffer","data":[92,211,140,254,144,135,161,165,142,50,156,40,85,225,178,104,210,142,81,175]},"announce":[],"urlList":[]}}