{"title":"Dead island-Reloaded by (oldBen)","uid":6847448,"size":5898027723,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5d4a4797beb61c9f172bbe7efab600ac34aedfff&amp;dn=Dead+island-Reloaded+by+%28oldBen%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"(oldBen)","files":2,"time":1322401673,"description":"Dead Island Reloaded\n\nDead Island is a first person horror action-adventure video game Developed by Tech Land and published by Deep Silver for Microsoft Windows, Xbox 360 and PlayStation 3 It is centered on the challenge of survival is a zombie-infested island OpenWorld With A Major Emphasis is melee combat. It was Originally Announced at E3 2006, but was Pushed back to 2011. It was released on September 6, 2011 in North America and on September 9, 2011 for PAL regions (Excluding Germany).\n\nGameplay\n\nDead Island features an open world roaming, Played from a first person perspective. The focus is on melee combat, incorporating customizable Weaponry, vehicular Customization / combat, and RPG elements.\nThere's an experience system as well as a skill tree system. Also there is a stamina bar, Meaning That after a set amount of physical action, such as running, jumping, or swinging a weapon, the character will stop Thurs Need to Regain Their stamina before Continuing Thurs attack. There are &quot;special class&quot; zombies, Which are more powerful please the standard zombies. [8] Players Need to use flashlights in the dark and Areas During nighttime sections, adding suspense. There is a weather system.Although there is a child being infected in the original Dead Island trailer, there are no child zombies in the game.\nSpecific enemies in the game are: &quot;Walker,&quot; The most common zombie. Very slow, Either Normally they lay on the ground waiting, or standing around in groups of 2-4, &quot;Infected&quot;, basically fast-moving, &quot;Infected&quot; Who Will Run at the character from far away and begin attacking, &quot;Suicider&quot; With a large enemy body boils upon the ITS, Heavily disfiguring it, &quot;Butcher&quot;, a humanoid-shaped zombies with long hair, and missing-Bothan arms from the elbow, with only bones sticking out of the sockets, &quot;Thug&quot;, WCG Knocks players over, stunning Them, &quot;Ram&quot;, a large man wrapped in a straitjacket with a mask, Covering his mouth, and finally, &quot;Floater,&quot; another large enemy disfigured Covered in slime with large red eyes Who Will vomit Towards the players.\n\nSystem Requirements\n\nMinimum\nOperating system Windows XP\nCPU Intel Core 2 Duo\nMemory 1GB RAM\nHard drive space 7 GB of free HDD space\nGraphics Hardware NVIDIA GeForce 8600 GT 512MB or ATI Radeon HD 2600 XT 512 MB.\n\n\nSEEEEEEEED AND COMMENT PLZZ:)","torrent":{"xt":"urn:btih:5d4a4797beb61c9f172bbe7efab600ac34aedfff","amp;dn":"Dead+island-Reloaded+by+%28oldBen%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d4a4797beb61c9f172bbe7efab600ac34aedfff","infoHashBuffer":{"type":"Buffer","data":[93,74,71,151,190,182,28,159,23,43,190,126,250,182,0,172,52,174,223,255]},"announce":[],"urlList":[]}}