{"title":"The Jim Bohannon Show 19-Oct-11 CF mp3 32K","uid":6757719,"size":28593821,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5ff1f51f8ecf174adcc50b02eff12fe781c9537f&amp;dn=The+Jim+Bohannon+Show+19-Oct-11+CF+mp3+32K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"iChatter","files":2,"time":1319103256,"description":"The Jim Bohannon Show 19-Oct-11 CF mp3 32K\nCommercial Free\n\nWednesday, October 19, 2011\nOn The Jim Bohannon Show...\nOne of the earliest and most consistent goals of the tea partiers is to reduce the national debt by cutting what they see as runaway government spending. Yet we also know that Americans are loathe to call for cuts in programs that affect them directly. The government has had its own debt commissions, which have come forth with some good ideas that have, basically, been roundly ignored. Where, then, does consensus lie? One good way to start is to ask the American people themselves. That was one of the ideas put forth by the group FreedomWorks this Summer when it set up its own Tea Party Debt Commission, charged with finding a way to balance the Federal budget within ten years. In order to do this, the Commission held field hearings across the country and set up a web site (www.TeaPartyDectCommission.com) to allow the average American citizen to take part in the process and help shape the final proposals. The process is ongoing, and the Commission will present its findings to Congress next month. We'll learn more about this effort from the man who is leading it: Dean Clancy, FreedomWorks' Legislative Counsel and Vice President of Health Care Policy.\n\nIn many ways, Johnny Cash was an American icon. From his looks to his manner of dress to the music he graced us with, we all felt we knew the measure of the man. But, how much of that was real versus what we projected upon him? Only those very close to the man himself can really answer that question. Now, we have a book that lays open the real Man in Black, thanks to his son, John Carter Cash, who joins us to talk about that book: &quot;House of Cash: The Legacies of my Father, Johnny Cash&quot; (published by Insight Editions). It's an intensely personal look at the man as revealed through unpublished photographs, lyrics, art, notes, and recollections from the Cash family archives. But especially it's an exploration of the deep and ongoing conversations between father and son about what really matters in life. It's a look at the legacy of a man of values who passed those values on to his son ... and to all of us. \n\nThe economy is in a mess and too many people are unemployed. The deficit is rising and banks are failing. Republicans and Democrats can't get along and nothing is getting done. There are protesters in the streets of major American cities and wild animals running loose in the suburbs. We have suffered though droughts, hurricanes, earthquakes, and the collapse of the Red Sox. The nation is going to heck in a handbasket! So, one of the burning questions of the day is this: What does &quot;Weird Al&quot; Yankovic think of it all? Well, luckily for all of us, &quot;Weird Al&quot; is with us again tonight so we can find out. Or not, who knows? We do know an expanded edition of his hit Comedy Central special is now out on DVD and Blu-Ray (&quot;Weird Al&quot; Yankovic Live! - The Alpocalypse Tour&quot; [from Comedy Central Studios], containing such hits as Perform This Way, White &amp; Nerdy, Amish Paradise, and Fat). We also know that he's still on tour, with appearances scheduled for New York's Beacon Theater this Sunday (10/23) and L.A.'s famous Pantages Theater on November 12. And his CD Alpocalpyse and children's book &quot;When I Grow Up&quot; (published by HarperCollins) are back in stock, too! What more could you ask for (beyond visiting him online at www.WeirdAl.com)?","torrent":{"xt":"urn:btih:5ff1f51f8ecf174adcc50b02eff12fe781c9537f","amp;dn":"The+Jim+Bohannon+Show+19-Oct-11+CF+mp3+32K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ff1f51f8ecf174adcc50b02eff12fe781c9537f","infoHashBuffer":{"type":"Buffer","data":[95,241,245,31,142,207,23,74,220,197,11,2,239,241,47,231,129,201,83,127]},"announce":[],"urlList":[]}}