{"title":"Democracy Now - 23 sep 2011","uid":6696415,"size":452883607,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:60903a5b0a0572172e08eb1032bdfb949fc598fc&amp;dn=Democracy+Now+-+23+sep+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1316796602,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 23, 2011\n\n- Saleh Returns to Yemen Amid Increased Violence\n- U.S. Accuses Pakistan Spy Agency of Hand in Embassy Attack\n- Palestinians Bring Statehood Bid to the United Nations\n- U.S. Leads Walkout on Ahmadinejad Speech at United Nations\n- GOP Candidates Debate in Orlando; Audience Boos Gay Soldier\n- Spending Dispute Threatens U.S. Government Shutdown\n- Study: Nearly 1 in 4 Children Under 6 Live in Poverty in the United States\n- California Police Officers Charged in Beating Death of Homeless Man\n- Tacoma Teachers Vote to End 10-Day Strike\n- &quot;Stingray&quot; Cell Phone Tracking Faces Court Challenge\n- Over 1,000 Protest Troy Davis Execution in NYC\n\n\nSpecial reports\n\n- Debate: Does U.N. Statehood Bid Advance or Undermine Palestinian Struggle?\n\nPalestinian President Mahmoud Abbas is expected to officially submit a statehood request to the United Nations in defiance of U.S. and Israeli threats. A new joint Israeli-Palestinian poll shows the Obama administration's stance on Palestinian recognition at the United Nations is more extreme than that of a strong majority of Israeli citizens, with 69 percent of Israelis saying their government should accept U.N. recognition of an independent Palestinian state. The survey also found 83 percent of Palestinians in the Occupied Territories support the bid. While supporters have hailed the bid as a step forward in the struggle to end the Israeli occupation and bring peace to the Middle East, critics call it a ploy by the Palestinian Authority to cling to power while undermining the rights of Palestinian refugees. We host a debate with two leading Palestinian analysts: Ali Abunimah, co-founder of the website Electronic Intifada, and author of &quot;One Country: A Bold Proposal to End the Israeli-Palestinian Impasse&quot;; and Mouin Rabbani of the Institute for Palestine Studies and the webzine Jadaliyya.\n\n\n- &quot;Confidence Men&quot; Author Ron Suskind Responds to Obama Admin's Fiery Denials About Financial Crisis\n\nAn explosive new book that draws a searing portrait of the Obama administration's failings, and early management of the economic crisis, has been met with sharp objections from officials within and outside of the White House. We speak with veteran journalist Ron Suskind, author of &quot;Confidence Men: Wall Street, Washington, and the Education of a President.&quot; He writes that U.S. Treasury Secretary Tim Geithner ignored an order from President Obama to consider dissolving the debt-ridden banking giant Citigroup as part of a reconstruction of major banks in March 2009. Suskind argues that Citigroup was one of several incidents where President Obama's authority was &quot;systematically undermined or hedged by his seasoned advisers.&quot; In the book based on interviews with more than 200 people, including former and current members of the Obama administration, as well as the president himself, Suskind also says the White House is a hostile workplace for women.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:60903a5b0a0572172e08eb1032bdfb949fc598fc","amp;dn":"Democracy+Now+-+23+sep+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60903a5b0a0572172e08eb1032bdfb949fc598fc","infoHashBuffer":{"type":"Buffer","data":[96,144,58,91,10,5,114,23,46,8,235,16,50,189,251,148,159,197,152,252]},"announce":[],"urlList":[]}}