{"title":"Call of Duty 1 Crack Solo and Online [French] [KeyGen included]","uid":6700603,"size":1247653502,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:61a5fb6f745f2e4631e8a48d87543a2c86da966d&amp;dn=Call+of+Duty+1+Crack+Solo+and+Online+%5BFrench%5D+%5BKeyGen+included%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Macksize","files":1,"time":1316956954,"description":"Call of Duty 1 / Activision\n\n\nPlatform: PC\nLanguage: French\nType: FPS\nFormat: ZIP\nSize: 1.16 GB\nDate: 25/09/2011\n\n\n\n[English]\n\n\n\nGames Notes :\n\n\nCall of Duty is a first-person shooter video game developed by Infinity Ward and published by Activision in 2003. It is the first game in a series with the same name. The game simulates the infantry and combined arms warfare of World War II. The game is based on the Quake III: Team Arena engine. It was accompanied in September 2004 by an expansion pack, Call of Duty: United Offensive, which was produced by Activision, and developed by Gray Matter Interactive, with contributions from Pi Studios. Call of Duty is similar in theme and gameplay to Medal of Honor, as it is made out of single-player campaigns and missions. However, unlike Medal of Honor, the war is seen not just from the viewpoint of an American soldier but also from the viewpoint of British and Soviet soldiers.\n\nThe game was somewhat unusual at the time in that throughout the single-player mode, the player is joined by computer-controlled allies who range in quantity from two infantrymen (in some of the British missions) to an entire regiment of tanks (in the Soviet missions). The computer-controlled allies will support the actual player during the missions. They also further the game's goal of providing an immersive and realistic experience; that is, soldiers in World War II were usually part of a larger group, as opposed to the &quot;lone wolf &quot; seen in video games such as Medal of Honor. However, there are some missions where the player is alone.\n\nThe &quot;Hardened&quot; and &quot;Prestige&quot; editions of Call of Duty: Modern Warfare 2, released on November 10, 2009, includes a redemption code to download the game onto Xbox 360 and PlayStation 3 hard drives, retitling it as Call of Duty Classic.\n\n\nInstall Notes :\n\nNo installation required, to play the game :\n\n1. Unzipped Call_of_Duty_1.zip\n2. Execute CoDMP or CoDSP to play SinglePlayer or Multiplayer.\n3. More details : use the ReadMe in the folder !\n\n[KeyGen included]\n\n\nGood Game.\n\n\n--------------------------------------------------------------------------------\n\n\n[FranÃƒÂ§ais]\n\n\n\nDescriptif du Jeu :\n\n\nCall of Duty sur PC restitue le rÃƒÂ©alisme cru et l'intensitÃƒÂ© cinÃƒÂ©matographique inÃƒÂ©galÃƒÂ©e des batailles de la Seconde Guerre mondiale. Vous ÃƒÂªtes dans la peau de soldats citoyens et de hÃƒÂ©ros anonymes des pays de l'alliance qui ont forgÃƒÂ© le cours de l'histoire moderne.\n\nBattez-vous dans Call of Duty en tant que membre d'une escouade surentraÃƒÂ®nÃƒÂ©e qui, sous le feu ennemi, rÃƒÂ©cupÃƒÂ¨re ses blessÃƒÂ©s pour les mettre en sÃƒÂ©curitÃƒÂ©. En plus des tactiques et des mouvements militaires authentiques, la personnalitÃƒÂ© et l'entraÃƒÂ®nement particulier de chaque personnage a son importance sur le champ de bataille. La guerre n'a pas ÃƒÂ©tÃƒÂ© gagnÃƒÂ©e par des soldats seuls ou des nations seules. Pour la premiÃƒÂ¨re fois, Call of Duty reconstitue la guerre ÃƒÂ  travers les perspectives diffÃƒÂ©rentes des AmÃƒÂ©ricains, des Britanniques et des Russes. Prenez part ÃƒÂ  24 missions qui reconstituent 4 campagnes historiques interconnectÃƒÂ©es. RÃƒÂ©alisez des objectifs de mission allant du sabotage ÃƒÂ  l'attaque totale en passant par l'infiltration, le sauvetage et le combat motorisÃƒÂ©.\n\n\n\nNotes d'installation :\n\n\nPas d'installation requise, pour jouer :\n\n1. DÃƒÂ©zipper le fichier Call_of_Duty_1.zip\n2. ExÃƒÂ©cutez CoDMP ou CoDSP pour jouer en solo ou en multijoueur.\n3. Plus d'infos dans le ReadMe du dossier !\n\n\n[KeyGen incluse]\n\n\nBon Jeu.","torrent":{"xt":"urn:btih:61a5fb6f745f2e4631e8a48d87543a2c86da966d","amp;dn":"Call+of+Duty+1+Crack+Solo+and+Online+%5BFrench%5D+%5BKeyGen+included%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61a5fb6f745f2e4631e8a48d87543a2c86da966d","infoHashBuffer":{"type":"Buffer","data":[97,165,251,111,116,95,46,70,49,232,164,141,135,84,58,44,134,218,150,109]},"announce":[],"urlList":[]}}