{"title":"Thrill St Blues (1985)","uid":6760587,"size":1096760358,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:68ce32a0df997203fcba9d3e20ef3cd1afe73164&amp;dn=Thrill+St+Blues+%281985%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"webchella","files":1,"time":1319194400,"description":"Thrill St Blues (1985)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0191556/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0191556/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.hotmovies.com/video/143653/Thrill-St-Blues/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hotmovies.com/video/143653/Thrill-St-Blues/&lt;/a&gt;\n\nCountry: USA \nDirector: Jerome Tanner\nLanguage: English \nAspect ratio: 1.33:1  \nLength: 85mn\nDvdrip Xvid Avi - 640x480 \nStarring: Heather Manfield, Heather Wayne, Helga Sven, Joanna Storm, Lana Burner, Stacey Donovan, Dino Alexander, Jack Baker, Jamie Gillis, Marc Wallice, Michael Morrison, Paul Thomas, Peter North, Tom Byron\n\nThe mysterious Boris Morris supposedly leaves prostitutes exhausted so he can take their money. Their madam doesn't know the prostitutes, most recently Cassandra, actually hire his services at his house. A police detective is on the case, but prefers seducing the younger prostitute Mary Lou. Falling for Cassandra, Boris Morris sleeps his way through the brothel to get to her. That is, until he gets caught and tied up by madam Belle. The madam takes advantage of him, but his mind escapes by fantasizing about Cassandra. Upon being caught by Cassandra herself, he breaks free and solves the misunderstanding by forcing himself on the soon willing Cassandra. The police break in, but get seduced by the entire brothel.\nHookers! All deliciously different and waiting for you at &quot;Belle De Balle's&quot; Thrill St. Bordello. Yes, Western Visuals' own Jerome Tanner has filled our plate with another feast of fabulously beautiful female flesh to stimulate our pelvic urges. Belle's girls are experts at separating you from your cash for their juicy secrets. That is until the arrival of &quot;Flash, the magic dork&quot;.\n\nIn a flash he can stand a girl's career on its head and have his sex-stunned victim paying him for the pleasure of his sexual prowess. Another recurring threat is the &quot;Heat&quot;, who do their best to catch our girls in the act. However, in the end, lust conquers all. Flash, the hookers, the detectives and even Flash's kinky dad come together in an all out lust crazed orgy!\n","torrent":{"xt":"urn:btih:68ce32a0df997203fcba9d3e20ef3cd1afe73164","amp;dn":"Thrill+St+Blues+%281985%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68ce32a0df997203fcba9d3e20ef3cd1afe73164","infoHashBuffer":{"type":"Buffer","data":[104,206,50,160,223,153,114,3,252,186,157,62,32,239,60,209,175,231,49,100]},"announce":[],"urlList":[]}}