{"title":"GTA 4 Full Rip (.zip)","uid":6734479,"size":9528060637,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6a40f6d5268a64ca8fa3237d80d0d9a62de846e5&amp;dn=GTA+4+Full+Rip+%28.zip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"VanDaylay","files":1,"time":1318274438,"description":"This is the Grand Theft Auto 4 full rip with 2 disk images (.iso). It is compatible with mods. This is best extracted using 7 zip.\n\nMINIMUM REQUIREMENTS:\n\nOperating System: Windows Vista Service Pack 1 OR Windows XP Service Pack 3\n\nProcessor: Intel Core 2 Duo 1.8Ghz or AMD Athlon X2 64 2.4GHz\n\nMemory/RAM: 1.5GB for Vista, 1GB for XP\n\nHard Disk Space: 16GB Free\n\nVideo Card: 256MB NVIDIA 7900 or 256MB ATI X1900\n\nRECOMMENDED REQUIREMENTS:\n\nOperating System: Windows Vista Service Pack 1 OR Windows XP Service Pack 3\n\nProcessor: Intel Core 2 Quad 2.4GHz, AMD Phenom X3 2.1GHz\n\nMemory/RAM: 2.5GB for Vista, 2.5GB for XP\n\nHard Disk Space: 18 GB Free\n\nVideo Card: 512MB NVIDIA 8600 or 512MB ATI 3870\n\n\nQUOTE:\n\nThe fourth installment of the popular series by Rockstar features improved graphics, new features, and new gameplay. Players take on the role of Niko Bellic, a rough-around-the-edge chap from Eastern Europe. Niko has arrived in America, in Liberty City -- a land full of promise and opportunity. His cousin convinced him to emigrate, to join him in his mansion and life of luxury, but as soon as he steps off the boat, Niko discovers the truth about the American way. Still, the wealth, the comfort, the bliss of the good life, it all really is here ... And it\\\\\\\\\\\\\\'s all for the taking. \n\nGet ready to experience the Liberty City of Grand Theft Auto IV on your PC like never before. Originally created as supplemental episodic content for Grand Theft Auto IV, but not available to players on the PC platform, Grand Theft Auto: Episodes From Liberty City is now available to all pertinent platforms introducing new characters, new weapons, new online multiplayer challenges and two new stories. Available as two standalone games on one disc, these two episodes, The Lost and Damned and The Ballad of Gay Tony do not require the original GTA IV game disc to play. \n\nFeatures: \n* Brings the interweaving Grand Theft Auto IV stories of Niko Bellic (main game), Johnny Klebitz (The Lost and Damned) and Luis Lopez (The Ballad of Gay Tony) to an explosive conclusion. \n* Contains The Lost and Damned and The Ballad of Gay Tony, on one disc. These were originally digital content releases for GTAIV that were unavailable to PC players. \n* Both games are standalone releases that do not require the original Grand Theft Auto IV game, or an Internet connection for their single player campaigns. (multiplayer modes are online) \n* Complete your Grand Theft Auto IV experience with powerful new weapons, vehicles, music, features and new mission types. \n* Each episode contains both a single player campaign as well as a variety of online multiplayer modes specific to the storyline of each.\n\n\n\n\nINSTRUCTIONS: (You must make an OFFLINE Windows Live account. DL \n\nhere: http://www.xbox.com/en-US/Live/PC/DownloadClient) Pretty simple, \n\ndownload the .iso images and mount them BOTH using \n\nDameon Tools LITE (Google it if you don\\\\\\\\\\\\\\'t what this software is), click \n\n\\\\\\\\\\\\\\&quot;run setup.exe\\\\\\\\\\\\\\&quot; when prompted, and install the game. When you are asked to choose a\n\nfile/ disk image for part 2, click on browse, and if you mounted the SECOND .iso \n\n.iso image, then you should find a blank drive labeled \\\\\\\\\\\\\\&quot;G:\\\\\\\\\\\\\\&quot; (Letter may vary, it \n\nwill always say something like \\\\\\\\\\\\\\&quot;GTA IV part 2\\\\\\\\\\\\\\&quot; though). It will take a long time to \n\ninstall. Once installed, DO NOT PLAY THE GAME YET. There will be a folder labeled\n\n\\\\\\\\\\\\\\&quot;G4Fr33Patch\\\\\\\\\\\\\\&quot;. It contains 8 patches, a crack, and instructions. Apply each patch \n\nin order from 1-8. (When there are two patches in one folder, use the \n\nBlue \\\\\\\\\\\\\\&quot;UpdateTitle\\\\\\\\\\\\\\&quot; patch every time.) Then, once you have used every patch up to 8,\n\nGo inside the crack folder, copy everything in there and paste it to the game \n\ndirectory (Where GTA4 Launcher.exe is) click on \\\\\\\\\\\\\\&quot;Copy and replace\\\\\\\\\\\\\\&quot;, right click on \n\nthe new \\\\\\\\\\\\\\&quot;GTA4Launcher.exe\\\\\\\\\\\\\\&quot; and click on: \\\\\\\\\\\\\\&quot;Create a shortcut\\\\\\\\\\\\\\&quot;. Make sure shortcut is\n\non desktop, double-click, play. It will take a while to launch. If there is a .dll \n\nerror, DO NOT REINSTALL. YOU WILL JUST WASTE YOUR TIME. The game may start anyway. \n\nIf it doesn\\\\\\\\\\\\\\'t, google the name of the .dll file, download it, and place it in the \n\ngame directory. (MAKE SURE YOU HAVE \\\\\\\\\\\\\\&quot;Games for Windows Live\\\\\\\\\\\\\\&quot; INSTALLED AND MAKE AN\n\nOFFLINE ACCOUNT. IF YOU DON\\\\\\\\\\\\\\'T KNOW HOW TO DO THAT, SEARCH IT ON YOUTUBE OR SIMILAR\n\nWEBSITE) Remember to seed, and if you have any problems, post in the comments. But \n\nseriously, if it works, seed. It\\\\\\\\\\\\\\'s already a long process, the least you could do \n\nmake it a little shorter. Thanks for hanging in there.\n\n\n\n\n\n\n\n\n\n\nDISCLAIMER:\n\nI take no credit for anything published by Rockstar Games or the original poster of this rip.","torrent":{"xt":"urn:btih:6a40f6d5268a64ca8fa3237d80d0d9a62de846e5","amp;dn":"GTA+4+Full+Rip+%28.zip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a40f6d5268a64ca8fa3237d80d0d9a62de846e5","infoHashBuffer":{"type":"Buffer","data":[106,64,246,213,38,138,100,202,143,163,35,125,128,208,217,166,45,232,70,229]},"announce":[],"urlList":[]}}