{"title":"POtHS - SIN-ister Secrets - 27 - Music That Sucks Out Your Soul","uid":6765035,"size":2391828616,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6ae15b50ac441b70c997ad7e7ff03ca4f2a38be4&amp;dn=POtHS+-+SIN-ister+Secrets+-+27+-+Music+That+Sucks+Out+Your+Soul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":6,"time":1319346992,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n           Download the New - &quot;Conspiracy Facts&quot; Series                        \nSIN-ister Secrets      \nThis is one of 3 NEW Series by GGHG\n\n\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\n\nPOtHS - SIN-ister Secrets - 27 - Music That Sucks Out Your Soul\n\n\n\n\n\nPOtHS - SIN-ister Secrets - 27 - Music That Sucks Out Your Soul/size]\n\n\n[size=16]Description:\n\n\nMUSIC that WANTS your SOUL.. (Release Date: 9/11/11)\n\nThis movie documentary covers hundreds of music videos. I can't name all of the artists, but I will list a few, so you have an idea of what you're going to watch now. I cover artists such as Michael Jackson, Lady Gaga, Madonna, ColdPlay, and older music like the Beatles. The video has Rock legends Elvis Presley, Led Zeppelin, the Rolling Stones, The Who, AC/DC, U2, and Queen. Along with a bunch of 90's artists like Nirvana and Red Hot Chili Peppers. The video also has hard rock artists like Marilyn Manson and Metallica. There is a good variety of music in this documentary even ranging from Slipknot to Eminem. Hip Hop and rap artists are covered like Jay Z, Rihanna, Snoop Dog, and others. There will be hundreds of more music artists that you have seen from TV. This video covers very little country, a few techno music videos, and a little punk, like Greenday. The majority of music is rock, pop, and rap.\n\nThe video quality is good. I included a sample trailer, when you download it, you can see the quality. For the most part, all of the music videos are about the same quality as in the trailer. There is some variation and along with that, there are a few interviews, like with Bob Dylan and Prodigy, the hip hop artist.\n\nNext, I will explain the theme of my documentary. At first glance, some people might write this off as a conspiracy. But do not be deceived. What this video covers is the message of music. Artists like Prince, and Kanye West to name a few. This video documentary will breakdown what that message is. I do narration to accomplish this. You are free to draw your own conclusions because for the majority of this film, the music videos will tell the story.\n\nFrom how I look at it, the music industry is controlled. What I mean by this, is if you want to be in the music industry, you have to support certain themes. For example, boy and girl bands in the past, like the Backstreet Boys, Insync, and the Spice Girls, have promoted a lifestyle of free sex. And what I mean by this, in current music videos, like with Beyonce or Christina Aguilera, the message you can see is one of sex instead of love. This is a problem because this message is being done covertly and is directed to today's youth. This is why it's hard to find any values being promoted by today's musicians because the music industry is controlled. It will feel like you are watching the same video over again because the song remains the same. These artists don't make their own music videos. Like I said earlier, through music videos, people's values are being changed into believing that there's no right or wrong. Music videos are turning into porn.\n\nMore information is needed about my video so you know exactly where I am coming from. This video covers the Satanism theme in music. This is the theme of my video because I believe these artists do believe in what's in their lyrics. It's not just fun and games. This video will show you this throughout, by showing examples from some of biggest names in the music industry. Once again, this is done by looking at music videos and breaking both the hidden and open messages present in them. Along with this, the video covers the symbols that these artist use, like Jay Z when he uses the pyramid or triangle.\n\nWith the Satanism themes being presented in the music world, it's only natural to cover the Jesus imagery present in music videos. This is a big part of my film. I believe in Jesus as my savior. I use passages from the book of the Bible. This is important because music videos make so many references to the Bible and Jesus, that you need know the teachings from the Bible, so you understand what some of these music videos are referring to.\n\nLastly, I will give you some more information so you know a little more about my film, so you can make the choice to download it. Basically I got a hold of thousands of music videos. I looked to see what I could find. I saw the same basic themes and messages in all music videos. I spent the last six months putting those themes and messages into this film. From my perspective, I see the music industry as being satanic, with a lot musicians promoting Satanism though their music. A lot of music videos go against Jesus, now this what I believe remember, to get their audience not to believe in Jesus. Watch my video, now to decide for yourself.\n\nRemember this is what I believe. Not everyone is going to see it like I do. I'm being honest, when I say, I know people will strongly disagree with me and people will be angry. But realize this, I made this film for free. I am not going against what I believe. I am willing to take a stand for my beliefs, even in the face of ridicule. So please, keep it polite, be nice. You are allowed to believe what you want, I respect that. In return, all I ask is for your respect and remember to keep an open heart.\n\nGod Bless\n\n\nQuality information\nRelease Date 9/11/11\nMPEG4 632*452\nVideo Bitrate: 1286 kbps\nNTC 29.97 fps\nAudio Bitrate 320 kbps\n\nThe Entire Collection can be found here: \n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nMore Torrents in this series atALL TORRENTS are RELEASED here FIRST!!! The First down loaders of my torrents get the Main Hookups on my SERVER. This will get lightning fast downloads, FOR FREE. (The High Speed download wholesalers are going to hate me)I upload to OVER 13 Torrent sites and this site is uploaded 1st.\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n\n \n\nGet info on the Take Over by The New World Order Below\n &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.hickoryhammockbaptist.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hickoryhammockbaptist.org&lt;/a&gt;                                                            Pastueur Carl Gallops\n                                                                                Listen to Alex Jones   Secular Truth &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                               Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                         Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                       Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n (thankyou) :thankyou:    (thankyou) :thankyou:   Thank You JESUS  \n\n                ","torrent":{"xt":"urn:btih:6ae15b50ac441b70c997ad7e7ff03ca4f2a38be4","amp;dn":"POtHS+-+SIN-ister+Secrets+-+27+-+Music+That+Sucks+Out+Your+Soul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ae15b50ac441b70c997ad7e7ff03ca4f2a38be4","infoHashBuffer":{"type":"Buffer","data":[106,225,91,80,172,68,27,112,201,151,173,126,127,240,60,164,242,163,139,228]},"announce":[],"urlList":[]}}