{"title":"Peter Pan - J. M. Barrie   (Unabridged)","uid":6709393,"size":163595429,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6bd8ec1a7d74f572d2e522efbe40c830b22f7731&amp;dn=Peter+Pan+-+J.+M.+Barrie+++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"neil1966hardy","files":4,"time":1317296983,"description":"Peter Pan\nUNABRIDGED\nby J.M. Barrie\nNarrated by Tim Curry\nLength: 5 hrs 31 min\n\nAudible Editor Reviews\nWhy we think it's Essential: This is a rare instance of two outstanding recordings of the same source material being considered for this list of essentials. But while we all enjoyed Jim Dale's enthusiastic performance, it was Tim Curry who most captivated us with his rendition of this classic children's tale. Curry's ability to evoke sheer childhood joy one moment and hide-under-the-sheets menace the next creates a far richer Peter Pan than Disney ever dreamed of.\n\nPublisher's Summary\n&quot;All children, except one, grow up.&quot;\nAnd so begins the story of one of the most beloved characters in children's literature, Peter Pan. J.M. Barrie's classic tale, completely unabridged, features a boy who refuses to grow up, Tinker Bell the fairy, and the Darling children: Wendy, John, and Michael. Their great adventure begins on the night that Peter flies into the Darling home looking for his shadow and teaches Wendy, John, and Michael how to fly with him back to Neverland, where adventures happen every day.\n\nCustomer's Reviews:\nThis is a great and unique story. Everytime it seems to stray from childrens story to hint at something more indepth, it skillfully pulls itself right back....and usually in a very childish manner. It's nonsensical and exciting. Makes you regret that you ever grew up, but then makes your forget for awhile that you ever did. Beautiful and fun book.....definently an all time great classic.\n\nTim Curry breathes life into this wonderful classic children's story. His voice gives such warm, comic expression to the snooty grown-ups, the treacherous-yet-stumbling pirates, the pouty fairy Tinkerbell, the nervous or excited children, and of course, the cheeky, indignant Peter Pan. Even if you're intimately familiar with the story, Curry's telling is memorable and well worth the listen.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:6bd8ec1a7d74f572d2e522efbe40c830b22f7731","amp;dn":"Peter+Pan+-+J.+M.+Barrie+++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bd8ec1a7d74f572d2e522efbe40c830b22f7731","infoHashBuffer":{"type":"Buffer","data":[107,216,236,26,125,116,245,114,210,229,34,239,190,64,200,48,178,47,119,49]},"announce":[],"urlList":[]}}