{"title":"The Secret Fury (VHS) [1950] Mel Ferrer","uid":6715199,"size":860754363,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6be0fd17e4b1331dc218c6794b69d5ef3b9f831f&amp;dn=The+Secret+Fury+%28VHS%29+%5B1950%5D+Mel+Ferrer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1317546096,"description":" &lt;a href=&quot;http://bayimg.com/laknKAaDE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/laknKAaDE&lt;/a&gt;\n\nThe Secret Fury (1950) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0042935/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0042935/&lt;/a&gt;\n\nThe Secret Fury is a 1950 American black-and-white drama film distributed by RKO Radio Pictures, directed by Mel Ferrer.\n\nThere are certainly many movies from the studio era with implausible storylines, including some great and successful pictures. RKO hoped that the top-tier talent of Claudette Colbert and Robert Ryan, along with a good supporting cast of character actors, would elevate The Secret Fury (1950) into something special, but while the story is at least initially compelling, it doesn't really hold together quite well enough.\n\nThe intriguing opening finds Colbert, a successful pianist, preparing to marry Robert Ryan, an architect. But during the ceremony, a man interrupts to announce that Colbert is already married. There appears to be some evidence of this and the wedding is stopped. A check at the records office reveals that Colbert's previous supposed wedding is fully documented and was witnessed, even though she doesn't recall it. Colbert and Ryan proceed to track down the first &quot;husband,&quot; but then there's a murder and Colbert is suspected, and she becomes increasingly unstable -- as does the believability of the plot.\n\nWhile The Secret Fury may not have been Colbert's best career decision, she and Ryan are such wonderful, watchable actors that even a misfire is worth a look. Colbert had agreed to do this film if Mel Ferrer directed, and Ferrer ended up drawing a great deal of blame from reviewers at the time. Variety said the &quot;script is inclined to talkiness but development does generate some interest as the mad scheme unfolds under Mel Ferrer's direction. Latter is tricky and could have stood more movement.... Little suspense or thrills in Ferrer's directorial mood. Characters never take on much reality.&quot; The New York Times blasted the film, calling it &quot;nonsense... cheap and lurid twaddle, wantonly unintelligent.&quot; \n\nNew Jersey-born Mel Ferrer was primarily an actor on stage and screen in his showbiz career, though he did delve into directing and producing as well. In the 1940s he worked as dialogue coach on a number of B films and even was John Ford's assistant on The Fugitive (1947). The Secret Fury was his second feature as director. The same year, he played a supporting acting role in Born to Be Bad (1950), directed by Nicholas Ray and starring his Secret Fury male lead, Robert Ryan. Four years later Ferrer married Audrey Hepburn, his fourth of five wives. He acted with her in War and Peace (1956) and directed her in Green Mansions (1959).\n\nClaudette Colbert, born in France as Emilie Claudette Chauchoin (she moved to America at age 3), made The Secret Fury as a follow-up to Three Came Home (1950), a fine WWII prison drama. Within a few years, Colbert would mostly vanish from the big screen in favor of a television career over the next decade until she retired in 1961, notwithstanding a final TV movie appearance in 1987.\n\nProducer: Jack H. Skirball\nDirector: Mel Ferrer\nScreenplay: Lionel Houser; Jack R. Leonard, James O'Hanlon (story)\nCinematography: Leo Tover\nArt Direction: Carroll Clark, Albert S. D'Agostino\nMusic: Roy Webb\nFilm Editing: Harry Marker\nCast: Claudette Colbert (Ellen R. Ewing), Robert Ryan (David McLean), Jane Cowl (Aunt Clara Ewing), Paul Kelly (District Attorney Eric Lowell), Philip Ober (Gregory Kent), Elisabeth Risdon (Dr. Twining), Doris Dudley (Pearl Collins), Dave Barbour (Lucian Randall), Vivian Vance (Leah).\n","torrent":{"xt":"urn:btih:6be0fd17e4b1331dc218c6794b69d5ef3b9f831f","amp;dn":"The+Secret+Fury+%28VHS%29+%5B1950%5D+Mel+Ferrer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6be0fd17e4b1331dc218c6794b69d5ef3b9f831f","infoHashBuffer":{"type":"Buffer","data":[107,224,253,23,228,177,51,29,194,24,198,121,75,105,213,239,59,159,131,31]},"announce":[],"urlList":[]}}