{"title":"Chantelise A Tale of Two Sisters v1.16 full-THETA","uid":6718614,"size":402104490,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6d4cca1f69f577f5efd6ae5a386dadbbd8c8735d&amp;dn=Chantelise+A+Tale+of+Two+Sisters+v1.16+full-THETA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"miguelsz3","files":1,"time":1317689315,"description":"Agian im too lazy to write a proper description ... So ima copy and paste from my old torrent! :D\n\n\nMade by the same people who created &quot;Recettear An Item Shops Tale&quot;\n\n&quot;Five years ago, a witch's curse beneath the red moon turned Chante into a fairy. Now she and her sister Elise search for a way to transform her back into a human, and in their travels they come across a particular town, which is home to a number of nearby ruins, as well as a peculiar shopkeeper named Aira, and a strange, mercurial fortune-teller who calls herself Elma. Could this place hold the key to returning Chante to normal? Or will it lead to more answers than our two sisters ever wanted to know?...&quot;\n\nBlah blah blah...\n\nAnywho have fun!\n\n\n\nMutli-Scanner Results:\n\nFiles to large, Sorry all!\n\n\nFrom Steam\nChangelog:\n\n*After defeating the Volcanicrab in the Ignan Ruins, Chante now correctly states that the player can use three magic stones.\n\n*Selecting the &quot;Simplify barrels/torches&quot; option in custom.exe no longer causes the game to spit a few errors on startup.\n\n*The display error with the Survival Dungeon floor counter has been corrected.\n\n*The late-game magics that summon the elemental spirits now all have correct spell descriptions.\n\n*Using the Return to Title option in windowed mode during plot events now properly terminates the event.\n\n*Mackerels in the Emperor-Bug's Tomb have had a bug fixed and no longer make the fishing minigame unplayable if you fail to catch them on the first pull.\n\n*The song list in Jukebox Mode is now properly in English.\n\n*The few typos in plot events and in the post-game event listing have been corrected.\n\n","torrent":{"xt":"urn:btih:6d4cca1f69f577f5efd6ae5a386dadbbd8c8735d","amp;dn":"Chantelise+A+Tale+of+Two+Sisters+v1.16+full-THETA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d4cca1f69f577f5efd6ae5a386dadbbd8c8735d","infoHashBuffer":{"type":"Buffer","data":[109,76,202,31,105,245,119,245,239,214,174,90,56,109,173,187,216,200,115,93]},"announce":[],"urlList":[]}}