{"title":"LORD OF THE RINGS: WAR IN THE NORTH - COMPLEX - XBOX360 - REGION","uid":6788814,"size":6147731123,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:6f68ef7122b210e03c7ad896f423dc83d38e8568&amp;dn=LORD+OF+THE+RINGS%3A+WAR+IN+THE+NORTH+-+COMPLEX+-+XBOX360+-+REGION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boobsman","files":69,"time":1320192627,"description":"LT+1.9 REQUIRED!!!\nDO NOT PLAY THIS GAME UNLESS YOU HAVE UPDATED TO THE LATEST FIRMWARE!!!\nIF YOU ARE ASKED TO UPDATE AND YOUR NOT RUNNING LT1.9 STOP THE GAME!!!\n &lt;a href=&quot;\nhttp://www.freeimage.us/image-9C6D_4EB05C5A.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-9C6D_4EB05C5A.jpg&lt;/a&gt;\n\nThe Lord of the Rings: War In The North is an epic multiplayer action/RPG video game based on the renowned stories by J.R.R. Tolkien. Warner Bros. Interactive Entertainment holds the rights to develop video games based on both the literary and motion picture content from The Lord of the Rings, allowing Snowblind to explore original and familiar narrative elements in more than 12 areas, of which only three have been seen in the films.\n\nBreaking new ground as the first mature-rated LOTR video game, The Lord of the Rings: War In The North evolves the RPG genre through innovative online, interdependent co-op play for up to three players who form their own Fellowship and engage in brutal combat.\n\nExploring previously unseen lands, story elements and characters as well as elements familiar from past feature films, gamers experience extensive character customization and development, expansive co-op gameplay options and upgradeable weapons, skills and special abilities. Players must play together or perish as they work to defeat Sauron's forces in the North.\n\nCreate your own Fellowship: Together, players and their friends will experience an epic, story-based adventure through vast Middle-earth to experience storylines and characters going beyond what has been seen in the feature films and previous games\n\nPlay as a team or perish! Social play is redefined through groundbreaking online, interdependent co-op gameplay which enables three different gamers to play as a complementary group where individual skills enhance the success of each team member\n\nBrutal gameplay: The Lord of the Rings: War in the North is the first M-rated The Lord of the Rings game on the market, authentically derived from The Lord of the Rings lore and delivering on action RPG principles\n\nIntricate character customization from an RPG powerhouse - Players choose from three playable races: Human, Elf or Dwarf. Extensive customization allows for meaningful and rewarding RPG gameplay including established loot and reward systems. Snowblind's history and credibility as an action/RPG gameplay studio makes them the perfect choice for creating an epic LOTR RPG\n\nOriginal social storyline: Players will experience an original storyline created especially for the social, collaborative three-player experience established within J.R.R. Tolkien's lore and approved by the J.R.R. Tolkien estate\n\nChallenge missions: Special missions consist of defensive positioning and group raids for up to 3 players, built especially for co-op challenges and not tied to the story\n\nTHIS IS A SCENE RELEASE, ALL CREDIT GOES TO THE ORIGINAL RIPPER!!!\n","torrent":{"xt":"urn:btih:6f68ef7122b210e03c7ad896f423dc83d38e8568","amp;dn":"LORD+OF+THE+RINGS%3A+WAR+IN+THE+NORTH+-+COMPLEX+-+XBOX360+-+REGION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f68ef7122b210e03c7ad896f423dc83d38e8568","infoHashBuffer":{"type":"Buffer","data":[111,104,239,113,34,178,16,224,60,122,216,150,244,35,220,131,211,142,133,104]},"announce":[],"urlList":[]}}