{"title":"Coast To Coast AM - 20.10.2011 - Crystal Skulls Special","uid":6768486,"size":55966760,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:70bbcf5078b2be4712d901146989470af97c1866&amp;dn=Coast+To+Coast+AM+-+20.10.2011+-+Crystal+Skulls+Special&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ViViDSOL","files":4,"time":1319486179,"description":"Host: George Noory\nGuests: Stephen S. Mehler, Carolyn Ford, Raymond Tarpey, Jaap vanEtten, Dr. Leonard Horowitz\n\nVarious experts shared their experiences with the intriguing world of Crystal Skulls. First up, historian Raymond Tarpey, who has specialized in the study of ancient Chinese and Mayan cultures, related the Mayan creation story, which he said described the &quot;Adam &amp; Eve of Atlantis.&quot; In the story, Eve is impregnated by a skull, and gives birth to twins. According to Edgar Cayce, a crystal known as Tuaoi, was used to provide energy for communications in Atlantis, he continued.\n\nAppearing in a half-hour segment, Jaap van Etten, Ph.D., talked about how crystal skulls convey and store various types of information. Crystal skulls have been used by people in many different ways, he noted. There is a legend of bringing the original 13 crystal skulls together, which he believes refers to mastering &quot;sufficient information and energy to be able to make a shift in consciousness, and every crystal skull whether contemporary or ancient has the potential to tap into that information system.&quot; Carolyn Ford, the guardian of the crystal skull Einstein (see photo below), described her communications. Einstein gave her formulas for her plant medicines, as well as made predictions about the future. Einstein sees people becoming more in harmony with themselves and the planet in the year 2013.\n\nAuthor and researcher Stephen Mehler was featured in the last 90 minutes of the program. In regards to how some of the ancient crystal skulls were made, he suggested some were carved by hand by a master shaman using a kick wheel. Citing the research of Nick Nocerino, and Marcel Vogel, Mehler described the skulls as being like ancient computers that have the ability to both store and transfer energy, as well as raise consciousness. There are a variety of methods to communicate with a skull, including breath, sound, and light, as well as meditation, where you propose questions or see images, he detailed. Mehler also spoke about his interest in Egypt, and said that since Zahi Hawass has left his position, there has been more access to ancient sites.\nGardasil &amp; Vaccine Dangers\n\nFirst hour guest, Dr. Len Horowitz reacted to news that the Gardasil vaccine had some contaminated doses. There's been 21,000 adverse reactions to the vaccine, and close to 100 people have died from it, he reported. Vaccinations are part of the plan by Big Pharma and global industrialists to reduce the world's population, he warned.\n\nNews segment guests: Jeff Nelken, Greg Hunter, Jim Berkland\n\nWebsite(s):\n\n   crystalskullsevent.com\n   crystalskullsevent.com/tarpey\n   einsteinthecrystalskull.com\n   lemurantis.com\n   drlenhorowitz.com\n   HealthyWorldAffiliates.com\n\nBook(s):\n\nThe Crystal Skulls: Astonishing Portals to Man's Past\n   \nCrystal Skulls: Interacting with a Phenomenon Gifts of Mother Earth\n   \nDNA: Pirates Of The Sacred Spiral\n   \nEmerging Viruses - AIDS and Ebola","torrent":{"xt":"urn:btih:70bbcf5078b2be4712d901146989470af97c1866","amp;dn":"Coast+To+Coast+AM+-+20.10.2011+-+Crystal+Skulls+Special","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70bbcf5078b2be4712d901146989470af97c1866","infoHashBuffer":{"type":"Buffer","data":[112,187,207,80,120,178,190,71,18,217,1,20,105,137,71,10,249,124,24,102]},"announce":[],"urlList":[]}}