{"title":"Stanley Brothers - The Early Years 1958-1961 - 4CD-BOX 2011","uid":6702539,"size":1436011345,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:723990dc1c6976045ffba1b9d894bbb0db3441e1&amp;dn=Stanley+Brothers+-+The+Early+Years+1958-1961+-+4CD-BOX+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"barber9","files":-1,"time":1317036214,"description":"The Stanley Brothers were a legendary American bluegrass duo made up of brothers Carter and Ralph Stanley.\n\n- - -\n\nCarter and Ralph Stanley hailed originally from Dickenson County, Virginia. The family soon moved to McClure, Virginia where their parents worked a small farm in the Clinch Mountains. Music was a part of their lives from early on, as they were able to listen to the likes of the Monroe Brothers, J. E. Mainer's Mountaineers and the Grand Ole Opry on local radio. The brothers soon formed a band, the Lazy Ramblers, and performed as a duo on WJHL radio in Johnson City, Tennessee. World War II interrupted any thoughts of a musical career, and it was not until both brothers returned from the service that they were able to make their own mark in music.\n\nThey formed their band, the Stanley Brothers and the Clinch Mountain Boys, in 1946 as the first band to copy the Monroe sound. Carter played guitar and sang lead while Ralph played banjo and sang with a strong, high tenor voice. Additional members of this early band were Darrell Pee Wee Lambert on mandolin and Bobby Sumner on fiddle. Sumner was soon to be replaced by Leslie Keith. On December 26, 1946, the band began performing at radio station WCYB in Bristol, Tennessee as stalwarts of the famed Farm and Fun Time radio show. They made their recording debut in September 1947 for Rich-R-Tone Records which had been founded the year before. Their records sold well, outselling even Eddy Arnold, regionally. Up to now, Ralph had been playing the banjo with two fingers only on recordings and in concerts but switched in 1948 to the three-finger style popularised by Earl Scruggs. In March 1949, the Stanley Brothers began recording for Columbia Records.\n\nDuring this time, Bill Monroe was not particularly fond of groups like the Stanley Brothers and Flatt &amp; Scruggs whom he believed stole his music by copying it and they were therefore seen as economic threats. Financially hard times in the early 1950s forced the brothers to take a short break in their musical career and they began working for the Ford Motor Company in Detroit. Eventually, Monroe and the Stanley Brothers became friends and Carter performed for several months with Bill Monroe in the summer of 1951. In August 1951, Ralph was involved in a serious automobile accident that almost ended his career. Following his recovery, Carter &amp; Ralph reunited to front their Clinch Mountain Boys.\n\nAs bluegrass music grew less popular in the late 1950s, the Stanley Brothers moved to Live Oak, Florida to headline the weekly Suwannee River Jamboree radio show on WNER from 1958 to 1962. The three-hour show was also syndicated across the Southeast. In 1966, the brothers toured Europe and upon returning home they continued to perform together until Carter's death in December 1966.\n\nThe brothers wrote many of their own songs and Carter had a particular knack for writing deceptively simple lyrics that portrayed strong emotion. The Stanley's style can best be described as a traditional mountain soul sound that remained close to the Primitive Baptist vocal stylings they learned from their parents and others near their southwestern Virginia home. Ralph has often used the expression, old-time, mountain style, what they call bluegrass' music, to differentiate the Stanley's sound from mainstream bluegrass. They later added an innovative touch to their traditional sound with the guitar solos of George Shuffler, an early proponent of the crosspicking guitar style.\n\nLater, Ralph revived the Clinch Mountain Boys and is still performing as of 2010. Among the musicians who have played in the revived Clinch Mountain Boys are Ricky Skaggs, Keith Whitley, Larry Sparks, Curly Ray Cline, Jack Cooke, Roy Lee Centers, Charlie Sizemore, Ray Goins, and Ralph Stanley II. Ralph's career received a big boost with his prominent role on the phenomenally successful soundtrack recording of the 2000 film, O Brother, Where Art Thou? The Stanley Brothers were inducted into the International Bluegrass Music Hall of Honor in 1992. In 2005, The Barter State Theatre of Virginia premiered an original stage production entitled, Man of Constant Sorrow: The Story of the Stanley Brothers, written by Dr. Douglas Pote. (wikipedia)\n\n- - -\n\nStanley Brothers - The Early Starday King Years 1958-1961\n(4CD Nashville TN Gusto Records 2011)\n\n  1 Holiday Pickin\n  2 Gonna Paint The Town\n  3 That Happy Night\n  4 Christmas Is Near\n  5 Love Me Darlin, Just Tonight\n  6 Shes More To Be Pitied\n  7 Heaven Seemed So Near\n  8 Your Selfish Heart\n  9 How Mountain Girls Can Love\n 10 The Memory Of Your Smile\n 11 Mastertone March\n 12 Clinch Mountain Backstep\n 13 Midnight Ramble\n 14 Train 45\n 15 Think Of What Youve Done\n 16 Keep A Memory\n 17 Old Daniel Prayed\n 18 He Said If I Be Lifted Up\n 19 This Wicked Path Of Sin\n 20 Are You Afraid To Die\n 21 The White Dove\n 22 How Can We Thank Him\n 23 Mothers Footsteps Guide Me\n 24 That Home Far Away\n 25 My Lords Gonna Set Me Free\n 26 The Angel Of Death\n 27 Wings Of Angels\n 28 Suwannee River Hoedown\n 29 Choo Choo Coming\n 30 Carolina Mountain Home\n 31 Trust Each Other\n 32 Beneath The Maple\n 33 Highway Of Regret\n 34 A Little At A Time\n 35 Another Night\n 36 Ridin That Midnite Train\n 37 Mountain Dew\n 38 Sunny Side Of The Mountain\n 39 Tragic Romance\n 40 Shenandoah Waltz\n 41 Next Sunday Darling Is My Birthday\n 42 Sweet Thing\n 43 Sweeter Than The Flowers\n 44 Its Raining Here This Morning\n 45 Shackles And Chains\n 46 Weepin Willow\n 47 Old Rattler\n 48 Im A Man Of Constant Sorrow\n 49 My Main Trial Is Yet To Come\n 50 Mother Left Me Her Bible\n 51 Jacobs Vision\n 52 Ill Not Be A Stranger\n 53 From The Manger To The Cross\n 54 Purple Robe\n 55 When Jesus Beckons Me Home\n 56 Jordan\n 57 Pass Me Not\n 58 Lonely Tombs\n 59 Over In The Gloryland\n 60 How Far To Little Rock\n 61 A Few More Seasons\n 62 Where Well Never Die\n 63 In Heaven, Well Never Grow Old\n 64 Mother No Longer Awaits Me\n 65 If I Lose\n 66 Little Maggie\n 67 God Gave You To Me\n 68 Dont Go Out Tonight\n 69 The Darkest Hour Is Just Before Dawn\n 70 Rank Strangers\n 71 Let The Church Roll On\n 72 Rock Of Ages (Let Me Hide Myself In Thee) \n 73 I Saw The Light\n 74 What A Friend We Have In Jesus\n 75 Gathering Flowers For The Masters Bouquet\n 76 Im Ready To Go \n 77 Let Me Love You One More Time\n 78 Little Benny\n 79 Old Love Letters\n 80 Daybreak In Dixie (undubbed version) \n 81 Daybreak In Dixie (overdubbed version) \n 82 Wildwood Flower\n 83 Let Me Rest\n 84 Are You Tired Of Me Darling\n 85 Finger Poppin Time (undubbed version) \n 86 Finger Poppin Time (overdubbed version) \n 87 Rank Strangers (alt.) \n 88 Come All Ye Tender Hearted\n 89 Lovers Quarrel\n 90 The Story Of The Lawson Family\n 91 Jenny Lynn\n 92 Little Willie\n 93 Big Tilda\n 94 Wild Bill Jones\n 95 Youre Still To Blame\n 96 Ill Take The Blame\n 97 Ill Just Go Away\n 98 Steel Guitar Rag \n 99 Id Worship You\n100 Just Dreamin\n101 The Drunken Driver\n102 Little Joe\n103 Handsome Molly\n\n\n\nAdditional personnel: \nCurley Lambert (vocals, guitar, mandolin, bass)\nBill Napier (vocals, guitar, mandolin)\nRalph Mayo (vocals, guitar, fiddle)\nGeorge Shuffler (vocals, guitar, acoustic &amp; electric bass) \nChubby Anthony (vocals, fiddle)\nAl Elliot (guitar, mandolin, bass)\nGene Meadows (guitar)\nJoe Meadows, Vernon Derrick, Art Stamper (fiddle)\nJohnnie Bonds, Audie Webster (bass).\n","torrent":{"xt":"urn:btih:723990dc1c6976045ffba1b9d894bbb0db3441e1","amp;dn":"Stanley+Brothers+-+The+Early+Years+1958-1961+-+4CD-BOX+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"723990dc1c6976045ffba1b9d894bbb0db3441e1","infoHashBuffer":{"type":"Buffer","data":[114,57,144,220,28,105,118,4,95,251,161,185,216,148,187,176,219,52,65,225]},"announce":[],"urlList":[]}}