{"title":"BORDERLANDS v1.4.1 [MULTI 5] [2009]","uid":6718752,"size":7508493080,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:725ce99b77d6918bbb960a52e5d890d945ef3c89&amp;dn=BORDERLANDS+v1.4.1+%5BMULTI+5%5D+%5B2009%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"anubishellspawn","files":-1,"time":1317694952,"description":"Year: 2009 \nGenre: Action (Shooter) / 3D / 1st Person \nDeveloper: Gearbox Software \nPublisher: 2K Games \nPlatform: PC \nSize: 6.99 GB ISO when mounted \nLanguages: English/Italian/Spanish/German/French \n\nGame Info \nBorderlands is a shooter in the spirit of the cult &quot;Mad Max&quot; - the world of the \nfuture, collected from improvised rubbish ... hmm ... vehicles, many groups and \nthe only law - &quot;every man for himself&quot;. The claimed kinship with Diablo will \nresult in not manifest counting the number of weapons and the ability to obtain \ntraditional role &quot;Level-ups, improving and a number of abilities a character. \nCan be upgraded and personal coach. However, most importantly, to emphasize that \nthe developers - the possibility of cooperative transmission. Three Comrades at \nany time be able to join your game if you are, of course, that you want. \nConservatives no rebuke to pass campaign in splendid isolation. \n\nGame Features \nHello, Wall-E! Most quests in single player Borderlands you will pass under the \ncommand of a small robot Claptrap, that looks desperately like Wall-E from the \nsame cartoon, but the voice - droid C-3PO from &quot;Star Wars&quot;. Do not think that \nunder his tutelage, you will be boring - this is quite an amusing robot, which \ndoes not prevent the game, and does not seem obsessive guide. Besides, having \nreached a certain level in the game, you will begin to carry out assignments \nindependently. \nSeamless regimes. All modes Borderlands - Single-player, co-op and Versus - \nconcluded in the framework of a vast, populated by monsters of the world on the \nplanet Pandora. This means that you can play well alone, and can always summon \nthree more players to join with them. You are free to choose their own quests, \nas well as participate in PvP at several local venues. \nUnique characters. Four playable characters each represent a class: Brik (attack \n/ berserk), Lilith (assassin / siren), Mordechai (hunter / sniper) and Roland \n(soldier / engineer). Each character has three skill tree, and each assigned its \nown unique features. For example, if you play for the Brick, you can activate \nits ability to berserk, and then he put aside arms, roll up your sleeves and \nprepare to wash their fists in the blood. The picture at this time painted in \nred color, and Brik's almost impossible to kill. Lilith can quietly move among \nthe enemy, removing the opponents one by one. Roland at any time can get a \nprotective turret and honeycomb whatever he wants. Mordechai is not for nothing \nthat the hunter - in its possession is always available bird of prey. Of course, \nall these qualities have their time to restart, but it happens fairly quickly, \nbecause applying them in the battles have often. \nan item around! Borderlands creates new types of weapons on the go, randomly \nglue the different parts, types of ammunition and a scheme in which we can get \nliterally hundreds of thousands of weapons. Although, admittedly, in the midst \nof these hundreds of thousands of junk will abound. Fortunately in the \nBorderlands in finding the weapons will float window with detailed information \nso that you can decide in advance whether an item to select. In addition to the \nammo, weapons, money and healing items, Heath Pandora are a variety of \nextraterrestrial artifacts, which can also be collected \n\nMinimum System Requirement \nOS: Windows XP / Vista \nProcessor: 2.4 Ghz or equivalent processor \nMemory: 1GB System RAM (2GB recommended with Vista) \nGraphics: 256mb video ram or better (GeForce 8 series or higher / Radeon R8xx series) \nHard Drive: 8 GB or more free space \nSound: Windows compatible sound card \n\n\nHow to install: \n1.Download  \n2.Mount ISO image on virtual drive to install the game \n3.After install, copy/paste crack file to game directory.\n \nnote: the crack has 2 files you need to move to game install \n4.Launch the game after you apply the crack \n","torrent":{"xt":"urn:btih:725ce99b77d6918bbb960a52e5d890d945ef3c89","amp;dn":"BORDERLANDS+v1.4.1+%5BMULTI+5%5D+%5B2009%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"725ce99b77d6918bbb960a52e5d890d945ef3c89","infoHashBuffer":{"type":"Buffer","data":[114,92,233,155,119,214,145,139,187,150,10,82,229,216,144,217,69,239,60,137]},"announce":[],"urlList":[]}}