{"title":"The Unknown Technology in Homer, 1st Edition{BBS}","uid":6710435,"size":53011518,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73f59c28aea2f5aebfd46cf10e08f72b27941173&amp;dn=The+Unknown+Technology+in+Homer%2C+1st+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317332975,"description":"This book has been well received in the original Greek version and is now available in English. It is a thorough review of recent research discoveries of scientific and technological knowledge contained in the Iliad and the Odyssey, suggesting elements of a very advanced, almost modern, civilization, in the Mycenaean era.\n\nRecommended for a wide audience.\nFrom the Back Cover\nThe astonishing accounts of almost modern technological achievements found in the Homeric Epics constitute one of the so-called Homeric Issues. The question is whether such achievements existed in reality or whether they were just poetic conceptions. Both views have their followers and adversaries. For example, robots, either in human form, as the golden girls serving Hephaestus, or in animal form, as the gold and silver mastiffs of King Alcinous, or even the intelligent, self-propelled ships of the Phaeacins, could hardly have existed in an era for which no evidence or even hints of prime movers exist. Even so, such references prove that the Mycenaean people were well aware of the importance of such devices, and this certainly acts as a catalyst for technological progress. On the othe hand, besides the unparallelled building ability of the Mycenaeans, as is the case with the Cyclopean Walls, technology specialists may locate examples of structures so advanced, that they can be considered modern with regard to materials, design and manufacture. Still, these can be well within the possibilities of the era. In fact, one can reasonably state, that, if the Mycenaean Civilisation had not collapsed, the world history of technology would be totally different. From the contents of the present book, a general conclusion can be drawn. The Homeric Epics include scientific and technological knowledge so vast and so diverse that it must be studied by specialists from as many disciplines as possible and also that this search must continue along with progressing science in our time, which will allow for increasingly deeper understanding of the great achievements of Greek Prehistory.\nProduct Details\n\n    * Hardcover: 220 pages\n    * Publisher: Springer; 1st Edition. edition (June 15, 2010)\n    * Language: English\n    * ISBN-10: 9048125138\n    * ISBN-13: 978-9048125135","torrent":{"xt":"urn:btih:73f59c28aea2f5aebfd46cf10e08f72b27941173","amp;dn":"The+Unknown+Technology+in+Homer%2C+1st+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73f59c28aea2f5aebfd46cf10e08f72b27941173","infoHashBuffer":{"type":"Buffer","data":[115,245,156,40,174,162,245,174,191,212,108,241,14,8,247,43,39,148,17,115]},"announce":[],"urlList":[]}}