{"title":"De Bijbel Salomo DVD NL (dvd5)(Nl subs) RETAIL TBS","uid":6746488,"size":4680846136,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7421b934367d0b4dea8105e9ed06f8aa80012444&amp;dn=De+Bijbel+Salomo+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sammynet","files":21,"time":1318710650,"description":"De Bijbel: Salomo\n\nNederlands\nSalomo, koning der wijsheid. Kort voor de dood van Koning David ontstaat er grote onenigheid over wie hem moet opvolgen. De lievelingszoon van David, Salomo, slaagt erin zijn oudere broer te verslaan en wordt tot koning van Israel uitgeroepen. Salomo wordt beroemd om zijn wijsheid, gevoel voor rechtvaardigheid en liefde voor vrede. Onder de mensen die de prachtige stad Jeruzalem met haar tempel bezoeken, bevindt zich de koningin van Sheba, wier schoonheid Salomo niet kan weerstaan. Het indrukwekkende hof van de koning bestaat uit talrijke vrouwen en bijvrouwen, die veelal uit het buitenland komen. Zij brengen verschillende godsdienstige gebruiken met zich mee. De priesters verzetten zich tegen deze buitenlandse invloeden, echter zonder succes. Tot het moment dat het volk van Israel zich hier tegen begint te verzetten. Naarmate Salomo ouder en zwaarmoediger wordt, vlucht hij in zijn eigen wereld, terwijl zijn koninkrijk dreigt in te storten. Na zijn dood scheiden de stammen van Israel zich af en Salomos zoon erft slechts het koninkrijk Juda.\n\nEngels\nDavid, now an old man, is still king of Israel. Among his sons, the ambitious Adonijah and the clever Solomon. The two young men are fierce rivals, since both are prospective heirs to the throne and only one can be successful. During a hunting expedition, Adonijah challenges his younger brother Solomon to a chariot race. While Solomon, though brave, still retains a modicum of caution, the daredevil Adonijah is eager to win at all costs -- and loses control of his chariot. Solomon takes the seriously injured Adonijah back to Jerusalem. On the way there they meet the attractive Abishag, who despite her youth is versed in the use of healing herbs. She actually succeeds in helping the prince. Adonijah falls in love with Abishag -- but Bathsheba arranges things so that she works for David, hoping that her youth, her beauty and her healing powers will soothe the old king's suffering. Several members of the influential priesthood and also the respected army general Joab\n\nFilm informatie\nDuur \t        : \t170 min\nMedia \t        : \tDVD\nTaal \t        : \tEngels\nOndertitels \t: \tNederland","torrent":{"xt":"urn:btih:7421b934367d0b4dea8105e9ed06f8aa80012444","amp;dn":"De+Bijbel+Salomo+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7421b934367d0b4dea8105e9ed06f8aa80012444","infoHashBuffer":{"type":"Buffer","data":[116,33,185,52,54,125,11,77,234,129,5,233,237,6,248,170,128,1,36,68]},"announce":[],"urlList":[]}}