{"title":"Taylor Stevens - The Informationist","uid":6706218,"size":355036154,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7559a3a068b59384afc6ac2a1bf433b61852fee3&amp;dn=Taylor+Stevens+-+The+Informationist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SFaudio","files":108,"time":1317175054,"description":"The Informationist by Taylor Stevens\nRead by Hillary Huber\n\nUnabridged\n12 hours 18 minutes\n64 kbps mono mp3\n\nVanessa Michael Munroe deals in information - expensive information - working for corporations, heads of state, private clients, and anyone else who can pay for her unique brand of expertise. Born to missionary parents in lawless central Africa, Munroe took up with an infamous gunrunner and his mercenary crew when she was just fourteen. As his protege she earned the respect of the jungle's most dangerous men, cultivating her own reputation for years until something sent her running. \n\nAfter almost a decade building a new life and lucrative career from her home base in Dallas, she's never looked back.\n\nUntil now. \n\nA Texas oil billionaire has hired her to find his daughter who vanished in Africa four years ago. It's not her usual line of work, but she can't resist the challenge. Pulled deep into the mystery of the missing girl, Munroe finds herself back in the lands of her childhood, betrayed, cut off from civilization, and left for dead. If she has any hope of escaping the jungle and the demons that drive her, she must come face-to-face with the past that she's tried fo so long to forget.\n\nGripping, ingenious, and impeccably paced, The Informationist marks the arrival or a thrilling new talent.","torrent":{"xt":"urn:btih:7559a3a068b59384afc6ac2a1bf433b61852fee3","amp;dn":"Taylor+Stevens+-+The+Informationist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7559a3a068b59384afc6ac2a1bf433b61852fee3","infoHashBuffer":{"type":"Buffer","data":[117,89,163,160,104,181,147,132,175,198,172,42,27,244,51,182,24,82,254,227]},"announce":[],"urlList":[]}}