{"title":"Hoe verandert Internet je manier van denken (E-Book)NLT-Release","uid":6831409,"size":1237092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:75e8445a3439b611d638ba60e4e96e2ab1aff946&amp;dn=Hoe+verandert+Internet+je+manier+van+denken+%28E-Book%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"linday1","files":-1,"time":1321885215,"description":"\nHoe verandert internet je manier van denken (E-Book)NLT-Release\n\n\nBeschrijving\n Edge.org stelt jaarlijks een vraag aan een selectie van de meest interessante wetenschappers en kunstenaars ter wereld. Dit jaar geven 151 denkers, waaronder Richard Dawkins, Nassim N. Taleb, Brian Eno en Steven Pinker, kort en krachtig antwoord op een van de meest interessante vraagstukken van deze tijd: Hoe verandert internet je manier van denken?\n \n\nRecensie(s)\nNBD|Biblion recensie\n Sinds 1988 houdt de Edge Foundation zich bezig met het propageren van een 'derde cultuur' (een term die verwijst naar 'Two Cultures' van C.P. Snow, de alfa's en de beta's). Onder 'derde cultuur' wordt daarbij verstaan het werk van intellectuelen die kritische vragen stellen, op een manier die niet alleen henzelf maar ook het grote publiek aan het denken zet. Een van de activiteiten van Edge is het jaarlijks voorleggen van een prikkelende vraag aan topwetenschappers en andere intellectuelen, en het in boekvorm publiceren van hun antwoorden. De vraag van 2010 was: 'Hoe verandert internet je manier van denken?' 151 denkers, meest wetenschappers, geven in een paar bladzijden een hoogst persoonlijk antwoord op die vraag. Doordat elke vorm van discussie ontbreekt, zeggen deze stukjes vaak meer over de schrijver dan over het thema. En juist dat maakt ze interessant, want het gaat om grote namen. Al moet de lezer wel zoeken, want de stukjes staan niet op alfabet volgens de naam van de auteur en een index ontbreekt. Wel vermeldt elk stukje minimale biografische gegevens.\n \n(NBD|Biblion recensie, Dr. D.G. van der Steen) \n\nHashcode:\n75E8445A3439B611D638BA60E4E96E2AB1AFF946\n\n\nNLT-RELEASE IS TERUG KOM SNEL NAAR DE SITE:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\nBy Linday ","torrent":{"xt":"urn:btih:75e8445a3439b611d638ba60e4e96e2ab1aff946","amp;dn":"Hoe+verandert+Internet+je+manier+van+denken+%28E-Book%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75e8445a3439b611d638ba60e4e96e2ab1aff946","infoHashBuffer":{"type":"Buffer","data":[117,232,68,90,52,57,182,17,214,56,186,96,228,233,110,42,177,175,249,70]},"announce":[],"urlList":[]}}