{"title":"Kiss Kiss Bang Bang.mp4","uid":6691854,"size":1513662205,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:76b9291c16878c03adaa890fa86540faea8a6f59&amp;dn=Kiss+Kiss+Bang+Bang.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"UKDAD640","files":1,"time":1316619635,"description":"Kiss Kiss Bang Bang (2000) \n\nA UK indie feature film. \n\nDuration: 80 \n\nGenre: Black Comedy\n\nRichard, a science-fiction writer, works from home. Gradually he becomes obsessed with his beautiful new neighbour, a woman called Angelica. Richard moves from normal desire to becoming psychologically unbalanced, when he begins to regulate his life to observe her. He starts to photograph her, soon he begins to follow her. Through deceit and lies, he manages to get close to her flat-mate and through her to Angelica herself. Richard is utterly ruthless in the pursuit of his obsession, eventually leading to triple murder. A twisted and incredible tale of suburban madness and infatuation with the girl next door.\n\nUK cert: 15\n\nUK independent feature film\n\nImdb.com rating : 6.7\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0173568/combined&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0173568/combined&lt;/a&gt;\n\n\nTop three Imdb user reviews below:\n\n\nFar-out-there humour, 24 July 2003\n \nAuthor: Phil Nevelle from Leeds, England\nKiss Kiss Bang Bang is a very strange movie, it kicks off lick a romantic comedy from the fifties, moves swiftly into serial killer territory, bounces between farce and surreality, to land in gritty noir murder and black comedy. I can say quite seriously I never really new what was coming next, eclectic and sublime! Ten outta Ten.\n\n\nWhat a great crazy movie!, 30 August 2002\n \nAuthor: judassnoop from England\nPicked up this recent DVD release on a friend's recommendation. She was write it's very funny, a bit surreal with a great sound track. The story is nothing other than metal, a truly distinctive mind at work here. The film is vibrantly colourful and the characters though simple are well played and thought out. Particularily liked the Hitman character, very scary, very twisted. Hollywood would never fund a film like this. More the pity because it's funky and very original. Rent it, buy it, watch it. Your going to love it. In a word unforgetable!\n5 out of 5 people found the following review useful:\n\n\n\nSilly fun and disturbing, 14 May 2004\n \nAuthor: Olivier Bislint from Dublin, Ireland\nKiss kiss bang bang is silly fun and disturbing, bouncing between quirky humour and playful perveness. Set in some yuppie enclave in suburban London (Clapham?). Several warped and clueless twenty something characters go about their individual pointless lives blissfully unaware that a wolf in sheep's clothing now lives amongst them. When the scheming Machiavellian type gets jealous, mayhem, rape and multiple murders ensue as a psycho takes out and seduces the locals. Very strange but memorable soundtrack, some good twists and very funny banter, with a very memorable if sometimes inaudible hit man raises this well above your average tele-movie of the week. A must for all Russ Meyer fans!\n\nTags: Sexy, mysterious, murder, mystery, black comedy, UK indie, feature film, feature, comedy, Russ Meyer\n","torrent":{"xt":"urn:btih:76b9291c16878c03adaa890fa86540faea8a6f59","amp;dn":"Kiss+Kiss+Bang+Bang.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76b9291c16878c03adaa890fa86540faea8a6f59","infoHashBuffer":{"type":"Buffer","data":[118,185,41,28,22,135,140,3,173,170,137,15,168,101,64,250,234,138,111,89]},"announce":[],"urlList":[]}}