{"title":"The Mark Twain Audiobook Collection","uid":6710357,"size":10155024420,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:77112ac8fe54494b8e6bafb53f88c6b989602e37&amp;dn=The+Mark+Twain+Audiobook+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neil1966hardy","files":1010,"time":1317330348,"description":"-------------Massively Exhaustive Mark Twain Collection-------------\nThus far I've released many torrent collections that are, to various degrees, complete. However, as I started to work on older authors I found that the real diversity is in all the different versions that exist. Therefore, this is my fourth try at an EXHAUSTIVE collection, as opposed to a complete one.\n\n1. Ripped and checked for completeness. All 40+ books and short stories were ripped by me from CDs over many months.\n\n2. FULLY CHAPTERIZED. This also took months. Each audio book was compiled into a single file (deleting bits like &quot;this concludes disc 2, please insert disc 3&quot;) and then separated into Parts and Chapters as defined by the original books. I find this to be the best way to enjoy audiobooks and it is perfect for iPods.\n\n3. Dehissed and noise-cleaned. When needed, I performed low pass filters and deleted pops in the audio.\n\n4. Encoded all books to a uniform MP3 96kbps 44.1kHz.\n\n5. ID3 Tagged. All audio book files have been fully ID3 tagged including full COVER ART.\n\nAnd so I present this 9gb+ torrent of Twain goodness. I have included every single version of every single Mark Twain unabridged audiobook I could find in high quality spanning over 80 libraries. This torrent was a labor of love and took many weeks of preparation so I hope people will be excited to hear these classics read by such excellent and diverse readers. This is the fourth of several massively exhaustive torrents that I intend to upload.\n\nI consider this torrent to be celebration not only of the Mark Twain, but of many of the best audiobook narrators in the world.\n\nPlease leave any comments, questions, or suggestions you might have as they are HIGHLY APPRECIATED! :)\n\nEnjoy!\n--CL8\n\n-------------Included in this torrent-------------\n\nShort Stories and Novellas:\n18xx - The Joke That Made Ed's Fortune (read by Jonathan Kent)\n18xx - The Story of the Old Ram (read by Thomas Becker)\n18xx - Tom Quartz (read by Thomas Becker)\n1865 - The Notorious Jumping Frog of Calaveras County (read by Jonathan Kent)\n1865 - The Notorious Jumping Frog of Calaveras County (read by Thomas Becker)\n1868 - Cannibalism in the Cars (read by Thomas Becker)\n1870 - The Facts in the Great Beef Contract (read by Thomas Becker)\n1871 - Journalism in Tennessee (read by Thomas Becker)\n1875 - The Story of the Bad Little Boy (read by Jonathan Kent)\n1876 - A Murder, a Mystery, and a Marriage (read by Garrison Keillor)\n1876 - Punch, Brothers, Punch (read by Thomas Becker)\n1880 - Edward Mills and George Benton (read by Jonathan Kent)\n1880 - What Stumped the Bluejays (read by Thomas Becker)\n1899 - The Man that Corrupted Hadleyburg (read by Jonathan Kent)\n1902 - A Double-Barreled Detective Story (read by Thomas Becker)\n1906 - The Diary of Adam &amp; Eve (read by Jonathan Kent)\n1916 - A Fable (read by Jonathan Kent)\n1916 - The McWilliamses and the Burglar Alarm (read by Thomas Becker)\n1916 - The McWilliamses with Membranous Croup (read by Thomas Becker)\n1916 - The Mysterious Stranger (read by Jonathan Kent)\n\nNovels:\n1872 - Roughing It (read by Norman Dietz)\n1876 - The Adventures of Tom Sawyer (read by Dick Hill)\n1876 - The Adventures of Tom Sawyer (read by Grover Gardner)\n1876 - The Adventures of Tom Sawyer (read by Norman Dietz)\n1876 - The Adventures of Tom Sawyer (read by Pat Bottino)\n1876 - The Adventures of Tom Sawyer (read by Patrick Fraley)\n1882 - The Prince and the Pauper (read by Norman Dietz)\n1883 - Life on the Mississippi (read by Norman Dietz)\n1884 - The Adventures of Huckleberry Finn (read by Dick Hill)\n1884 - The Adventures of Huckleberry Finn (read by Garrick Hagon)\n1884 - The Adventures of Huckleberry Finn (read by Michael Prichard)\n1884 - The Adventures of Huckleberry Finn (read by Norman Dietz)\n1884 - The Adventures of Huckleberry Finn (read by Patrick Fraley)\n1884 - The Adventures of Huckleberry Finn (read by Thomas Becker)\n1884 - The Adventures of Huckleberry Finn (read by Tom Parker)\n1884 - The Adventures of Huckleberry Finn (read by William Dufris)\n1889 - A Connecticut Yankee in King Arthur's Court (read by Norman Dietz)\n1889 - A Connecticut Yankee in King Arthur's Court (read by Stuart Langton)\n1894 - The Tragedy of Pudd'nhead Wilson (read by a Full Cast)\n1894 - The Tragedy of Pudd'nhead Wilson (read by Michael Prichard)\n1894 - The Tragedy of Pudd'nhead Wilson (read by Norman Dietz)\n1894 - Tom Sawyer Abroad (read by Grover Gardner)\n1910 - Huck Finn and Tom Sawyer Among the Indians (read by Grover Gardner)\n\nPLUS a huge collection of Mark Twain eBooks.","torrent":{"xt":"urn:btih:77112ac8fe54494b8e6bafb53f88c6b989602e37","amp;dn":"The+Mark+Twain+Audiobook+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77112ac8fe54494b8e6bafb53f88c6b989602e37","infoHashBuffer":{"type":"Buffer","data":[119,17,42,200,254,84,73,75,142,107,175,181,63,136,198,185,137,96,46,55]},"announce":[],"urlList":[]}}