{"title":"Coast To Coast AM 09.26.11 Climate Change &amp; Alien Encounters","uid":6705267,"size":54821287,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:77116b1f572c9d7a58549c155f36673cecd703b9&amp;dn=Coast+To+Coast+AM+09.26.11+Climate+Change+%26amp%3B+Alien+Encounters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"1337bits","files":1,"time":1317084704,"description":"Date:\t09-26-11\nHost:\tGeorge Noory\n\nGuests:\tWhitley Strieber, Rochelle Sparrow, Cortney Kane\n\n\nAuthor and novelist Whitley Strieber discussed disruptive climate and solar patterns, as well as reflected on UFOs, and enigmas associated with alien/&quot;visitor&quot; encounters. The Arctic summer has been very intense, and we lost more ice in the summer of 2011 than we ever have in history, he reported. The way climate change occurs on Earth is that there are disruptions over a period of time in a &quot;slowly escalating kind of vortex, and suddenly there's a snap back to a completely different climate,&quot; he said, adding that he believes we could be near a snap back period now.\n\nNormally a low pressure area settles in over the Arctic in the winter and this pushes moist, cold air into the central part of the continent. However, this time the polar vortex was a high pressure system, which led to bizarre colliding storms, and mountains of snow, he detailed. Citing the book The Cycle of Cosmic Catastrophes, Strieber talked about the possibility that debris from a supernova came toward Earth around 13,000 years ago and caused massive flooding. He also noted that the sun is going into a less active phase 10 years from now, and this may help reduce dramatic climate change.\n\nOne of the intriguing findings that Whitley and his wife Anne discovered about people's experiences with the aliens or &quot;Grays&quot; was that they would sometimes see dead friends or relatives in the context of their encounters. &quot;There is something unfolding here that we are just at the edge of understanding,&quot; he commented. For more of his thoughts on the visitor phenomenon, see his latest journal entry, What if They Land?\n\nMind &amp; Energy\nFirst hour guests, channelers Rochelle Sparrow and Cortney Kane talked about the nature of the mind and unconscious energy. Through self-awareness and meditation we can claim more of our unconscious energy, as well develop our own ability to heal, they said.\n\nNews segment guests: Leo Laporte, Richard C. Hoagland","torrent":{"xt":"urn:btih:77116b1f572c9d7a58549c155f36673cecd703b9","amp;dn":"Coast+To+Coast+AM+09.26.11+Climate+Change+%26amp%3B+Alien+Encounters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77116b1f572c9d7a58549c155f36673cecd703b9","infoHashBuffer":{"type":"Buffer","data":[119,17,107,31,87,44,157,122,88,84,156,21,95,54,103,60,236,215,3,185]},"announce":[],"urlList":[]}}