{"title":"Democracy Now - 03 oct 2011","uid":6718075,"size":457147397,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7732dc957b490ead46c4cf13abe54c39b691f9f0&amp;dn=Democracy+Now+-+03+oct+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1317662038,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 03, 2011\n\n- International Protests Erupt in Portugal, Greece, England\n- U.S. Confirms Death Of Second U.S. Citizen In Yemen Drone Strike\n- Afghan President Karzai Suspends Talks With Taliban\n- Libya: Shelling Prevents Red Cross Convoy In Besieged Town Of Sirte\n- Thousands Attend Funeral For Executed Death Row Prisoner Troy Davis\n- Koch Brothers Exposed For Trading With Iran, Bribing Overseas Officials\n- Rick Perry Under Fire For Racially Offensive Hunting Camp Name\n- Virginia Nuclear Reactors Remain Shut Down More Than Five Weeks After Earthquake\n- Jewish Settlers Blamed For Burning Israeli Mosque, U.S. Lawmakers Freeze $200 Million In Aid To Palestine\n- Government Probe Confirms Major New York Public School Corruption Scandal \n- NYPD Arrests Over 700 on Brooklyn Bridge in Ongoing Occupy Wall Street Protest \n\n\nSpecial reports\n\n- Settlement Reached Over Arrest of Amy Goodman, Democracy Now! Producers at 2008 GOP Convention\n\nA final settlement has been reached in a federal lawsuit challenging the police crackdown on journalists reporting on the 2008 Republican National Convention and protests in St. Paul, Minnesota. Democracy Now! host and executive producer Amy Goodman, along with former producers Nicole Salazar, Sharif Abdel Kouddous, filed the lawsuit last year against the Minneapolis and St. Paul police departments, the Ramsey County Sheriff and United States Secret Service personnel. The lawsuit challenged the policies and conduct of law enforcement during the 2008 RNC that resulted in their arrests. They were among dozens of journalists arrested that week in St. Paul. The settlement includes $100,000 in compensation paid by the St. Paul and Minneapolis police departments and the Secret Service. The settlement also includes an agreement by the St. Paul police department to implement a training program aimed at educating officers regarding the First Amendment rights of the press and public with respect to police operations, including proper procedures for dealing with the press covering demonstrations.\n\n\n- 700 Arrested on Brooklyn Bridge as Occupy Wall Street Enters Third Week, Protests Grows Nationwide\n\nThe &quot;Occupy Wall Street&quot; protests in the financial district took a dramatic turn on Saturday when protesters tried to march across the Brooklyn Bridge. When police arrested 700 of the demonstrators, the event quickly turned into one of the largest arrests of non-violent protesters in recent history. Some protesters claim police lured them onto oncoming traffic on the bridges roadway; others said they did not hear instructions from police telling them to use the pedestrian walkway. Meanwhile, similar &quot;Occupation&quot; protests have spread to other cities, including Chicago, Boston and Los Angeles, where hundreds of protesters are now camped out in front of City Hall. We host a roundtable discussion with Marisa Holmes, an organizer with the main organizing group of Occupy Wall Street, called the General Assembly, Marina Sitrin, an attorney who is part of Occupy Wall Street's legal working group, and Laurie Penny, a writer and journalist who reported on protests in London earlier this summer.\n\n\n- Mourners Call For Abolishing Death Penalty at Funeral for Troy Davis in Georgia\n\nThis weekend in Savannah, Georgia, Troy Anthony Davis was laid to rest. Davis was killed by lethal injection in Jackson, Georgia on Sept. 21 after the U.S. Supreme Court refused to stop his execution. The 2,000-seat Jonesville Baptist Church was filled to capacity for his funeral. While his body was being lowered into the burial ground, 23 doves were released. The first was symbolic of his spirit, and the remaining 22 represented each year Davis spent in prison. He was convicted of the 1989 killing of an off-duty police officer, Mark MacPhail. Since then, seven of the nine witnesses have recanted their testimony, and there was no physical evidence that tied Davis to the crime scene. Democracy Now! was in Savannah for the funeral and we play excerpts from the eulogies by Jason Ewart, Troy Davis's attorney and an eyewitness to his execution; Ben Jealous, president of the NAACP; Larry Cox, president of Amnesty International USA; Lou DuBose, president of NAACP-Georgia; Lenda Sullivan-Russell, friend of Troy Davis; Rev. Raphael Warnock, pastor of Ebenezer Baptist Church; Antone' De'Juan Davis-Correia, nephew of Troy Davis.\n\n\n- Legendary Comedian Dick Gregory On Hunger Strike To Protest Capital Punishment, Death of Troy Davis\n\nCivil rights activist and comedian Dick Gregory was among the people who filled the 2,000-capacity Jonesville Baptist Church that hosted Troy Davis' funeral on Saturday in Savannah, Georgia. Afterward, he told Democracy Now! he was starting a year-long hunger strike that night to protest against the death penalty. &quot;I will not be eating solid food until next fall,&quot; Gregory says. He called on others to pray and meditate that &quot;the truth will come out&quot; in Davis' conviction for the 1989 killing of off-duty police officer, Mark MacPhail - a crime which Davis has always maintained he did not commit.\n\n\n- Martina Correia, Sister of Troy Davis, Vows to Keep Fighting Death Penalty\n\nAfter the funeral on Saturday of Troy Anthony Davis, executed by the state of Georgia on Sept. 21, we spoke with his sister, Martina Correia. She fought for her brothers life, at the same time she fought for her own as she battled breast cancer. &quot;I know we will be able to abolish the death penalty. Everyone is asking the question, why kill when there is doubt? We are no longer going to except that,&quot; Correia says.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7732dc957b490ead46c4cf13abe54c39b691f9f0","amp;dn":"Democracy+Now+-+03+oct+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7732dc957b490ead46c4cf13abe54c39b691f9f0","infoHashBuffer":{"type":"Buffer","data":[119,50,220,149,123,73,14,173,70,196,207,19,171,229,76,57,182,145,249,240]},"announce":[],"urlList":[]}}