{"title":"NBA.1989.Playoffs.(23 may).G2.ECF.CHI.Bulls.vs.DET.Pistons","uid":6753162,"size":725682176,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7784fcd5b2592a0fcfc991184c01b0366a7ff24b&amp;dn=NBA.1989.Playoffs.%2823+may%29.G2.ECF.CHI.Bulls.vs.DET.Pistons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nepotu","files":1,"time":1318942843,"description":"NBA 1989 Playoffs - Eastern Conference Finals\n\nGame 2 - (1989.05.23):\n\n\nCHICAGO Bulls (6) vs. DETROIT Pistons (1)\n\n\nThe rip is from TBS Sports (USA)\n\nVideo format: 336p\n\nRosters:\n--------\nCHI Bulls: 24. Bill Cartwright, 40. Dave Corzine, 22. Charles Davis, 54. Horace Grant, 15. Jack Haley, 14. Craig Hodges, 22. Anthony Jones, 23. Michael Jordan, 45. Ed Nealy, 5. John Paxson, 32. Will Perdue, 33. Scottie Pippen, 12. Dominic Pressley, 6. Brad Sellers, 11. Sam Vincent, 34. David Wood, Coach: Doug Collins\n\nDET Pistons: 23. Mark Aguirre, 45. Adrian Dantley, 50. Darryl Dawkins, 34. Fennis Dembo, 4. Joe Dumars, 53. James Edwards, 35. Steve Harris, 15. Vinnie Johnson, 40. Bill Laimbeer, 25. John Long, 44. Rick Mahorn, 12. Pace Mannion, 10. Dennis Rodman, 41. Jim Rowinski, 22. John Salley, 11. Isiah Thomas, 24. Micheal Williams, Coach: Chuck Daly\n\n\nA little bit of All Star Games history:\n\nAll Star Game 1961 (17 january) - no video\n-------------------------------\nSYRACUSE - Onondaga County War Memorial Coliseum (New York)\n\nEast - West 131-153 (19-47, 43-37, 35-31, 34-38)\n       ----\n\nEast: Wilt Chamberlain (PHILADELPHIA Warriors-2), Bob Cousy (BOSTON Celtics-11), Bill Russell (BOS-4), Dolph Schayes (SYRACUSE Nationals-11), Tom Gola (PHW-2), Tom Heinsohn (BOS-2), Hal Greer (SYR-1), Paul Arizin (PHW-9), Willie Naulls (NEW YORK Knicks-3), Richie Guerin (NYK-4), Larry Costello (SYR-4), Coach: Red Auerbach (BOS)\n\nWest: Oscar Robertson (CINCINNATI Royals-1), Bob Petit (ST. LOUIS Hawks-7), Clyde Lovellette (STL-4), Elgin Baylor (LOS ANGELES Lakers-3), Jerry West (LAL-1), Gene Shue (DETROIT Pistons-4), Walter Dukes (DET-2), Bailey Howell (DET-1), Hot Rod Hundley (LAL-2), Cliff Hagan (STL-4), Wayne Embry (CIN-1), Coach: Paul Seymour (STL)\n\nMVP ASG: Oscar Robertson (CIN)\n\n\n\nAFTER DOWNLOAD, PLEASE SEED!!! FOR ALL'S BENEFITS!\t\t","torrent":{"xt":"urn:btih:7784fcd5b2592a0fcfc991184c01b0366a7ff24b","amp;dn":"NBA.1989.Playoffs.%2823+may%29.G2.ECF.CHI.Bulls.vs.DET.Pistons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7784fcd5b2592a0fcfc991184c01b0366a7ff24b","infoHashBuffer":{"type":"Buffer","data":[119,132,252,213,178,89,42,15,207,201,145,24,76,1,176,54,106,127,242,75]},"announce":[],"urlList":[]}}