{"title":"Wii NBA 2K12 NTSC","uid":6719866,"size":3859196220,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:78bbc54142976202f00239e9a68188b1b10ca15f&amp;dn=Wii+NBA+2K12+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fairwaybaby","files":-1,"time":1317752184,"description":"With over 5 million copies sold worldwide and over 20 Sports Game of Year awards, last year NBA 2K11 allowed you to BECOME THE GREATEST with MJ &amp; the Jordan Challenge mode. This year the NBA 2K franchise is back and bigger than ever, providing fans with the opportunity they\\\\\\'ve always dreamed of - to finally END THE DEBATE as to who are the best teams and players of all time with the ALL-NEW NBA\\\\\\'s Greatest mode. Featuring 15 legendary players such as Michael Jordan, Magic Johnson, Larry Bird, Kareem Abdul-Jabbar, and Dr. J, NBA\\\\\\'s Greatest let you relive some of NBA\\\\\\'s most celebrated careers and rivalries, painstakingly recreated in historical detail. In addition, several innovative gameplay features have been added putting fans center court of an unprecedented basketball experience.\n\n    NEW Legendary NBA Teams - Play with some of the greatest NBA teams of all time such as the \\\\\\'96 Bulls, \\\\\\'65 Celtics,\\\\\\'91 Lakers and more, each with accurate historical player rosters.\n    All-New Tutorial Mode - A completely redesigned Tutorial mode guides players through the Wii control mechanics and teaches them tips on how to dominate their opponents. With three different difficulty settings, users of all skill level can test their abilities, but only the best will be able to rise up and meet the challenge of mastering the advanced controls.\n    Updated Rosters - All of the latest transactions from the 2010-2011 season have been incorporated meaning, you will be playing with current teams and ratings.\n    Revamped Stat Presentation System - Quick and easy to read rating &amp; stat information allows you to effortlessly get only the top line data you care about.\n\n\n\nGame tested and works with wii systems softmodded-or hardmodded. \n\nEnjoy game and please remember to seed!!!","torrent":{"xt":"urn:btih:78bbc54142976202f00239e9a68188b1b10ca15f","amp;dn":"Wii+NBA+2K12+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78bbc54142976202f00239e9a68188b1b10ca15f","infoHashBuffer":{"type":"Buffer","data":[120,187,197,65,66,151,98,2,240,2,57,233,166,129,136,177,177,12,161,95]},"announce":[],"urlList":[]}}