{"title":"Ella Fitzgerald - Whisper Not (2002 Remaster) (FLAC)","uid":6756327,"size":250207399,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:78ce348a187e48069f5f72c94b01510c72ff921d&amp;dn=Ella+Fitzgerald+-+Whisper+Not+%282002+Remaster%29+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"tiddler22","files":16,"time":1319045261,"description":"\n\nReview by Ronnie D. Lankford, Jr. (AMG)\n\nWhoever decided to put pianist Marty Paich and Ella Fitzgerald together in the studio in 1966 deserves a bit of credit for the great music on Whisper Not. Together, Fitzgerald and Paich deliver a dozen beautifully sung, carefully arranged standards. An orchestra tastefully backs Fitzgerald's vocals, offering cushy support without overdoing it. Even lighter pieces like &quot;Sweet Georgia Brown&quot; and &quot;Old MacDonald&quot; are given stately renditions. There's a fun version of &quot;I Said No,&quot; filled with silly double entendres, and a relaxed take on &quot;Thanks for the Memory.&quot; Norman Granz takes full advantage of stereo capabilities, creatively mixing the instruments to the right and left tracks while leaving Fitzgerald's voice front and center. Paich adds to the overall sound quality by varying the arrangements from song to song, carefully wrapping each tune in the right package. These fine-tuned arrangements also provide the perfect launching pad for Fitzgerald to place her own stamp on material associated with other singers. While both &quot;Lover Man (Oh Where Can You Be)&quot; and &quot;You've Changed&quot; will be recognized as Billie Holiday classics, Fitzgerald delivers light, elegant versions that are distinctly her own. Whisper Not captures two intelligent artists working toward a common goal and creating beautiful music in the process. \n\n01. Sweet Georgia Brown \n02. Whisper Not   \n03. I Said No   \n04. Thanks For The Memory   \n05. Spring Can Really Hang You Up The Most  \n06. Old MacDonald   \n07. Time After Time  \n08. You've Changed \n09. I've Got Your Number  \n10. Lover Man (Oh Where Can You Be)   \n11. Wives And Lovers  \n12. Matchmaker \n\n\n","torrent":{"xt":"urn:btih:78ce348a187e48069f5f72c94b01510c72ff921d","amp;dn":"Ella+Fitzgerald+-+Whisper+Not+%282002+Remaster%29+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78ce348a187e48069f5f72c94b01510c72ff921d","infoHashBuffer":{"type":"Buffer","data":[120,206,52,138,24,126,72,6,159,95,114,201,75,1,81,12,114,255,146,29]},"announce":[],"urlList":[]}}