{"title":"Lion King 3-D Anaglyph","uid":6742087,"size":3766028288,"categoryP":"video","categoryS":"3d","magnet":"?xt=urn:btih:79c49727536398a603c15b38e6e2791a6f6d7029&amp;dn=Lion+King+3-D+Anaglyph&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"frankiep626","files":14,"time":1318546048,"description":"This was the T00NG0D Anaglyph Print, that was like a 952 MB file.  The first thing that I did was Upscale this Print to 720p so that the viewing experience would be clearer than what it was. T00NG0D's Print was GREAT, I was just trying to build on what was already there, if ya know what I mean. My Software that I work with only enables me to add a 2 channel Stereo Soundtrack.  T00NG0D had a 5.1 Dolbly Digital Soundtrack.  So, I stripped that off and saved it.  I Muted my Print and added theirs later, because it was flawless.  But, it required syncing, which was a &quot;little&quot; tricky.  But, I did it.  \n\nAfter my upscaling, the Print itself was pretty much flawless, so-to-speak, if I do say so myself.  But, I did tweak it a little bit more, like always, by running it through a Brighness Filter.  I did this because when viewing 3-D prints, we have to add glasses, and that darkens the print, when viewing it.  I figured that by adding some brightness to it, that it would enhance the viewing experience.  Personally, I like it.  Please note: It takes Red and Blue glasses to view this print (Or Red and Cyan, if ya wanna be technical about it LOL).\n\nAlso, as always, I placed Chapter Marks in place.\n\nAfter Downloading this file, simply use your DVD file burning software (i.e. Nero Burning ROM) to burn to a DVD to view this on any player.\n\nThanks to T00NG0D for supplying the initial source for me to work with.  I believe in giving Credit where Credit is due.  That's good Karma.  \n\nENJOY!","torrent":{"xt":"urn:btih:79c49727536398a603c15b38e6e2791a6f6d7029","amp;dn":"Lion+King+3-D+Anaglyph","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79c49727536398a603c15b38e6e2791a6f6d7029","infoHashBuffer":{"type":"Buffer","data":[121,196,151,39,83,99,152,166,3,193,91,56,230,226,121,26,111,109,112,41]},"announce":[],"urlList":[]}}