{"title":"Zombie.Driver.Summer.of.Slaughter-TiNYiSO","uid":6768250,"size":944506257,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7a1462a4823196dee97bf45c201519079704bb05&amp;dn=Zombie.Driver.Summer.of.Slaughter-TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":".Dude.","files":-1,"time":1319476631,"description":"-=- Proudly Presents -=-\n\nZombie Driver: Summer of Slaughter (c) Exor Studios\n\nRelease On  : 24 October 2011        Disk Amount/Format : 1 CD ISO\nType of Game : Action                  Media Protection  : Steam\n\nRelease Information\n\nEver wanted to chill out on a warm sandy beach, with lush palm trees,\ncalming blue waves and a horde of brain hungry zombies? Here's your\nchance - Zombie Driver: Summer of Slaughter contains the new Paradise\nIsland Slaughter map\n\nFight your way through the streets of a zombie infested city to save the\nsurvivors of a disastrous chemical accident that changed most of the\ncity's population into mindless brain hungry monsters. Time is the enemy\nand your car is a weapon as you race through the streets smashing\neverything on your way including fences, phone booths, street lamps and\nhordes of zombies. If you get tired of rescuing people, take part in the\nBlood Race tournament. Chase other cars and take them down without mercy\non special racing tracks populated with the zombie horde. Earn loads of\ncash while you progress through the events, unlock new rides and purchase\nweapons of mass destruction to become the ultimate Blood Race leaderboard\nchampion. If the car chases and speed runs are not your thing, jump into\nthe Slaugher mode where your objective is to survive as long as possible\nwhile ramping up enormous kill combos and annihilating endless waves of\nzombies on specialy crafted arenas\n\nFeatures\n\nNEW Paradise Island Slaughter map\n\nNEW Blood Race mode with 30 unique events offering the best arcade racing\nexperience in 3 distinct game types\n\nRace - classic racing spiced up with guns and loads of zombies\nEliminator - take down as many vehicles as you can before the time runs\nout\n\nEndurance - there is a bomb on your car and its ticking. Race through\ncheckpoints, smash objects and kill zombies to extend your time\n\nSlaughter mode with 6 surival arenas featuring enourmous killing sprees\n\nStory mode with 17 missions, sub quests and bonus objectives in a huge,\nfree roaming city\n\n8 different cars ranging from a sports car to a school bus\n\n9 different upgrades for each car, which can transform even an innocent\nTaxi into a Chariot of Death\n\nAll cars can be mounted with miniguns, flamethrowers, rocket launchers or\neven dual railguns\n\nVicious zombie types including even zombie dogs\n\nAdvanced, dynamic combo system with tricks and hordes of zombies to try it\non\n\nPost your highscores to Facebook directly from the game\n\nBurn/mount, install, copy crack, play\n\nGreetz: LARGEiSO and MEDIUMiSO\n\n(C) E/dfs\n&quot; SIZE DOES NOT MATTER","torrent":{"xt":"urn:btih:7a1462a4823196dee97bf45c201519079704bb05","amp;dn":"Zombie.Driver.Summer.of.Slaughter-TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a1462a4823196dee97bf45c201519079704bb05","infoHashBuffer":{"type":"Buffer","data":[122,20,98,164,130,49,150,222,233,123,244,92,32,21,25,7,151,4,187,5]},"announce":[],"urlList":[]}}