{"title":"La Guerra de Hart[dvdrip][spanish]","uid":6691826,"size":733900800,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7af5c911f1f938767334962fe33fe41d75d1f42d&amp;dn=La+Guerra+de+Hart%5Bdvdrip%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Black1000","files":1,"time":1316617801,"description":"La Guerra de Hart\n\nAÃƒÂ±o: 2002.\n\nDuraciÃƒÂ³n: 125 min.\n\nReparto: Bruce Willis (Coronel William A. McNamara), Colin Farrell (Teniente Thoma W. Hart), Terrece Howard (Teniente Lincoln A. Scott), Cole Hauser (Sargento Vic W. Bedford), Marcel Iures (Coronel Werner Visser), Linus Roache (CapitÃƒÂ¡n Peter A. Ross), Vicellous Shannon (Teniente Lamar T. Archer), Maury Sterling (Dennis A. Gerber), Sam Jaeger (CapitÃƒÂ¡n R.G. Sisk), Rory Cochrane (Sargento Carl S. Webb), Sebastian Tillinger (Soldado Bert D. 'Moose' Codman), Rick Ravanello (Major Joe Clary).\n\nGÃƒÂ©nero: BÃƒÂ©lica\n\nSINOPSIS\n\nEl coronel William McNamara (Bruce Willis), cuarta generaciÃƒÂ³n de una familia de militares, estÃƒÂ¡ prisionero de los alemanes en un campo de concentraciÃƒÂ³n. Con todo, al ser el oficial americano de mayor rango en el campamento, ostenta el mando entre los ocupantes, y mantiene bien alto el sentido del honor en un lugar en el que el honor es algo fÃƒÂ¡cil de perder, al estar todos bajo el peligroso ojo que todo lo ve del coronel alemÃƒÂ¡n Werner Visser (Marcel Iures). Sin renunciar a su deber como soldado, McNamara estÃƒÂ¡ planeando algo sigilosamen-te, a la espera de que llegue el momento de volver a luchar contra su enemigo. Un asesinato acaecido en el campo le da la oportu-nidad de poner en marcha un plan un tanto arriesgado. Con una corte marcial para mantener ocupados a Visser y a los guardias germanos, McNamara orquesta un astuto plan para escapar y destruir un polvorÃƒÂ­n cercano, con la involuntaria ayuda del joven teniente Tommy Hart (Colin Farrell). Junto a sus hombres, McNamara emplea la audacia de un hÃƒÂ©roe para llevar a cabo su misiÃƒÂ³n, obligado al final a tener que elegir entre lo que vale su propia vida y lo que es bueno para sus hombres y su paÃƒÂ­s.\n","torrent":{"xt":"urn:btih:7af5c911f1f938767334962fe33fe41d75d1f42d","amp;dn":"La+Guerra+de+Hart%5Bdvdrip%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7af5c911f1f938767334962fe33fe41d75d1f42d","infoHashBuffer":{"type":"Buffer","data":[122,245,201,17,241,249,56,118,115,52,150,47,227,63,228,29,117,209,244,45]},"announce":[],"urlList":[]}}