{"title":"The Powder Kegs...The Amanicans (2011)[FLAC]","uid":6767456,"size":238423837,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7b7163f53f1b94a29a49425a265c17489482746c&amp;dn=The+Powder+Kegs...The+Amanicans+%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":11,"time":1319451159,"description":" &lt;a href=&quot;http://image.allmusic.com/00/amg/cov200/drp900/p969/p96938pljhy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://image.allmusic.com/00/amg/cov200/drp900/p969/p96938pljhy.jpg&lt;/a&gt;\n\nThe Amanicans [2011]The Powder Kegs / 001\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n01. Hospital\n02. when the body tricks the mind\n03. Say You Love Me\n04. The Sea\n05. Wendy Is Water\n06. Broke Time\n07. Falling Together, Coming Apart\n08. The Amanicans\n\nThe Powder Kegs' latest album titled The Amanicans released this past March is very catchy -- especially the title track &quot;The Amanicans,&quot; as well as &quot;When the Body Tricks the Mind,&quot; however it is still not getting the attention that it deserves. Although the album did fairly well when it was first released, the band is still not being written about a lot, and from my knowledge, you can't find reviews on any of the popular music blogs. What their new album reveals is that they are really good musicians and instrumentalists, capable of successfully switching gears from one genre to an entirely new one with grace and musical intelligence. \n\nThe NYC born band includes members Ryan Dieringer, Daniel Maroti and Sam McDougle, and formed in 2005 originally starting out as an old-time string band, playing mostly folk, rockabilly music. Their first two albums Seedhouse and You and Your Right Now are folk albums with a heavy country influence. However, for their latest album The Amanicans produced by Jonathan Low, the band picked up an entirely new set of electric instruments and morphed their music to encompass a more pop, mainstream sound. Ryan switched over to the electric bass, Daniel picked up the electric guitar and Sam made the transition from fiddle to drums.\n\nTheir new sound carries a load of vim, especially their instrumental tangents. About half way through &quot;When the Body Tricks the Mind,&quot; Sam takes off with an awesomely long and raucous drum session, while Daniel plays an energetic, loud, guitar riff. Their musical technique is astounding, and they have a real understanding of their own musical boundaries. They have mastered the transition from folk to rock, having successfully maneuvered musical genres and at the same time preserving their original sound. Their music is thoughtful, well crafted, and multi-layered. Unlike many of the instrumental sections, the vocal parts remain consistently pretty mellow, with the same calm and at times slightly self-conscious sound. One of my favorite songs on the album titled &quot;Broke Down&quot; includes a vocal section that is very speaky and laid back, which acts as a nice juxtaposition to the more raucous instrumental accompaniment. The melody is also quite catchy.\n\nThe Powder Kegs didn't start off with this sound. They shifted from rockabilly to rock, just as Dylan did. In the summer of 1965 Bob Dylan was looking for a backup band for his first U.S. electric tour. He hired the Band, at the time known as the Hawks, to play with him from 1965-66 while he made his transition from country folk musician to full fledge rocker. Following their transition from country to rock, Dylan and the Band maintained their original country influence, allowing that twang to filter through their electric infused rock n roll. \n\nThe beginning of the title track &quot;The Amanicans&quot; sounds a bit Dylan-esq, with a dry slightly gravely voice slowly speaking the opening lyrics. One also hears a bit of Julian Casablancas (lead singer of the Strokes whose solo album Phrazes for the Young is one of the best albums of the year) in the new album, as well as a bit of Arcade Fire and Nick Drake. Interestingly enough Casablanca's title track on his new album is titled &quot;Out of the Blue,&quot; also the name of a famous song by The Band. While their new album clearly has a new, slightly tougher edge, at the same time they have preserved their more down to earth, small band, intimate sound that is very relatable. These guys could be your best friends playing in your garage. They sing about love, girls, heartbreak, the passage of time, and the issues that we all face as we are drawn into their swelling, bold musical lines. \n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2011/09/29/the-powder-kegs/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2011/09/29/the-powder-kegs/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:7b7163f53f1b94a29a49425a265c17489482746c","amp;dn":"The+Powder+Kegs...The+Amanicans+%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b7163f53f1b94a29a49425a265c17489482746c","infoHashBuffer":{"type":"Buffer","data":[123,113,99,245,63,27,148,162,154,73,66,90,38,92,23,72,148,130,116,108]},"announce":[],"urlList":[]}}