{"title":"Legendary Crooners (remastered) 320k 6CD+ (musicfromrizzo)","uid":6754375,"size":898435112,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7c2d1a454729e6d4e8aa84f606a7174f206695e5&amp;dn=Legendary+Crooners+%28remastered%29+320k+6CD%2B+%28musicfromrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"musicfromrizzo","files":-1,"time":1318988861,"description":"Legendary Crooners 6CD 320k remastered plus bonus tracks (musicfromrizzo)\n\nWe obtained this 6CD set around and found a similar offering posting\nalready on a torrent. What we did instead is to improve on the set with\nappropriate file naming conventions for ease of integrating into your existing\nlibraries, added mp3 tags and images as appropriate and even improved on some\nof the mp3 file versions with what we have in our library of the same title\nand artist.\n\nIn addition we have some great added bonus tracks - the intent being to give a\ngreat start into great music of old fashioned sensibilities to men and women who\nyearn for the sensibilities that once were taken for granted. That we cherished\nand protected our weak, our families and we showed genuine compassionate care\nand a passionate desire for what it is we call romantic love and meaningful\nintimacy. Music like this helps bring it all back so i ask you switch channels\nfrom whatever you are now involved with and help spread the joy with this\noffering instead! With thanks!\n\nWe have significant postings of Libraries already in place for Dean Martin\nPerry Como, Mario Lanza and Vic Damone through the 100 hits legends series,\nand we are doing the same with Bing Crosby soon although it will be even more\nlarge in size as much of his content is obscure on the net despite being great\nfor the maintenance and replenishment of the Irish spirit around the states\nespecially - hope you will join with us on that score equally.\n\nWe have a great offering too of Frank Sinatra here along with Duets specials.\nWe will have even more soon in certain. PS Vic Damone is not to be missed out on\nas well.\n\nThen again there are some other relatively obscure great talents that were\nonce big names in this business and they are in a separate folder with some\nof the best and most lovely sounds you could want to hear. How a bout a revival\nand a renaissance eh! it all starts here with your desire to improve our world\nto what it once used to be more of!\n\nThanks much indeed one and all!\n\n\nMichael Rizzo Chessman\nmusicfromrizzo\n\n\n320k remastered as indicated (some upgraded still)\n\n \nCD1 - Dean Martin\nDean Martin - 'a' You're Adorable (remastered)\nDean Martin - (Bonus track) Sway (Remastered)\nDean Martin - A Hot Time In The Town Of Berlin (remastered)\nDean Martin - Everybody Loves Somebody (remastered)\nDean Martin - Far Away Places (remastered)\nDean Martin - For Me And My Gal (remastered)\nDean Martin - Glow-Worm (remastered)\nDean Martin - How It Lies, How It Lies, How It Lies (remastered)\nDean Martin - I Don't See Me In Your Eyes Anymore (remastered)\nDean Martin - I Wonder Who's Kissing Her Now (remastered)\nDean Martin - Memory Lane (remastered)\nDean Martin - My Lady Loves To Dance (remastered)\nDean Martin - On A Slow Boat To China (remastered)\nDean Martin - September Song (remastered)\nDean Martin - Sweet Heart Of Sigma Chi (remastered)\nDean Martin - That Certain Party (With Jerry Lewis) (remastered)\nDean Martin - There's Yes Yes Yes In Your Eyes (remastered)\nDean Martin - Through A Long And Sleepless Night (remastered)\nDean Martin - Where Are You (remastered)\nDean Martin - You'de Be Surprised (remastered)\nDean Martin - You're So Understanding (remastered)\n\n \nCD2 - Bing Crosby\nBing Crosby - (bonus track) How Long Will It Last \nBing Crosby - A Fella With an Umbrella (remastered)\nBing Crosby - Alexanders Ragtime Band (remastered)\nBing Crosby - Blue Skies (remastered)\nBing Crosby - Don't Fence Me In (remastered)\nBing Crosby - Give Me the Simple Life (remastered)\nBing Crosby - Gone Fishin' (remastered)\nBing Crosby - In the Cool Cool Cool of the Evening (remastered)\nBing Crosby - MacNamara's Band (remastered)\nBing Crosby - Moonlight Becomes You (remastered)\nBing Crosby - Now Is the Hour (remastered)\nBing Crosby - People Will Say We're in Love (remastered)\nBing Crosby - Play a Simple Melody (remastered)\nBing Crosby - Sam Antonio Rose (remastered)\nBing Crosby - Stardust (remastered)\nBing Crosby - Sweet Leilani (remastered)\nBing Crosby - Swinging on a Star (remastered)\nBing Crosby - The Folks Who Live on the Hill (remastered)\nBing Crosby - The Spaniard Who Blighted My Life (remastered)\nBing Crosby - Too Ra Loo Ra Loo Ra! (That's An Irish Lullaby) (remastered)\nBing Crosby - Wrap Your Troubles in Dreams (remastered)\n\n \nCD3 - Frank Sinatra\nFrank Sinatra - (Bonus) Live in Australia - On the Road to Mandalay (remastered)\nFrank Sinatra - 100 Hits legend\nFrank Sinatra - A Fellow Needs a Girl (remastered)\nFrank Sinatra - Aintcha Ever Coming Back (remastered)\nFrank Sinatra - All Through the Day (remastered)\nFrank Sinatra - Close to You (remastered)\nFrank Sinatra - Day by Day (remastered)\nFrank Sinatra - Don't Forget Tonight Tomorrow (remastered)\nFrank Sinatra - Five Minutes More (remastered)\nFrank Sinatra - For You (remastered)\nFrank Sinatra - From This Day Forward (remastered)\nFrank Sinatra - Full Moon and Empty Arms (remastered)\nFrank Sinatra - Ghost of a Chance (remastered)\nFrank Sinatra - Homesick - That's All (remastered)\nFrank Sinatra - I'll Never Smile Again (remastered)\nFrank Sinatra - Light a Candle in the Chapel (remastered)\nFrank Sinatra - Love Me or Leave Me (remastered)\nFrank Sinatra - Mamselle (remastered)\nFrank Sinatra - Oh What It Seemed to Be (remastered)\nFrank Sinatra - On the Sunny Side of the Street (remastered)\nFrank Sinatra - Out of Nowhere (remastered)\nFrank Sinatra - You Make Me Feel So Young (remastered)\n \nCD4 - Perry Como\nPerry Como - (Bonus track) When Irish Eyes Are Smiling\nPerry Como - Because (remastered)\nPerry Como - Chi-Baba, Chi-Baba (My Bambino Go to Sleep) (remastered)\nPerry Como - Deep in the Heart of Texas (remastered)\nPerry Como - Did You Ever Get That Feeling in the Moonlight (remastered)\nPerry Como - Goodbye Sue (remastered)\nPerry Como - Have I Stayed Away Too Long (remastered)\nPerry Como - I Dream of You (remastered)\nPerry Como - I Wonder Who's Kissing Her Now (remastered)\nPerry Como - I'm Always Chasing Rainbows (remastered)\nPerry Como - I'm Confessin' That I Love You (remastered)\nPerry Como - I'm Gonna Love That Gal (remastered)\nPerry Como - If I Loved You (remastered)\nPerry Como - Lili Marlene (remastered)\nPerry Como - Long Ago (and Far Away) (remastered)\nPerry Como - May I Never Love Again (remastered)\nPerry Como - Prisoner of Love (remastered)\nPerry Como - Temptation (remastered)\nPerry Como - Till the End of Time (remastered)\nPerry Como - When You Were Sweet Sixteen\nPerry Como - You Won't Be Satisfied (Until You Break My Heart) (remastered)\n\n \nCD5 - Fred Astaire\nFred Astaire - A Foggy Day (remastered)\nFred Astaire - Crazy Feet (remastered)\nFred Astaire - Fascinating Rhythm (remastered)\nFred Astaire - Funny Face (remastered)\nFred Astaire - Hang on to Me (remastered)\nFred Astaire - High Hat (remastered)\nFred Astaire - I've Got You on my Mind (remastered)\nFred Astaire - Let's Call the Whole Thing Off (remastered)\nFred Astaire - Me One and Only (remastered)\nFred Astaire - New Sun in the Sky (remastered)\nFred Astaire - Nice Work If You Can Get It (remastered)\nFred Astaire - Night and Day (remastered)\nFred Astaire - Putting on the Ritz (remastered)\nFred Astaire - Shall We Dance (remastered)\nFred Astaire - The Rabbit and the Bromide (remastered)\nFred Astaire - They Can't Take That Away From Me (remastered)\n(Bonus track) Fred Astaire with Bing Crosby - That's Entertainment 192k\n \nCD6 - Mario Lanza\nMario Lanza - (Bonus track) Non Ti Scordar Di Me (Remastered 1993)\nMario Lanza - A Kiss (remastered)\nMario Lanza - Ave Maria (remastered)\nMario Lanza - Be My Love (remastered)\nMario Lanza - Because You're Mine (Remastered 1991)\nMario Lanza - Cosi Cosa (remastered)\nMario Lanza - Donkey Serenade (remastered)\nMario Lanza - E Lucevan le Stelle (remastered)\nMario Lanza - Granada (Remastered 1991)\nMario Lanza - I Love Thee (remastered)\nMario Lanza - O Soave Faniculla (remastered)\nMario Lanza - Parigi O Cara (remastered)\nMario Lanza - Song of Songs (remastered)\nMario Lanza - Temptation (remastered)\nMario Lanza - The Loveliest Night Of The Year (Remastered 1991)\nMario Lanza - Turna A Surriento (remastered)\nMario Lanza - Without a Song (remastered)\n\n \nOther great Bonus tracks\nAl Bowlly - Dreaming (added track)\nAl Jolson - When You Were Sweet Sixteen (added track)\nBilly Ekstine - Fools Rush In (added track)\nBryn Terfel - If Ever I Would Leave You (Camelot)\nDenny Dennis - Stardust (added track)\nDick Haymes - You'll Never Know (added track)\nFrankie Laine - That s My Desire (added track)\nKenny Baker - Always In My Heart (added track)\nLeslie Hutchison - With A Song In My Heart (added track)\nLeslie Hutchison - You'd Be So Nice To Come Home To (added track)\nTurner Layton - As Time Goes By (added track)\n \n","torrent":{"xt":"urn:btih:7c2d1a454729e6d4e8aa84f606a7174f206695e5","amp;dn":"Legendary+Crooners+%28remastered%29+320k+6CD%2B+%28musicfromrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c2d1a454729e6d4e8aa84f606a7174f206695e5","infoHashBuffer":{"type":"Buffer","data":[124,45,26,69,71,41,230,212,232,170,132,246,6,167,23,79,32,102,149,229]},"announce":[],"urlList":[]}}