{"title":"legacy of kain Defiance PC","uid":6726375,"size":3746602018,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7c727ac4b4754a63fc6bd04a1d2907440c8d9c2d&amp;dn=legacy+of+kain+Defiance+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bradgannon89","files":76,"time":1317971655,"description":"Unleash your inner evilProduct InformationFor the first time ever play as vampire Kain and his archrival thesoul-devouring Raziel. Return to the dark intrigue of Nosgoth where the vampire Kain pursues his fallen creation Raziel. Divided by their common enemies the two heroes must fight to unravel the mystery of their destinies as the fate of the world hangs in the balance. While their adversaries plot their destruction Kain and Raziel must embark on a dark odyssey which only one of them may survive.Product Features Utilize powerful telekinetic abilities to hurl enemies into breakable obstacles impale them on sharp objects or throw them off ledges. Engage in amazing combo moves using physical agility telekinesis and the formidable Reaver blade to destroy hordes of human and undead foes. Play as Kain and Raziel and feed your dark hunger by sucking the blood and devouring the souls of enemies to survive. Capture every moment of the action from the best possible point of view with an all-new cinematic camera system. Increase the power of the Reaver blade with new enhancements like fire lightning ice and more.\nWindows Requirements Windows 98SE 2000 XP 1.3 GHz processor 256 MB of RAM 2 GB Hard Disk space 64 MB Direct X 9.0b compatible Video Card. Card must support TnL. Direct X 9.0b compatible Sound Card 4X CD-ROM drive 10 button dual analog controller recommended\nplease seed and enjoy pictures coming soon\n\n\nthere is a readme included.. but\ni used WinRAR to unzip it and the poweriso to do it again and here is where you should see the installer/setup .\ninstall it mount the 2 discs again i used poweriso but several other programs work just as good then copy the crack file over to where you game is installed for me it is c; program files /legacy of kain defiance that is where your crack needs to go\ncopy and replace then run the game and have fun\n\ncomment if you like it ","torrent":{"xt":"urn:btih:7c727ac4b4754a63fc6bd04a1d2907440c8d9c2d","amp;dn":"legacy+of+kain+Defiance+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c727ac4b4754a63fc6bd04a1d2907440c8d9c2d","infoHashBuffer":{"type":"Buffer","data":[124,114,122,196,180,117,74,99,252,107,208,74,29,41,7,68,12,141,156,45]},"announce":[],"urlList":[]}}