{"title":"Sator - Basement Noise 2006","uid":6786295,"size":320288769,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7d9f466359347a1331db8b5db2917cb1f5d767b7&amp;dn=Sator+-+Basement+Noise+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"barber9","files":-1,"time":1320101672,"description":"Senast Sator kom med en skiva var 1998, Musical differences var namnet pÃƒÂ¥ plattan. Men bandet ÃƒÂ¤r noga med att pÃƒÂ¥peka att de faktiskt aldrig har splittrats, ÃƒÂ¤ndÃƒÂ¥ kÃƒÂ¤nns Basement noise som en ÃƒÂ¥terkomst. Medan Musical differences var smÃƒÂ¥experimentell ÃƒÂ¤r Basement noise mer tillbaka till tiden runt skivor som Slammer, Stock rocker nuts och Hedquake.\n\nLÃƒÂ¥tarna kÃƒÂ¤nns oftast effektiva och snÃƒÂ¤rtiga. En del tar mer avstamp i punk annat i pop, drivet ger bÃƒÂ¥da varianterna flygfÃƒÂ¶rmÃƒÂ¥ga. Det lÃƒÂ¥ter bra. Det Ã‚Â­lÃƒÂ¥ter Sator. Basement noise visar att Sator fortfarande kan.\n(Stefan Malmqvist, svd.se)\n\n- - -\n\nSator - Basement noise  2006\n(Stockholm Motor)\n\n 1. So dressed up\n 2. Angelina and sister Ray\n 3. Escape from Pig Valley Beach\n 4. The ghost of my control\n 5. Goodbye Joey\n 6. This ain't the way home\n 7. Water on a drowning man\n 8. At the end of time\n 9. You ain't nothing to me\n10. You're out of my hands\n11. Things you don't\n12. No!\n13. You walk alone\n\n\nHans GÃƒÂ¤fvert: keyboards and backing vocals\nHeikki Kiviaho: bass and backing vocals\nChips Kiesbye: lead vocals and guitars\nKent Norberg: lead vocals and guitars\nMikael Solen: drums and backing vocal\n\n- - -\n\nHere are the songs and the credits:\n\n1 SO DRESSED UP (Kiesbye/Norberg)\nWe recorded this one first for a German compilation which no one heard. We like it too much to be a lost song so it will definitively be on the album. A classic Sator punk/rock track in our opinion.\n\n2 ANGELINA COME ON (Kiesbye/Norberg)\nNot like anything we've ever done before. Not that it's that weird but maybe it might become our biggest hit?\n\n3 ESCAPE FROM PIGVALLEY BEACH (Kiesbye/Norberg)\nYou wanna know whatever happened to that guy? Here's the answer 16 years later. This was meant to be a b-side but it turned out way too good for that.\n\n4 THE GHOST OF MY CONTROL (Kiesbye/Norberg)\nIf Suicide would do a Sator cover it might sound something like this? Possibly the last song written for the album.\n\n5 GOODBYE JOEY (Kiesbye/Norberg)\nKent wrote this one as a tribute to Joey Ramone when he died. Probably the saddest songs we've ever recorded. A real tearjerker for all you lonely hearts out there. Before the song got mixed Johnny and Dee Dee died too so Kent had to rewrite the lyrics twice.\n\n6 THIS AIN'T THE WAY HOME (Kiesbye/Norberg)\nKent called Chips and told him to write a classic. He came back with the verse and chorus for this one in 15 minutes. The middle eight part was added later. The sequel to I wanna go home? This might be the first single from the album.\n\n7 WATER ON A DROWNING MAN (Kiesbye/Norberg)\nAnother fast typical vintage Sator song. If MotÃƒÂ¶rhead came from the Louisiana swamps they might have sounded something like this.\n\n8 AT THE END OF TIME (Kiesbye/Norberg/SolÃƒÂ©n)\nWe wanted a song like The Undertones' You got my number (why don't you use it). As usual the end result sounds nothing like we planned. But it's great. Chips, Kent and Michael got together in Stockholm, borrowed a rehearsal place and instruments from Michael Lohse (ex-Atomic Swing, now in The Kooks) and worked it all out. Several more songs were written during this session but so far this is the only one we've used. It's a very positive story about two people going straight to hell together.\n\n9 YOU AIN'T NOTHING TO ME (Kiesbye/Norberg)\nA really angry punk 1977 style track that has been around for a while. A new I'd rather drink than talk maybe?\n\n10 IT'S OUTTA MY HANDS (Kiesbye/Norberg)\nWe've had the intro riff for years but we never found the right song for it. Finally all the pieces came together. Another future Sator classic?\n\n11 THINGS YOU DON'T (Kiesbye/Norberg)\nClassic Sator around Stock Rocker Nuts with bits of The Who thrown in for extra excitement. It was written between Stereo and Musical differences but got lost along the way. We found a demo of it recently and thought it was a great song that we have to record now.\n\n12 NO! (Kiesbye/Norberg)\nOur negative side taken to the extremes. Say no to everything! Working title was AC/DC. No further comments.\n\n13 YOU WALK ALONE (Kiesbye/Norberg)\nOur tribute to The Wipers or Dick Dale goes punk. Recorded totally live in the studio with very few overdubs. This is the second take. The first one was similar but with less crazy guitar solos. It's the story about a couple of kids from a small town trying to get out of that hell-hole. The arrangement was very loose, we just let the tape roll and went for it. (sator.se)\n","torrent":{"xt":"urn:btih:7d9f466359347a1331db8b5db2917cb1f5d767b7","amp;dn":"Sator+-+Basement+Noise+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d9f466359347a1331db8b5db2917cb1f5d767b7","infoHashBuffer":{"type":"Buffer","data":[125,159,70,99,89,52,122,19,49,219,139,93,178,145,124,177,245,215,103,183]},"announce":[],"urlList":[]}}