{"title":"Father Goose","uid":6771093,"size":734369792,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7dbafd65f4d24d8a53754c439aac21198b7c9c41&amp;dn=Father+Goose&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Livinha","files":1,"time":1319576182,"description":"While the Royal Australian Navy evacuates Salamaua in February 1942[1] ahead of a Japanese invasion, Commander Frank Houghton (Howard) coerces old friend, American beachcomber Walter Eckland (Grant), into becoming a coast-watcher for the Allies. Houghton takes Eckland, who is uninterested in anything other than fishing and drinking, to deserted Matalava Island to watch for Japanese planes. Houghton rewards Eckland's sightings with directions to one of the whisky bottles hidden around the island, once coast-watchers on other islands confirm it. To ensure Eckland remains on duty Houghton's naval vessel &quot;accidentally&quot; hits his boat, leaving a large hole in its hull.\nHoughton finds a replacement watcher, but Eckland has to retrieve him from a nearby island. He unexpectedly finds Frenchwoman Catherine Freneau (Caron) and seven young schoolgirls under her care stranded there. She informs him that the man he came for was killed in an air raid, and Eckland reluctantly takes them back to Matalava with him.\nThere is no way to evacuate them safely. At first, Houghton promises them a parachute drop with more supplies, but there is too much enemy activity in the area to accomplish it safely. The fastidious Freneau and the slovenly and uncouth Eckland's personalities clash; they call each other &quot;Miss Goody Two Shoes&quot; and &quot;a rude, foul-mouthed, drunken, filthy beast&quot;. He adjusts to her and her girls, however, and cares for her through what they mistakenly believe is a deadly snakebite. Freneau learns that Eckland had been a history professor before he fled civilization to the South Pacific.\nThe &quot;frustrated spinster&quot; and the &quot;undisciplined, self-indulgent escapist&quot; fall in love and arrange to be married by a military chaplain over the radio. A Japanese airplane interrupts the ceremony. Since they have been detected Houghton sends an American submarine to pick them up, but an enemy patrol boat shows up at the same time. Eckland takes his boat out to lure the Japanese vessel out beyond a reef so the submarine can torpedo it. His boat is sunk, but Eckland survives and the submarine safely evacuates everyone.","torrent":{"xt":"urn:btih:7dbafd65f4d24d8a53754c439aac21198b7c9c41","amp;dn":"Father+Goose","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dbafd65f4d24d8a53754c439aac21198b7c9c41","infoHashBuffer":{"type":"Buffer","data":[125,186,253,101,244,210,77,138,83,117,76,67,154,172,33,25,139,124,156,65]},"announce":[],"urlList":[]}}