{"title":"BlacksOnBlondes - Whitney Grace","uid":7426498,"size":495958219,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7f53dcdae5db53aeb2850c9c61b375cc29416c2e&amp;dn=BlacksOnBlondes+-+Whitney+Grace&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kelvin09","files":1,"time":1341819894,"description":"BlacksOnBlondes - Whitney Grace\n\n &lt;a href=&quot;\nhttp://www.seedimage.com/X/viewer.php?file=85905460475481424815.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/X/viewer.php?file=85905460475481424815.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.seedimage.com/X/viewer.php?file=53548856669315732294.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/X/viewer.php?file=53548856669315732294.jpg&lt;/a&gt;\n\n\nThe prude librarian is about to have some personality fucked into her. Whitney Grace is a bookworm at the local library and she's noticed that Rico Strong is having trouble mastering some legal lingo. Whitney's caring nature will be the gateway to some interracial sex that she could never have prepared for. Rico Strong knows a good thing when he sees it and his quest for higher learning takes a back seat to some white pussy. Whitney's guard is temporarily down the second Rico whips out his big black cock, and, of course, she has to have that black meat in her mouth. The blonde librarian is using her lunch break to suck on Rico's big black cock which she's been dreaming about ever since he first applied for his library card. Whitney stops sucking on black cock ONLY so that her tight, white pussy can get completely ravaged by the future lawyer. Whitney's boyfriend is out looking for a college to attend while his girlfriend is apparently the valedictorian of Black Cock Slut University. Whitney's pussy becomes increasingly sore and it's her ass that's next on Rico's class schedule. You can just about hear all of Whitney's air expel from her lungs while Rico glides his black sub deep into her detention area. That white ass- which has always been neglected by her boyfriend- spreads apart so Rico can give her an education in interracial anal fucking. The librarian's tight sphincter brings Rico to the brink of blowing his nut all over her milky white skin. We have a feeling that Rico's law career will end up with Whitney becoming his legal secretary, complete with ass fucking lunch breaks.","torrent":{"xt":"urn:btih:7f53dcdae5db53aeb2850c9c61b375cc29416c2e","amp;dn":"BlacksOnBlondes+-+Whitney+Grace","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f53dcdae5db53aeb2850c9c61b375cc29416c2e","infoHashBuffer":{"type":"Buffer","data":[127,83,220,218,229,219,83,174,178,133,12,156,97,179,117,204,41,65,108,46]},"announce":[],"urlList":[]}}