{"title":"Antologija srpske duhovne muzike - peva: Pavle Aksentijevic","uid":6832463,"size":131198537,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7fe7eb275dce24a46608a003281c350f8caa5c92&amp;dn=Antologija+srpske+duhovne+muzike+-+peva%3A+Pavle+Aksentijevic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lopow","files":22,"time":1321915289,"description":"Antologija srpske duhovne muzike - peva: Pavle Aksentijevic\n\nAnthoslgy of Serbian Sacred Muzic - vocal: Pavle Aksentijevic\n\nmp3, 320kbps\n\n\nTrack listing: \n\n1.Alleluia (6th Mode)\n\n2.Psalomnik (Praise Verses) (1st Mode)\n\n3.Now the Celestial Powers (6th Mode)\n\n4.Cherubic Hymn (2nd Mode)\n\n5.Have Mercy on Me O Lord (6th Mode)\n\n6.We Worship Your Cross (2nd Mode)\n\n7.God the Lord (4th Mode)\n\n8.Alleluia (5th Mode)\n\n9.O What A Wonderful Miracle (1st Mode)\n\n10.You are the Prophets Announcement (1st Mode)\n\n11.Servikon (After the Birth) (8th Mode)\n\n12.Sing to the Lord All the Earth (Psalm 95-1) (4th Mode)\n\n13.Everything that Breath (Psalm 150-6) (5th Mode)\n\n14.He Looked on the Earth (Psalm 103 and 104-32) (8th Mode)\n\n15.Alleluia (1st Mode)\n\n\nA WORD ON CHANTING\n\nByzantine as well as the old Serbian sacred music is characterized, as far as its inner essence is concerned, by simplicity or. freedom from undue complexity, by purity or freedom from everything sensual, ostentatious, insincere, and by unsurpassed power and spirituality. As regards its outer form or technical aspect, it is characterized bu the fact that it is entirely vocal, not making use of any instruments, and monophonic, that is, employing melodies in one vocal part only.\nIn order to enrich and augment the melody, this music employs, , instead of poluphony and the accompaniment of the organ or some other I instrument, a finer, more spiritual means: the isocratima or holding-note.\nThe work of the isocrats consists of holding a drone on the basic tone of the mode in which the melody is being sung.\n\nThe isocratima not only enhances the melody, but also emphasizes the mode in which the psalm, humn or ode is being sung, and adds, solemnness and power to the psalmody. Its use goes back to the early Christian period.\nIn order to provide the chanters worth needed period,of rest, and to keep the congregation in a state of inner wakefulness antiphony is employed. That is, not one but two choirs are employed, so the congregation are not subjected. to the sleep-conductive monotony of hearing continuously the same voice or voices, coming from the same part of the church.\n\nThis music has its own system of musical scales, its own laws and canons, its own modes of composition, its own notation. The symbOlS above the words are interval signs. They do not give the pitch of every tone in the melody, bud indicate how many tones a certain note lies above or below the preceding one, orwhether it is a repetition of it.\n\nThe aim of this music is not to display the fine voices of the chanters, or to entertain the congregation, or to evoke aesthetic experience. In the firct place it is a means of worship and veneration; and in the second plase, a means of self-perfection, of eliciting and cultivating man\\'s higher thoughts and feelings and of oposing and eliminating his lower, undesirable ones.\n\nby Constantine Cavarnos\n","torrent":{"xt":"urn:btih:7fe7eb275dce24a46608a003281c350f8caa5c92","amp;dn":"Antologija+srpske+duhovne+muzike+-+peva%3A+Pavle+Aksentijevic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fe7eb275dce24a46608a003281c350f8caa5c92","infoHashBuffer":{"type":"Buffer","data":[127,231,235,39,93,206,36,164,102,8,160,3,40,28,53,15,140,170,92,146]},"announce":[],"urlList":[]}}