{"title":"Kaipa - Keyholder 2003","uid":6720403,"size":513199667,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:803edee5994a0eff2d874c934e2d257bc476b521&amp;dn=Kaipa+-+Keyholder+2003&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"barber9","files":-1,"time":1317766813,"description":"When the album Notes from the past, was released in the spring 2002 Hans Lundin had already written a lot of new songs for a forthcoming album. In the summer 2002 Hans and Roine had several meetings listening to the new songs. Out of a total of 150 minutes of music they had to choose the best songs for the new album. They decided to produce the album together and during the rest of 2002 they continued to work with the songs, trying to find the most suitable arrangements. Sometimes the song remained in its original shape, sometimes it was cut in pieces and repacked leaving some pieces to throw away or use in another later situation and sometimes Roine or Hans added new pieces of music to the final result. Hans had written all the vocal melodies with lyrics, but he asked Roine to look at the lyrics and try to refine them. This ended up with new versions, sometimes close to the original and sometimes with only fragments remaining. The vocal part of the song The end of the rope, was a completely new part written by Roine and was incorporated in this song that originally was instrumental. The song Sonic Pearls, was mainly written in June 1998 when Hans travelled through the Swedish landscape by train after mixing the Hagen album in a small village called Yttermalung, up in Dalarna. The strong folk music feeling still lingered inside of him and opened up the basic idea to this song. It was originally meant to be included on Notes from the past.\n\nHans had a basic idea to use the same musicians as on Notes from the past.\nHe considered this combination so magical and successful, so he didn't see any reason to change this. All persons were informed at an early stage about the plans and everybody wanted to participate thinking it was a great idea.\n\nOne important difference this time is the wider use of all the voices in the band.\nThis means that on several songs Patrik, Aleena, Hans and Roine are all singing together.\n\nThe album was recorded between January and Mars 2003 in HGL &amp; Cosmic Lodge Studios Uppsala, The UAE Magnetofon Studio Stockholm and Reingold Studio MalmÃƒÂ¶. The mixing took place at Cosmic Lodge in May 2003. (kaipa.info)\n\n- - -\n\nKaipa - Keyholder  2003\n(InsideOut Music)\n\n1. Lifetime of a journey \n2. A complex work of art \n3. The weed of all mankind \n4. Sonic pearls \n5. End of the rope \n6. Across the big uncertain \n7. Distant voices \n8. Otherwordly brights\n\n\nMusicians:\nHans Lundin, hammond organ, synthesizers, mellotron, pianos &amp; vocals\nRoine Stolt, electric &amp; acoustic guitars, percussion &amp; vocals\nPatrik LundstrÃƒÂ¶m, lead vocals\nAleena Gibson, lead and backing vocals\nMorgan Agren, drums\nJonas Reingold, bass\n\nGeneral Information:\nAll music by Hans Lundin except 5, 6 &amp; 7 music by Lundin &amp; Stolt\nAll words by Stolt &amp; Lundin except track 5: by Stolt &amp; \ntrack 4: by Kevin Fickling &amp; Hans Lundin\nProduced by Lundin &amp; Stolt\nRecorded by Lundin at HGL Studio, Uppsala, Sweden\nGuitars recorded by Stolt at Cosmic Lodge, Uppsala, Sweden\nDrums recorded by Lundin &amp; Agren at UAE Magnetofon, Stockholm, Sweden\nBasses recorded by Reingold at Reingold Studio, MalmÃƒÂ¶, Sweden\nMixed at Cosmic Lodge by Lundin &amp; Stolt May 2003\nMastered at Cosmic Lodge by Stolt June 2003\n","torrent":{"xt":"urn:btih:803edee5994a0eff2d874c934e2d257bc476b521","amp;dn":"Kaipa+-+Keyholder+2003","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"803edee5994a0eff2d874c934e2d257bc476b521","infoHashBuffer":{"type":"Buffer","data":[128,62,222,229,153,74,14,255,45,135,76,147,78,45,37,123,196,118,181,33]},"announce":[],"urlList":[]}}