{"title":"Coast To Coast AM - 18.10.2011 - Ghostly StoriesAncient ET Visit","uid":6768480,"size":55356128,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:805c741e965a68b2ddde681a382c551efb919b5b&amp;dn=Coast+To+Coast+AM+-+18.10.2011+-+Ghostly+StoriesAncient+ET+Visit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ViViDSOL","files":4,"time":1319485904,"description":"Host: George Noory\nGuests: Erich vonDaniken, Paul Rimmasch\n\nIn the first half, crime scene investigator Paul Rimmasch presented ghostly stories related to his work in law enforcement, as well as talked about his interest in 'forbidden archaeology.' He recounted a 2003 homicide investigation case, where a woman was murdered by her husband. His co-worker, Mitch, was near the body, and the electricity mysteriously went on and off, only at that house. When Mitch got home, his dog began behaving strangely as though reacting to another presence. An intuitive later informed him that the spirit of the murdered woman had followed him home because she was looking for someone she could trust.\n\nRimmasch cited unusual occurrences at the haunted Ben Lomond Hotel in Ogden, UT, and a special line during the second hour featured callers in law enforcement who'd had paranormal encounters themselves. He also talked about Michigan artifacts-- tablets with hieroglyphic-type writing that were said to be left behind by light-skinned people that the Native Americans eventually wiped out. Rimmasch believes the Americas were visited by people who traveled here via boat, far earlier than what mainstream history dictates.\n\n--------------------\n\nIn the second half, one of the main figures responsible for popularizing the ancient astronaut hypothesis, Erich von DÃƒÂ¤niken, discussed his theories, and his latest work, which posits that the Greek &quot;gods&quot; were ET beings who arrived here many thousands of years ago. People think of the Greek myths as like science-fiction of the past, with mixed beings like centaurs, fantastic creatures such as dragons, and tales of powerful weapons and ships. Rather than myth, he's concluded that these accounts reflect what might have actually gone on in the deep past.\n\nThe god/ET Poseidon mated with an Earth woman, and so to protect his new family, he created Atlantis, von DÃƒÂ¤niken explained. Plato spoke about Atlantis and a great war that had taken place 9,000 years earlier (11,500 years from our time). The ETs that visited Greece were present in Egypt earlier, von DÃƒÂ¤niken continued. He also spoke about his research in the Andes, where he investigated a prehistoric city, Puma Punku, that has artifacts of great precision that could not have been made by stone age people. The pre-Incan god Viracocha was another visiting extraterrestrial, he suggested.\n\nNews segment guests: Greg Hunter, Robert Zubrin\n\nWebsite(s):\n\n   the-suit.com/theloststones\n  \n   daniken.com\n   legendarytimes.com\n\nBook(s):\n\nThe Lost Stones\nChariots of the Gods\n   \nTwilight of the Gods: The Mayan Calendar and the Return of the Extraterrestrials\n   \nOdyssey of the Gods: The History of Extraterrestrial Contact in Ancient Greece\n","torrent":{"xt":"urn:btih:805c741e965a68b2ddde681a382c551efb919b5b","amp;dn":"Coast+To+Coast+AM+-+18.10.2011+-+Ghostly+StoriesAncient+ET+Visit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"805c741e965a68b2ddde681a382c551efb919b5b","infoHashBuffer":{"type":"Buffer","data":[128,92,116,30,150,90,104,178,221,222,104,26,56,44,85,30,251,145,155,91]},"announce":[],"urlList":[]}}