{"title":"ICE AGE 4 Continental Drift - GLOBE","uid":7416179,"size":979097397,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:80c2c287992bbb6d9ac76d79f8a9f578a9b72018&amp;dn=ICE+AGE+4+Continental+Drift+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1341520925,"description":"* XVID CAM  * 01H19M39S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Plot :\n\nAs in the previous films, the main protagonists are the mammoth Manny, the sloth Sid, sabre-toothed cat Diego, and, in a parallel storyline, the saber-toothed squirrel Scrat. Scrat's hunt for acorns triggers the break-up of the Pangaea continent into the continents as we know them today. In the meantime, Manny and his wife Ellie deal with their teen-age daughter Peaches who has a crush on Ethan. Peaches' best friend, a molehog named Louis, also appears to have a crush on her. When Manny catches Peaches hanging with Ethan after he told her not to, Manny and Peaches have a falling out. Soon after, the breakup of the continent separates Manny from his family. Manny gets stuck on a floating ice raft together with Sid, Diego, and Sid's grandmother Granny. A large moving landmass drives Ellie, Peaches, Crash and Eddie, Louis, Ethan, and a herd of other animals towards a land bridge, where they hope to reunite with Manny.\n\nMeanwhile, Scrat, lost at sea also, finds an acorn-shaped map, which leads to a mysterious acorn-filled island. Scrat decides to follow the map and find the island, but as he begins his journey, he is suddenly captured by a gang of animal pirates on an large ship-shaped iceberg, who are sailing the oceans.\n\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:80c2c287992bbb6d9ac76d79f8a9f578a9b72018","amp;dn":"ICE+AGE+4+Continental+Drift+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80c2c287992bbb6d9ac76d79f8a9f578a9b72018","infoHashBuffer":{"type":"Buffer","data":[128,194,194,135,153,43,187,109,154,199,109,121,248,169,245,120,169,183,32,24]},"announce":[],"urlList":[]}}