{"title":"Dynamic of Destruction {BBS}","uid":6731835,"size":9212229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8189cc3e2dd30b5b915fa5ddd99bb7fc7b29d2f7&amp;dn=Dynamic+of+Destruction+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1318187835,"description":"On 26 August 1914 the world-famous university library in the Belgian town of Louvain was looted and destroyed by German troops. The international community reacted in horror and the behavior of the Germans at Louvain came to be seen as the beginning of a different style of war, without the rules that had governed military conflict up to that point--a more total war, in which enemy civilians and their entire culture were now legitimate targets.\nAs award-winning historian Alan Kramer shows in this gripping and insightful volume, the destruction at Louvain was simply one symbolic moment in a vast wave of cultural destruction and mass killing that swept across the map of Europe at the time of the First World War. Using a wide range of examples and striking eye-witness accounts from England, France, Germany, and elsewhere, Kramer brings home the reality of the Great War, painting a picture of an entire continent plunging into a chilling new world of mass mobilization, total warfare, and the celebration of nationalist or ethnic violence--often directed expressly at the enemy's civilian population. Kramer examines the psychological impact of trench warfare, addresses the question of German atrocities (were the Germans particularly barbaric, or was savage behavior common on all sides?), and offers a disturbing summation of the war's impact on European culture.\nFrom the Western Front to the Balkans, from Italy to the war in the East, the First World War was the most apocalyptic the world had ever known. This book tells you how and why the civilized nations of Europe descended into unprecedented orgy of destruction.\n\n\n\n\n# Paperback: 448 pages\n# Publisher: Oxford University Press, USA; Reprint edition (March 15, 2009)\n# Language: English\n# ISBN-10: 0199543771\n# ISBN-13: 978-0199543779","torrent":{"xt":"urn:btih:8189cc3e2dd30b5b915fa5ddd99bb7fc7b29d2f7","amp;dn":"Dynamic+of+Destruction+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8189cc3e2dd30b5b915fa5ddd99bb7fc7b29d2f7","infoHashBuffer":{"type":"Buffer","data":[129,137,204,62,45,211,11,91,145,95,165,221,217,155,183,252,123,41,210,247]},"announce":[],"urlList":[]}}