{"title":"Haven S2E2 (2011)nl subs NLT-Release (DivX)","uid":6765970,"size":367044705,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:84b64023f164faed7382ccb2544f90ecad3d044a&amp;dn=Haven+S2E2+%282011%29nl+subs+NLT-Release+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"linday1","files":-1,"time":1319389339,"description":"\nFBI-agente Audrey Parker reist af naar Haven voor een op het eerste oog doodnormale zaak. Hoe langer zij in Haven blijft, hoe vreemder het stadje met haar inwoners lijkt te worden.\n\nHaven is losjes gebaseerd op het boek The Colorado Kid van Stephen King en vertelt het verhaal van een mysterieuze zoektocht naar de waarheid, vol met bovennatuurlijke gebeurtenissen en andere verrassende wendingen.\nHaven is een klein stadje in Maine, waar vervloekte mensen in ballingschap proberen een normaal leven te leiden, ondanks hun paranormale omstandigheden. Wanneer hun vloek begint terug te keren, wordt FBI-agente Audrey Parker gestuurd om de vreemde gebeurtenissen te onderzoeken. Ze ontdekt dat het stadje Haven vol geheimen zit, probeert de paranormale krachten onder controle te houden en de mysteries van de stadsbewoners te ontrafelen.\n\nDeep in the heart of Maine, Haven is a town where people with supernatural abilities have migrated for generations because it mutes their powers, allowing them to lead normal lives. At least, until recently. When hot-shot FBI agent Audrey Parker is called to Haven to solve the murder of a local ex-con, she catches the killer but uncovers a much deeper mystery about this town. Each week, as the town-peoples' dormant powers begin to express themselves, Audrey will try to keep these supernatural forces at bay while unraveling the many mysteries of Haven - including one surrounding her own surprising past in this extraordinary place.\n\nSpoiler Fear &amp; Loathing\nPeople start seeing their worst fears, and Nathan and Audrey realize that the visions are tied to the theft of a puzzle board that can destroy Haven. Meanwhile, the new Audrey tries to track down the mysterious FBI Agent Howard and learns of his connection to the late Chief Wournos\n\n\nVoor de nieuwste films, muziek en boeken ga je naar:\n &lt;a href=&quot;\nhttp://www.moviercensies.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviercensies.nl&lt;/a&gt;\n\n\nBinnenkort gaat het weer gebeuren NLT komt weer terug hou deze site in de gaten:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\n\n\nWe hopen je daar weer terug te zien.\n\nGroetjes Linday\n\nBy Linday ;) [/center]","torrent":{"xt":"urn:btih:84b64023f164faed7382ccb2544f90ecad3d044a","amp;dn":"Haven+S2E2+%282011%29nl+subs+NLT-Release+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84b64023f164faed7382ccb2544f90ecad3d044a","infoHashBuffer":{"type":"Buffer","data":[132,182,64,35,241,100,250,237,115,130,204,178,84,79,144,236,173,61,4,74]},"announce":[],"urlList":[]}}