{"title":"THE THING 2011 RMVB GLOBE","uid":6762079,"size":185092922,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8551869d815bd7adb5e49b686b8deefc75308f5c&amp;dn=THE+THING+2011+RMVB+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1319240304,"description":"* RMVB CAM  * 01H25M39S  * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* RECOMMENDED PLAYERS :\n\n\n- RMVB PLAYER or - MEDIACOPE \n\nor convert to your prefered video type for any other player\n\n\n\n* INTRO :\n\n\n* The Thing is a 2011 science fiction horror film directed by Matthijs van Heijningen Jr., and written by Eric Heisserer and Ronald D. Moore. It is a prequel to the 1982 film of the same name by John Carpenter, the plot taking place immediately prior to the events of that film. It stars Mary Elizabeth Winstead and Joel Edgerton who are part of a team of Norwegian and American scientists who discover an alien buried deep in the ice of Antarctica, realizing too late that it is still alive, consuming then imitating the team members\n\n\n* PLOT :\n\n\n* In 1982, paleontologist Kate Lloyd (Mary Elizabeth Winstead) is recruited by scientists Dr. Sander Halversen (Ulrich Thomsen) and his assistant Adam Goodman (Eric Christian Olsen) to join a Norwegian scientific team that has stumbled across a crashed extraterrestrial spaceship buried beneath the ice of Antarctica. They discover the frozen corpse of a creature that seems to have died in the crash 100,000 years ago.\n After the creature is transported back to base in a block of ice, Dr. Sander orders them to retrieve a tissue sample, against Kate\\'s protests. Later, while the others celebrate, co-pilot Derek (Adewale Akinnuoye-Agbaje) sees the Thing escape from the block of ice. The team splits up into groups to search for the alien. Olav (Jan Gunnar RÃƒÂ¸ise) and Henrik (Jo Adrian Haavind) discover it hiding under one of the buildings. The Thing grabs Henrik and pulls him into its body. The others converge on the scene and set the creature on fire. In the chaotic aftermath, the lone dog of the team is found dead in a bloody heap in its kennel, a massive hole torn in the wire mesh.\n During an autopsy, Kate and Adam discover that the cells of the Thing appear to be absorbing and imitating Henrik\\'s cells. \nMeanwhile, Derek, pilot Sam Carter (Joel Edgerton), Griggs (Paul Braunstein), and Olav prepare to leave the base in the only helicopter to bring back help. Just as they prepare to take off, Kate discovers bloody, discarded metal tooth fillings and large amounts of blood in the showers. She runs outside to flag down the departing helicopter, fearing the Thing may have imitated someone on board. When Carter decides to land, Griggs transforms and kills Olav, causing the helicopter to spin wildly out of control and crash in the mountains, presumably killing all onboard.\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n* GLOBE FILES 2011\n\n\n\n","torrent":{"xt":"urn:btih:8551869d815bd7adb5e49b686b8deefc75308f5c","amp;dn":"THE+THING+2011+RMVB+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8551869d815bd7adb5e49b686b8deefc75308f5c","infoHashBuffer":{"type":"Buffer","data":[133,81,134,157,129,91,215,173,181,228,155,104,107,141,238,252,117,48,143,92]},"announce":[],"urlList":[]}}