{"title":"China vs the US - The Battle For Oil","uid":6832215,"size":367009827,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:85ba550619152c78b4f10bc54754ca03110d0212&amp;dn=China+vs+the+US+-+The+Battle+For+Oil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mustafa-crap","files":2,"time":1321906917,"description":"Today, China is the second largest consumer of oil, just after the United States.\n\nBut with one of the highest rates of growth on the planet, its energy needs are increasing seven times faster, while its reserves are depleting.\n\nChina is unable to produce the oil it needs today. It has to import half of it. In the next three years this number will increase to two-thirds, if not its whole economy will collapse.\n\nLacking its own source of oil, China is dependent on the rest of the world.\nHence it\\'s imperative to find new countries to provide it and secure these supplies in an increasingly unstable world.\n\nIn this crusade for black gold, China is already in direct conflict with the current greatest consumer of the world\\'s oil: the United States.\n\nBATTLE FOR OIL investigates the new world geopolitics that is emerging around the needs of both the world\\'s leading superpower and the world\\'s fastest growing economy to secure future supplies of oil.\n\nChinese oil companies are signing deals in countries like Venezuela, Iran, Sudan, Chad and Angola. In exchange, China has given its support to these countries, either building infrastructure or using its influence to support them at the United Nations. Now, U.S. companies are finding that doing business in some oil producing markets is rapidly changing.","torrent":{"xt":"urn:btih:85ba550619152c78b4f10bc54754ca03110d0212","amp;dn":"China+vs+the+US+-+The+Battle+For+Oil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85ba550619152c78b4f10bc54754ca03110d0212","infoHashBuffer":{"type":"Buffer","data":[133,186,85,6,25,21,44,120,180,241,11,197,71,84,202,3,17,13,2,18]},"announce":[],"urlList":[]}}