{"title":"Nirvana 3 RARE TRACKS by RollingStonesMagazine","uid":6690196,"size":27196604,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:861269c28d8c3555b23c7886ed17fadc9228f776&amp;dn=Nirvana+3+RARE+TRACKS+by+RollingStonesMagazine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SARSHEMP","files":3,"time":1316548188,"description":"**Nevermind Celebrates Its 20th Anniversary with a Special Edition**\n\nOnce the initial shock of that record turning 20 years old wears off, the details of the special edition are quite exciting for any Nirvana fan. Consisting of four CDs and one DVD, the anniversary release will feature rare recordings, including sessions tracked at the BBC studios (some of which made it onto Nirvana's collection of B-sides and rarities known as &quot;Incesticide&quot;) and previously unreleased recordings. The DVD is said to contain a previously unreleased concert in its entirety.\n\nUpon it's release in 1991, the album pushed the &quot;Grunge&quot; movement into the forefront and launched a societal revolution, putting Generation X firmly on the map. Though other Seattle area bands like Soundgarden had already hit the scene, Nirvana's &quot;Nevermind&quot; plunged a flannel-draped dagger into the heart of Hair Metal, andostensibly killed the over-the-top guitar solo in popular music for a good decade following its release.\n\nUniversally hailed as the record that changed everything for a generation, &quot;Nevermind&quot; remains at the top of many lists that chronicle the best albums of the era. Though some die-hard fans of the band feel it's the mostcommerciallyproduced record, and therefore stripped of the band's signature raw sound, there is no arguing with sales numbers, nor with societal impact. &quot;Nevermind&quot; is to Nirvana what &quot;Sgt. Pepper's Lonely Hearts Club Band&quot; is to the Beatles. Maybe it's not their best work, though that might not be the wisest argument. It is however, the work most universally identified with the band.\n\nWith only three major label releases, it would seem that from this point forward, Universal will likely be releasing mostly special editions and box sets in an attempt to continue to capitalize on the band's meteoric career. Having been together for less than a decade, there's no telling how deep the mine is that Universal can excavate material from, but their hope is that fans of the group will continue to pay for it.\n\nNirvana was and is to this day one of the most influential acts of all time; and undoubtedly there are thousands of fans who never got the chance to see them live. The DVD included in the 20th Anniversary Edition of &quot;Nevermind&quot; will give fans that chance.The official release date for this set is September 19th.\n\n\n\n\n\n  SSSS      A     RRRR     SSS\n S         A A    R   R   S\n S        A   A   R    R  S\n  S      A  A  A  RRRRR    S\n    S    A  AA A  R   R      S  \nSSSSS    A     A  R    R  SSS\n\n","torrent":{"xt":"urn:btih:861269c28d8c3555b23c7886ed17fadc9228f776","amp;dn":"Nirvana+3+RARE+TRACKS+by+RollingStonesMagazine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"861269c28d8c3555b23c7886ed17fadc9228f776","infoHashBuffer":{"type":"Buffer","data":[134,18,105,194,141,140,53,85,178,60,120,134,237,23,250,220,146,40,247,118]},"announce":[],"urlList":[]}}