{"title":"Ouran High School Host Club Ep.4 (Eng. Sub)[Speedy Joe][imsourav","uid":6731559,"size":45816573,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8738868623891c17d6a1b0221d1a1d8e6ac7444c&amp;dn=Ouran+High+School+Host+Club+Ep.4+%28Eng.+Sub%29%5BSpeedy+Joe%5D%5Bimsourav&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PirateBoy","files":9,"time":1318175438,"description":"=======================\n===========================\nOuran High School Host Club\n===========================\n=======================\n\nGenre: Drama/Comedy\n======\n\nDescription:\n=========\n\nHaruhi is a poor tomboyish student at a school for the ultra-wealthy, able to attend because of a scholarship, and unable to even afford a uniform. One day, she stumbles across the decidedly peculiar but very popular Ouran Host Club. She tries to leave, but accidentally breaks a vase, and unable to pay for it, she's told that she'll have to stay and do odd jobs. That is, until they decide she would be more valuable as a club member. Not realizing she's female due to her appearance, they fix her up and give her a male uniform. She's an instant hit, so they decide to have her keep up the charade even after they find out the truth. Haruhi, being average almost to a fault, doesn't know what to make of the unconventional activities of the Host Club (or of the even more unconventional members), but having little choice, she plays along. Before long, real bonds are formed, friends made, and Haruhi finds herself accepted in a way she could never have been otherwise in this affluent school.\n\nEpisode Details:\n=============\n\n04 &quot;Attack of the Lady Manager!&quot;\n\nThe host club must deal with their new self-asserted manageress, Renge Hoshakuji, a French otaku who claims to be Kyoya's fiancÃƒÂ©e. She decides to enhance the roles of the host club by allowing them to cosplay a dark side of them. Eventually, this leads to Renge making a movie for the host club, with each host acting out their new roles. She gathers two students to play villains in this movie, however they never agreed to do such a thing. Haruhi attempts to protect Renge from their meager attacks, dislodging her contact-lens in the process, causing her to appear to be crying in pain. Tamaki hurries over, angry at the thought someone has hurt her, only to find out that it was her contact that fell out. Haruhi finally helps Renge understand to know someone by who they are and not by what they seem to be. Unfortunately, the movie that was made by Renge was sold throughout the whole academy, to apparent universal acclaim, by Kyoya by saving the film before breaking the camera lens and lessening the violence.\n\nFormat: .mp4\n======\n\nEnglish Subtitle by: Speedy Joe\n===============\n\nUploader Notes:\n==============\n\nIts one of the best animes in the comedy genre....please check it out...\nSeed...enjoy... ","torrent":{"xt":"urn:btih:8738868623891c17d6a1b0221d1a1d8e6ac7444c","amp;dn":"Ouran+High+School+Host+Club+Ep.4+%28Eng.+Sub%29%5BSpeedy+Joe%5D%5Bimsourav","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8738868623891c17d6a1b0221d1a1d8e6ac7444c","infoHashBuffer":{"type":"Buffer","data":[135,56,134,134,35,137,28,23,214,161,176,34,29,26,29,142,106,199,68,76]},"announce":[],"urlList":[]}}