{"title":"Richard Wagner Parsifal (2 chasti iz 2) 1982 XviD DVDRip domovik","uid":6705989,"size":3361474798,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:88c29b35a391822a898f917bb75485bf84d401f2&amp;dn=Richard+Wagner+Parsifal+%282+chasti+iz+2%29+1982+XviD+DVDRip+domovik&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1317164025,"description":"Parsifal is an opera in three acts by Richard Wagner. It is loosely based on Wolfram von Eschenbach's Parzival, the 13th century epic poem of the Arthurian knight Parzival (Percival) and his quest for the Holy Grail, and on ChrÃƒÂ©tien de Troyes' Perceval, the Story of the Grail.\nWagner first conceived the work in April 1857 but it was not finished until twenty-five years later. It was to be Wagner's last completed opera and in composing it he took advantage of the particular acoustics of his Bayreuth Festspielhaus. Parsifal was first produced at the second Bayreuth Festival in 1882. The Bayreuth Festival maintained a monopoly on Parsifal productions until 1903, when the opera was performed at the Metropolitan Opera in New York.\nWagner preferred to describe Parsifal not as an opera, but as &quot;ein BÃƒÂ¼hnenweihfestspiel&quot; - &quot;A Festival Play for the Consecration of the Stage&quot;. At Bayreuth a tradition has arisen that there is no applause after the first act of the opera.\nWagner's spelling of Parsifal instead of the Parzival he had used up to 1877 is informed by an erroneous etymology of the name Percival deriving it from a supposedly Arabic origin, Fal Parsi meaning &quot;pure fool&quot;.","torrent":{"xt":"urn:btih:88c29b35a391822a898f917bb75485bf84d401f2","amp;dn":"Richard+Wagner+Parsifal+%282+chasti+iz+2%29+1982+XviD+DVDRip+domovik","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88c29b35a391822a898f917bb75485bf84d401f2","infoHashBuffer":{"type":"Buffer","data":[136,194,155,53,163,145,130,42,137,143,145,123,183,84,133,191,132,212,1,242]},"announce":[],"urlList":[]}}