{"title":"Afterfall InSanity *2011* [ENG] [ISO] [SKIDROW]","uid":6855277,"size":4275415781,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:894cc30a6789cf5732ea7ddf4adaac797d874b9e&amp;dn=Afterfall+InSanity+%2A2011%2A+%5BENG%5D+%5BISO%5D+%5BSKIDROW%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"miguel1983","files":-1,"time":1322677602,"description":" &lt;a href=&quot;http://i28.fastpic.ru/big/2011/1130/f4/42b1987518ec313811499daf8981fbf4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i28.fastpic.ru/big/2011/1130/f4/42b1987518ec313811499daf8981fbf4.jpg&lt;/a&gt;\n\nGenre: Action\nGodin: 2011\nDesign: Nicholas Games\nPlatform: PC\n\nSummary: \nAfterfall: InSanity is a post-apocalyptic horror-genre game, which sets the stage for players to experience the Afterfall Universe. It is our first production on such a large scale, only a couple years ago it was merely an amateur project started as a response to the huge success of Fallout. However, after a change of the game engine, with a new crew and finally a new producer, Nicolas Games, we have managed to put together a great team and complete the work this time at the level and quality that we always knew it deserved. Afterfall: InSanity is the most important project in the careers of many of our team members.\nThe year is 2035. Almost 20 years ago the citizens of The Republic had to search for a shelter from the hell of the Third World War. Yet, only few were fortunate enough to have a place waiting for them in the prepared shelters. With the passage of time the fear of death on the surface has bcome only an unpleasant memory, however, the seemingly safe hideout has turned out to be a curse which cannot be escaped. It was only a matter of time before somebody would snap, and thus the dream of safety becomes a nightmare prison.\nThe protagonist of Afterfall: InSanity is a member of medical team which takes care of the mental and physical well-being of citizens living in the shelter. He specializes in the mental disorder caused by being locked-up for too long, yet he himself is not free of its symptoms. When all hell begins to break loose Albert has to find the answers to many questions, the where and the why, who is a real enemy and who a trusted friend. He will have to face the dangers lurking in the darkness of the shelter and in Albert's own mind, battling with his own weaknesses and fears.\nInSanity as a survival horror genre provides a healthy dose of fear and adrenaline to any lover of this particular game setting. Deep in the underground, trapped in the claustrophobic space with no hope for escape, the shadows hide secrets more dark and terrifying than the madness that takes over residents of the shelter.\nAlbert will have to square off against countless riddles, monsters and difficult to make decisions. He has been given a challenging task. He will have to show superb reflexes, the ability of logical thinking and deduction, not to mention nerves of steel.\nPlay the game, overcome your fears, save the residents of the shelter and try to find a new safe harbor ...\n\nSystem Requirements :\nCore 2 Duo 2 GHz, 2 GB RAM (3 GB - Vista / 7), graphic card 256 MB (GeForce 8600 GT or better), Windows XP/Vista/7.\n\nInstall :\n1. Mount or burn image\n2. Install\n3. Type anything at the serial screen\n4. Play the game\n5. Support the companies, which software you actually enjoy!\n\nScreen : &lt;a href=&quot;\nhttp://i28.fastpic.ru/big/2011/1130/17/d56e79da4e254fcad42839894fbbda17.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i28.fastpic.ru/big/2011/1130/17/d56e79da4e254fcad42839894fbbda17.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i28.fastpic.ru/big/2011/1130/48/51f7c451c51ddd667b9e49d65a091b48.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i28.fastpic.ru/big/2011/1130/48/51f7c451c51ddd667b9e49d65a091b48.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i28.fastpic.ru/big/2011/1130/79/8fa39237110d18febc98a5ceab1ae679.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i28.fastpic.ru/big/2011/1130/79/8fa39237110d18febc98a5ceab1ae679.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i28.fastpic.ru/big/2011/1130/6a/2202a67c5c3659e09d6c90357e36606a.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i28.fastpic.ru/big/2011/1130/6a/2202a67c5c3659e09d6c90357e36606a.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:894cc30a6789cf5732ea7ddf4adaac797d874b9e","amp;dn":"Afterfall+InSanity+%2A2011%2A+%5BENG%5D+%5BISO%5D+%5BSKIDROW%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"894cc30a6789cf5732ea7ddf4adaac797d874b9e","infoHashBuffer":{"type":"Buffer","data":[137,76,195,10,103,137,207,87,50,234,125,223,74,218,172,121,125,135,75,158]},"announce":[],"urlList":[]}}