{"title":"Gaalipata+MungaruMale (Kannada) Golden Star Ganesh Movies","uid":6759982,"size":2547729121,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ab0d2483197795542993bb89269d125b869b727&amp;dn=Gaalipata%2BMungaruMale+%28Kannada%29+Golden+Star+Ganesh+Movies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nrsadri","files":2,"time":1319176981,"description":"Gaalipata\n\nThree friends, Ganesh (Ganesh), Diganth (Diganth) and Kitty (Rajesh Krishnan) come to Mugilupete. Ganesh falls in love with Sowmya (Daisy Bopanna), a widow, staying with her in-laws Kodandaram (Anant Nag) and Padma (Padmaja Rao) while Diganth and Kitty fall for Kodandaram's daughters Radha (Neethoo) and Pavani (Bhavana Rao) respectively.\nWhile Diganth-Radha and Kitty-Pavani get the green signal for marriage, Sowmya is hesitant to accept Ganesh as her life partner. The director shows how Ganesh wins her heart in a unique way.\n\nMungaaru Male\n\nThe protagonist Preetam (Ganesh), on a visit to Eva Mall (a famous Mall in Bangalore) amidst a heavy wind, spots a pretty girl, Nandini (Pooja Gandhi). While staring at her, he inadvertently falls into a manhole. Nandini rescues him from the pit, but in the process loses her heart-shaped watch she had just bought.\nWhile accompanying his mother to Madikeri, Preetam confronts a man named Jaanu (Neenaasam Ashwath). Jaanu, who has been following Nandini, beats up Preetam thinking that he is in love with Nandini. Preetam, unaware that Jaanu has vowed not to allow any one near Nandini, trashes Jaanu and his gang in return.\nIn Madikeri, Preetam meets Nandini unexpectedly. He identifies himself and expresses his love towards her and offers to tie the watch as an indication for their marriage. Nandini, who is already engaged rejects his request. Still, Preetam vows to marry Nandini if she meets him again. In the meantime, Preetam discovers that his host in Madikeri, Col. Subbayya (Anant Nag) is Nandini's father, who is pretty much deaf, and Nandini's marriage is a just a week away. Dejected, Preetam throws Nandini's heart-shaped watch away. But Nandini calls him over the phone and taunts him to return. Delighted, Preetam goes in search of her watch and brings it back. While searching it, he spots a rabbit, which he calls Devadas, and brings it along with him.\nSince Nandini's friends are due to arrive from Mumbai for the marriage, Preetam takes Nandini to the railway station. The train from Mumbai is delayed by five hours, so Nandini and Preetam decide to visit a nearby hill-temple. While returning from the temple, Preetam and Nandini are caught in rain. An old couple offers Preetam and Nandini to take shelter inside their hut. Preetam, still in two minds about expressing his love to Nandini, grabs a couple of toddy bottles, goes out in rain and starts drinking. However, when Nandini walks towards him, offering an umbrella, he is under a state of intoxication and tells Nandini that he'd better stay away from Nandini to remain a decent boy, rather than to propose to or elope away with her.\nNandini is now in love with Preetam and is in a dilemma as her wedding is due in a few days. Nandini requests him to take her to the top of a waterfall and expresses her love towards Preetam, standing at the edge of the waterfall.\nPreetam, intent on marrying Nandini, takes her father, Subbayya for a morning jog to discuss his marriage with Nandini. But Subbayya a heart patient, tells Preetham that he's expected to die anytime and his only aim in life is to get Nandini married off to Gautam (Diganth). On the night before the marriage, Preetam drives away from the house without taking Devadas. He then starts drinking the whole night in a road-side bar. He finds Gautam, asking the bar-owner for directions to Subbayya's home. When Jaanu tries to kill Gautam, Preetam saves Gautam and convinces Jaanu that only Gautam is the best person to marry Nandini.\nNext day, he drops Gautam to the marriage house, just in time for the marriage. He then declines to attend Gautam's marriage. Gautam asks for the heart-shaped watch as a remembrance but Preetham does not agree to give it. Preetam then leaves. Meanwhile, on the wedding day everyone is searching for Preetam, but he is nowhere to be found. His mother is the only one who know the truth about his love, and is worried of his whereabouts, but does not show her worry.\nResignedly, Preetam watches the arch proclaiming &quot;Gautham weds Nandini&quot;. As he is leaving, he spots Devadas and takes it with him. He drives towards Bangalore, all the while expressing his disappointment to Devadas, but later he comes to know that Devadas is dead.\n\nScreen Shots Gaalipata:\n &lt;a href=&quot;\nhttp://bayimg.com/CaKgcAaDj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CaKgcAaDj&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/CaKGdAaDJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CaKGdAaDJ&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/cakgEaadJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cakgEaadJ&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/cAKGFAadJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cAKGFAadJ&lt;/a&gt;\n\nScreen Shots Mungaaru Male:\n &lt;a href=&quot;\nhttp://bayimg.com/CakggAADj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CakggAADj&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/CakGhAADj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CakGhAADj&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/cakGJaaDJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cakGJaaDJ&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/cAkGmAAdJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cAkGmAAdJ&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/cAkgNAadJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cAkgNAadJ&lt;/a&gt;","torrent":{"xt":"urn:btih:8ab0d2483197795542993bb89269d125b869b727","amp;dn":"Gaalipata%2BMungaruMale+%28Kannada%29+Golden+Star+Ganesh+Movies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ab0d2483197795542993bb89269d125b869b727","infoHashBuffer":{"type":"Buffer","data":[138,176,210,72,49,151,121,85,66,153,59,184,146,105,209,37,184,105,183,39]},"announce":[],"urlList":[]}}