{"title":"Premier Passions BBC 1998","uid":6768282,"size":956328748,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8d7ae8a3e7c7ced6d76e4debb702d7f076a70d7b&amp;dn=Premier+Passions+BBC+1998&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gus1961","files":7,"time":1319477506,"description":"Premier Passions is a five-part British documentary TV series, broadcast on BBC One between 24 February and 31 March 1998. It was narrated by actress and Sunderland fan Gina McKee, directed by John Alexander and produced by Stephen Lambert.\n\nIt chronicled Sunderland A.F.C. during the 1996-97 season, in which the club was relegated from the Premiership, the year after winning promotion from Nationwide League Division One.\n\nThe programme gave unprecedented insight into the goings-on in and around a Premier League football team, with the 45-minute episodes following a chronological order, beginning in December 1996 with the club sitting comfortably mid-table and mapping the next five months until relegation on the final day of the season. A constant theme was the club's thwarted search to sign a new striker who might have scored the goals to save the team from relegation. The boardroom was also not out of bounds as the documentary records the club's decision to float on the stock market, as well as meetings and debates regarding the club's move to a new home, the Stadium of Light.\n\nThe most memorable feature of the series was the language used by then-manager Peter Reid during his team-talks, usually at half-time, which were often full of swearing. The show often brought minor local fame to members of staff at the club, arguably most memorably, the then-groundsman Tommy Porter. Four supporters, professing to be lifelong fans, comprising a cross section of the local population, from schoolgirl to painter to lab technician to retailer, also gave insight and reaction to results and club decisions.","torrent":{"xt":"urn:btih:8d7ae8a3e7c7ced6d76e4debb702d7f076a70d7b","amp;dn":"Premier+Passions+BBC+1998","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d7ae8a3e7c7ced6d76e4debb702d7f076a70d7b","infoHashBuffer":{"type":"Buffer","data":[141,122,232,163,231,199,206,214,215,110,77,235,183,2,215,240,118,167,13,123]},"announce":[],"urlList":[]}}