{"title":"Behind Closed Doors - Secrets of Great Managment{BBS}","uid":6708129,"size":1726678,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f297ec016db8ebcf648917ceb68363844b3bf97&amp;dn=Behind+Closed+Doors+-+Secrets+of+Great+Managment%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317254022,"description":"Great management is difficult to see as it occurs. It's possible to see the results of great management, but it's not easy to see how managers achieve those results. Great management happens in one-on-one meetings and with other managers---all in private. It's hard to learn management by example when you can't see it.\n\nYou can learn to be a better manager---even a great manager---with this guide. You'll follow along as Sam, a manager just brought on board, learns the ropes and deals with his new team over the course of his first eight weeks on the job. From scheduling and managing resources to helping team members grow and prosper, you'll be there as Sam makes it happen. You'll find powerful tips covering:\n\n    * Delegating effectively\n    * Using feedback and goal-setting\n    * Developing influence\n    * Handling one-on-one meetings\n    * Coaching and mentoring\n    * Deciding what work to do---and what not to do\n    * ...and more.\n\nFull of tips and practical advice on the most important aspects of management, this is one of those books that can make a lasting and immediate impact on your career.\nAbout the Author\nJohanna Rothman helps leaders solve problems and seize opportunities. She consults, speaks, and writes on managing high-technology product development. She enables managers, teams, and organizations to become more effective by applying her pragmatic approaches to the issues of project management, risk management, and people management. Johanna publishes The Pragmatic Manager, a monthly email newsletter and podcast, and writes two blogs: Managing Product Development and Hiring Technical People. She is the author of several books: - Manage It! Your Guide to Modern, Pragmatic Project Management - Behind Closed Doors: Secrets of Great Management (with Esther Derby) - Hiring the Best Knowledge Workers, Techies &amp; Nerds: The Secrets and Science of Hiring Technical People - Corrective Action for the Software Industry (with Denise Robitaille).\nProduct Details\n\n    * Paperback: 176 pages\n    * Publisher: Pragmatic Bookshelf; 1 edition (September 26, 2005)\n    * Language: English\n    * ISBN-10: 0976694026\n    * ISBN-13: 978-0976694021","torrent":{"xt":"urn:btih:8f297ec016db8ebcf648917ceb68363844b3bf97","amp;dn":"Behind+Closed+Doors+-+Secrets+of+Great+Managment%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f297ec016db8ebcf648917ceb68363844b3bf97","infoHashBuffer":{"type":"Buffer","data":[143,41,126,192,22,219,142,188,246,72,145,124,235,104,54,56,68,179,191,151]},"announce":[],"urlList":[]}}