{"title":"Democracy Now - 21 oct 2011","uid":6761362,"size":453815683,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:90a7faf462209a3ab69853975f1999e8d99502f0&amp;dn=Democracy+Now+-+21+oct+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1319217930,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 21, 2011\n\n- Libyans Celebrate Gaddafi Death; Burial Delayed Amidst Probe Calls\n- Clinton Warns Pakistan on Militants\n- Greek Parliament Approves Austerity Package\n- Guatemala Apologizes to Arbenz Family for U.S.-Backed Coup\n- ETA Renounces Armed Struggle for Basque Independence\n- Senate Rejects Tax Measure in Jobs Bill\n- ACLU: FBI Racially Profiling Ethnic Groups in Probes\n- FBI Expands Definition of Rape Following Public Campaign\n- New Yorkers Protest NYPD &quot;Stop and Frisk&quot; Program\n- Bush Protested at Canadian Event\n- NPR Ousts Journalist for Attending D.C. Protest\n\n\nSpecial reports\n\n- Gaddafi's Death Sparks Celebrations, Probe Calls as Libyans Begin New Era Free of Regime\n\nThe circumstances of the death of former Libyan leader Col. Muammar Gaddafi remain unclear. Preliminary reports suggest NATO aircraft struck Gaddafi's convoy near Sirte early on Thursday, but he and a few others escaped on foot, and were eventually caught and killed by a unit of fighters from the National Transitional Council. Gaddafi's burial has now been delayed ahead of an outside investigation into the circumstances of his death. Meanwhile, NATO Secretary General Anders Fogh Rasmussen said NATO had successfully completed its operation and would soon end its mission in Libya. To talk more about the situation in Libya, we go to Sirte to speak with Peter Bouckaert, emergencies director for Human Rights Watch. &quot;This is a very unfortunate way to start the first chapter of the new Libya, with this very brutal killing,&quot; Bouckaert says. &quot;It's certainly already a stain on the record of the new Libya. Justice should be done in a court room, not street mob rule.&quot;\n\n\n- Exclusive: Nobel Laureate Tawakkul Karman on the Struggle for Women's Rights, Democracy in Yemen\n\nIn a Democracy Now! exclusive interview, we speak to Nobel Peace Prize laureate and Yemeni activist, Tawakkul Karman. The U.N. Security Council is set to vote on a resolution calling on Yemeni President Ali Abdullah Saleh to immediately step down after 33 years in power. All five permanent members of the Security Council back the measure, which &quot;strongly condemns&quot; government violence against demonstrators. The popular uprising in Yemen continues despite more attacks by government forces, including dozens of demonstrators murdered by snipers in recent days. Karman has been in New York City all week to press for international pressure on the Saleh regime. She is the first Arab woman to win the Nobel Peace Prize. A 32-year-old mother of three, an outspoken journalist and Yemeni activist, Karman has agitated for press freedoms and staged weekly sit-ins to demand the release of political prisoners from jail. She founded Women Journalists Without Chains and has played a leading part in the struggle for women's rights and for democracy in Yemen. Most recently, she has led rallies in the continuing protests against the rule of Saleh. &quot;We have the dream, and we have the ability,&quot; Karman says. &quot;We know what it means to be free, and we will achieve it.&quot; Of today's vote at the United Nations, Karman adds: &quot;The international community has to create pressure on Saleh... Dictatorships are going down and are done. There are a lot of scenarios for the end of those dictators...like running away like Ben Ali did, or to be held accountable and prosecuted just like Mubarak, or maybe getting killed like Gaddafi. In Yemen, we will have our own scenario. We will not go in the direction of violence. And I ask the international community not to let Yemen go in that direction.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:90a7faf462209a3ab69853975f1999e8d99502f0","amp;dn":"Democracy+Now+-+21+oct+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90a7faf462209a3ab69853975f1999e8d99502f0","infoHashBuffer":{"type":"Buffer","data":[144,167,250,244,98,32,154,58,182,152,83,151,95,25,153,232,217,149,2,240]},"announce":[],"urlList":[]}}