{"title":"Americans UK #1-4","uid":6692517,"size":27756259,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:90abbb18a57d6452e145d6db1853368d95151b17&amp;dn=Americans+UK+%231-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ngcomics","files":5,"time":1316650303,"description":"Americans UK\n\nLaugh to the scifi adventures of the real-life rock band Americans UK!\nBy Jef UK, Paul Ciaravino, and Ben\n\nVisit http://www.americans-uk.com to listen to ROCKTRONIC by AMERICANS UK! Album available on iTunes! Download free copies of the I, APE-MAN EP and the single JOHN LOVES WAYNE!!\n\nPurchase physical copies of Americans UK comics at: http://indyplanet.com/store/index.php?manufacturers_id=2495\n\nTo read more by Jef UK, go here: http://www.jefwrites.com\n\nIssue 1\nAmericans UK was the greatest rock band you'd never heard of until the day their guitarist and bassist were murdered. Frontman Jef UK and drummer JTR3 have since gone missing, but the police don't have a clue as to what went down. But you already know all that. Here's what you don't know: JTR3 is actually an android from the future sent back to our time to stop these murders from ever happening, alter history, and save all of rock n' roll. Boy, has he blown it! So now Jef UK and his robot buddy are bounding through time, rocking out the greatest science-fiction adventure since that one time Bowie was abducted by aliens in 1972.\n\nIssue 2\n29 pages of science fiction, rock n' roll awesomeness. Featuring the art of Paul Ciaravino, ZEES, Anthony Fleecs, and Ben Rosen, we tell stories to amaze.\n\n&quot;The Man From the Future&quot; continues the adventures of Jef UK and JTR3 as they travel through time to save their murdered band mates, as witnessed in the harrowing AMERICANS UK #1.\n\n&quot;I, Ape-Man&quot; follows the trials of a thirty-something mutant running wild across a post-apocalyptic nightmare city, as first told in a song bearing the same title, performed by AM/UK.\n\n&quot;The Better Head&quot; presents the ramblings of a mad scientist locked in psychological combat with one of his experiments.\n\nThrill.\n\nChill.\n\nDance.\n\n\nIssue 3\nAMERICANS UK have traveled to the future to save their murdered band mates! Once there, they must meet with the Robot Rebellion and avoid capture by The Legion of Stang.\n\nAction! Adventure! Hot robot chicks! This issue is jam packed with epic, rock n' roll science fiction, as masterfully rendered by artist Paul Ciaravino.\n\nIssue 4\nJef UK and JTR3, the surviving members of rock band AMERICANS UK, have traveled to the future to save their murdered band mates. Once there, they put on a show for their allies CL0YD the Droid, SH3LL-E, and the Robot Rebellion, a group of freethinking machines set on disposing the cultural despot known as Stang.\n\nJust as they finish their first song, Stang's enforcer, Bizoiko, bursts through the front door, preceding a swarm of mechanical Spillers poised to disassemble rock star and robot alike! Can the band survive their first gig in the future? Find out in this action-packed, rock n' roll adventure!\n\nBonus pin-up by Pat Loika!\n\n","torrent":{"xt":"urn:btih:90abbb18a57d6452e145d6db1853368d95151b17","amp;dn":"Americans+UK+%231-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90abbb18a57d6452e145d6db1853368d95151b17","infoHashBuffer":{"type":"Buffer","data":[144,171,187,24,165,125,100,82,225,69,214,219,24,83,54,141,149,21,27,23]},"announce":[],"urlList":[]}}