{"title":"Coast To Coast AM - 16.10.2011 - Spirit Communications","uid":6768449,"size":54013256,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:90d1fb882b5e30adc79af9a0f1586f84209b9e64&amp;dn=Coast+To+Coast+AM+-+16.10.2011+-+Spirit+Communications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ViViDSOL","files":4,"time":1319484491,"description":"Host: Rob Simone\nGuests: Rosemary Ellen Guiley, Richard C. Hoagland\n\nGuest host Rob Simone welcomed paranormal researcher Rosemary Ellen Guiley for a discussion about her new book with George Noory, Talking to the Dead, which covers spirit communications, and the technological devices people have used to contact the dead. She reviewed some of the earlier efforts of inventors like Tesla and Edison. There's no evidence that Edison actually produced a device to speak with the dead, though he spoke to journalists about his interest in it. His concept of the afterlife was based on the idea that we're composed of &quot;life units&quot; which scatter and coalesce into a new package upon death, she detailed.\n\nInterestingly, the disembodied seem to communicate best when there is a backdrop of noise going on, hence a lot of spirit communication devices incorporate the use of radio, Guiley explained. One, is the controversial &quot;radio sweep method&quot; (one version of this is known as Frank's Box). &quot;It's a device that sweeps up and down the radio band very quickly...so what this does is create a chaotic jumble of voices...a sound matrix that spirit voices can piggyback onto,&quot; and the user can ask specific questions, &quot;and it's not uncommon to get direct answers to those questions,&quot; she said. Some of these responses are the length of a full sentence, and can refer to a questioner by name, refuting the skeptic's claim that what is being picked up is simply the radio signal, she continued.\n\nSeveral EVP recordings were played from Guiley's investigations, including a haunting whispering voice that said &quot;I killed them.&quot; There was also an eerie but amusing rendition of the Twilight Zone show musical theme that emerged out of a technical mishap. Communications like that demonstrate the &quot;trickster&quot; element of the paranormal, she noted. In one experiment, she listened in on a conversation between two unknown voices. One voice said, &quot;I thought you were dead,&quot; and the other replied &quot;I am!&quot; It's possible some of the voices might originate in other dimensions, and some of the communications might be coming from alternate versions of ourselves, clustered around the same equipment in a parallel world, she intriguingly posited.\n\nComet Elenin Update\n\nAs Comet Elenin made its closest pass to Earth, first hour guest, Richard C. Hoagland revisited his theory (based on various hyperdimensional measurements) that the comet is an artificial object, possibly sent toward us as a kind of time capsule by our ancestors. More here.\n\nWebsite(s):]\n\n   visionaryliving.com\n   enterprisemission.com\n\nBook(s):\n\n   \nTalking to the Dead\n   \nThe Encyclopedia of Vampires, Werewolves, and Other Monsters\n   \nEncyclopedia of the Strange, Mystical, &amp; Unexplained\n   \nDark Mission","torrent":{"xt":"urn:btih:90d1fb882b5e30adc79af9a0f1586f84209b9e64","amp;dn":"Coast+To+Coast+AM+-+16.10.2011+-+Spirit+Communications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90d1fb882b5e30adc79af9a0f1586f84209b9e64","infoHashBuffer":{"type":"Buffer","data":[144,209,251,136,43,94,48,173,199,154,249,160,241,88,111,132,32,155,158,100]},"announce":[],"urlList":[]}}