{"title":"Bob.Hope.and.Bing.Crosby.Double.Feature(1947-1953)","uid":7414348,"size":1206053686,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:90ec7d1a777e791a79128b972963d5e0e860ceed&amp;dn=Bob.Hope.and.Bing.Crosby.Double.Feature%281947-1953%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"00rimme","files":9,"time":1341467992,"description":"Road to Bali (1953) -tt0045094\n\nThis sixth entry in the Crosby-Hope-Lamour &quot;Road&quot; series was the first (and last) in Technicolor. This time, Bing Crosby and Bob Hope play George Cochran and Harold Gridley, American vaudevillians stranded in Australia. To avoid a dual shotgun wedding, George and Harold sign on as deep-sea divers for sinister South-Sea-island prince Ken Arok (Murvyn Vye). After a contretemps with an octopus (courtesy of stock footage from Reap the Wild Wind), our heroes sail to the prince's Balinese homeland, \n\nThe Dvd Case and other reputable sites say it was made in 1953. IMDB else says 1952. I'm not sure who's right.\n\nMy Favorite Brunette (1947) -tt0039645\n\n Awaiting execution on death row, Hope tells the gathered reporters how he got into his present predicament. It seems that Hope was once a baby photographer, his office adjacent to the one leased by a private detective (played in an amusing unbilled cameo by Alan Ladd). While hanging around the p.i.'s office, Hope is mistaken for the detective by beautiful client Dorothy Lamour. She hires Hope to search for her missing uncle, and also entrusts him with a valuable map. Hope's diligent (if inept) sleuthing takes him to a shady rest sanitarium, where he runs afoul of lamebrained henchman Lon Chaney, Jr. and sinister, knife-throwing Peter Lorre. Both are in the employ of attorney Charles Dingle, who is responsible for the disappearance of Lamour's uncle. Escaping the sanitarium with Lamour in tow, Hope follows the trail of evidence to noted geologist Reginald Denny. The geologist is murdered, and Hope is accused of the crime.","torrent":{"xt":"urn:btih:90ec7d1a777e791a79128b972963d5e0e860ceed","amp;dn":"Bob.Hope.and.Bing.Crosby.Double.Feature%281947-1953%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90ec7d1a777e791a79128b972963d5e0e860ceed","infoHashBuffer":{"type":"Buffer","data":[144,236,125,26,119,126,121,26,121,18,139,151,41,99,213,224,232,96,206,237]},"announce":[],"urlList":[]}}