{"title":"Christa Couture...Fell out of Oz(2005)[FLAC]","uid":6730372,"size":301842102,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:921c279025215276806c0a5ca58e58c10ca6cb2b&amp;dn=Christa+Couture...Fell+out+of+Oz%282005%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":14,"time":1318113753,"description":"[img]http://image.allmusic.com/00/amg/cov200/drk000/k079/k07997q2htv.jpg[/img]\n[color=Orange]Fell out of Oz(2005) Maximum 20162 [/color] \n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n 1  Jennifer Gray  4:43 \n  2  Day 4  3:58 \n  3  I Will  3:50 \n  4  Scared Too  4:58 \n  5  Weight of the Wait  3:29 \n  6  For Miette (Cicuitry)  3:29 \n  7  Fell out of Oz  4:14 \n  8  The Next Bed  4:41 \n  9  London First  3:52 \n  10  Sundries Like Mondays  4:48 \n  11  Habitual  8:37 \n\nChrista Couture gives up all her lovely and messy bits through a blend of folk and rock, quirk and charm. A formidable talent, Couture is armed with an attention grabbing mezzo-soprano and a quick-witted, poignant turn-of-phrase. Her live performances are energetic yet reflective, moving and intimately universal. Couture's work is at its spontaneous best in this live context - fueling her audience with her candor, wit and passion. \n\nCouture was born with music in her blood. Her mother sang in sixties folk trio &quot;The Cellar Dwellers&quot; (and still performs music today) while her Native-American father performed ceremonial music his whole life. At the age of two, in an Arapaho naming ceremony, Couture was given the name Sanibe. It means Singing Woman, and her parents were told &quot;she will sing a lot, and talk a lot&quot;. Indeed, she was writing songs before she could write the alphabet and spent her childhood in choirs and her teens performing and studying musical theatre. At 21, she left her Edmonton home for the bright lights of Vancouver where she picked up a guitar and began focusing on her own writing (instead of Gershwin's or Webber's!) for the first time. In 2002 Couture released her ep Starter and moved to England to learn the trade of singing in smoky pubs. A year later, overflowing with inspiration, she returned to Canada to record again. \n\n&quot;She sings with an intimacy that feels like you are being let in on a secret&quot; (The Province, BC) and indeed you are. On Couture's debut full-length album, the critically acclaimed Fell Out of Oz, she confronts and contemplates surviving cancer, kissing boys, kissing girls and abortion. &quot;With a wide-eyed and inviting tenderness&quot; (Edmonton Sun), this childhood cancer survivor speaks honestly about illness, loss and uncertainty. She spins heartache, fear and hope into a passionate, compelling tapestry of music and lyrics.\n\ncd ripped by dBpoweramp\n\nplease seed\n\n[url]http://dickthespic.org/2011/09/22/christa-couture/[/url]\n\n","torrent":{"xt":"urn:btih:921c279025215276806c0a5ca58e58c10ca6cb2b","amp;dn":"Christa+Couture...Fell+out+of+Oz%282005%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"921c279025215276806c0a5ca58e58c10ca6cb2b","infoHashBuffer":{"type":"Buffer","data":[146,28,39,144,37,33,82,118,128,108,10,92,165,142,88,193,12,166,203,43]},"announce":[],"urlList":[]}}