{"title":"1 Litre of Tears","uid":7420336,"size":14766691858,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:92a4a75cd276a74630d6d2295c22db2f3f270cfb&amp;dn=1+Litre+of+Tears&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sithitac","files":24,"time":1341648646,"description":"I have decided to upload this jdrama because i think more people need to see this jdrama.  Every time i have watched this Japanese Drama i have cried and it made me feel happy to be alive.  I really hope others enjoy it.  I will be uploading forever so it won't go dead cheers.\n\n\nSynopsis:  \n\nThis drama is based on the real-life struggles of a 15-year-old girl named Aya who suffered from an incurable disease, but lived life to the fullest until her death at 25. The script is based on the diary Aya kept writing until she could no longer hold a pen. The book that later followed entitled One Litre of Tears has sold over 1.1 million copies in Japan alone.\n\nFifteen year old Ikeuchi Aya was just a normal girl, soon to be high school student and daughter of a family who works at a shop that makes tofu. As time passed, unusual things started happening to Aya lately. She started falling down often and walking in a strange way. Her mother Shioka, takes Aya to see the doctor, and he informs Shioka that Aya has spinocerebellar degeneration - a rare disease where the cerebellum of the brain gradually deteriorates to the point where the victim cannot walk, speak, write, or eat. A cruel disease, as it does not affect the mind in the least. How will Aya react when told about her disease? And how will Aya live from now on?","torrent":{"xt":"urn:btih:92a4a75cd276a74630d6d2295c22db2f3f270cfb","amp;dn":"1+Litre+of+Tears","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92a4a75cd276a74630d6d2295c22db2f3f270cfb","infoHashBuffer":{"type":"Buffer","data":[146,164,167,92,210,118,167,70,48,214,210,41,92,34,219,47,63,39,12,251]},"announce":[],"urlList":[]}}