{"title":"Roy Gaines  The First TB Album (blues)(flac)[rogercc]","uid":6707642,"size":329334919,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9364f7bdbf2557035fe93f073f2757d6754a29fd&amp;dn=Roy+Gaines++The+First+TB+Album+%28blues%29%28flac%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rogercc1","files":14,"time":1317229077,"description":"Roy Gaines The First TB Album\nReleased: 2003\nLabel: Delta Groove\nFormat: Flac\n\nRoy Gaines hails from the Lone Star state of Texas where he was born in 1937. He and his brother, the famed sax player and former Little Richard sideman Grady Gaines, performed together in the early years, gaining experience on Houston's jumping blues scene, Roy paying particular attention to his first guitar hero, T-Bone Walker. Roy eventually followed his mentor T-Bone to California, relocating there as a teenager. Before he was old enough to buy his own beer, Roy was playing with the biggest names in blues, becoming a member of Roy Milton's band, and spending time in the bands of Chick Willis, Ray Charles, and in trips back to the Houston area, doing sessions for the legendary Duke/Peacock labels with Bobby &quot;Blue&quot; Bland, Junior Parker, Big Mama Thornton and others. A voracious student of the guitar, Roy continued to expand his vocabulary on the instrument, and became a highly sought after session player (in addition to his burgeoning career leading his own band, resulting in a catalog of fine recordings beginning in the mid - ' 50s.) His dazzling and sophisticated guitar talents resulted in sessions with Jimmy Rushing, Coleman Hawkins, The (Jazz) Crusaders, Aretha Franklin, Stevie Wonder and many others, in addition to the more down-home blues he's been playing since the late '40s.Roy stayed busy with session work and touring as a sideman with some of the biggest names in the business for the next 30 years, in addition to running his own nightclub and recording studio, temporarily moving his own career as a bandleader to the back burner. He was also involved in some high-profile Hollywood projects, including writing music for the file &quot;The Color Purple&quot; and working with acclaimed composer and producer Quincy Jones. But the deep blues was never far from the surface, and in the early '80s he once again began stepping out as a front man and solo recording artist. In recent years he's released a series of excellent and widely varied blues recordings for a series of labels, showcasing his fluency in all the shades of blues expression, from gut-bucket juke joint stomps, to fleet-fingered jazz, to raucous rock influenced sounds, and of course his deep-rooted mastery of the guitar style of T-Bone Walker, which first caught his ear as a teenager.\n\n\nTracklist:\n\n01. Chicken Shack Boogie (3:53)\n02. Every Saturday Night (4:42)\n03. You-Re Still My Baby (3:31)\n04. C C Rider (4:46)\n05. Baby, Please Don't Go (2:50)\n006. Dangerous (4:57)\n07. Switcheroo (3:54)\n08. Lizzie (4:19)\n09. Boom Boom (3:53)\n10. Open House at My House (4:36)\n11. Running Around Balling (6:04)\n12. Big Legs, Tight Skirt (4:23)\n\nPersonell\n\nRoy Gaines - Guitar, Vocals\nJohn &quot;Marx&quot; Markowski - Guitar, Lap Steel\nLeon Blue - Piano\nTom Fillman - Drums\nRick Reed - Bass\nMitch - Kashmar - Harmonica","torrent":{"xt":"urn:btih:9364f7bdbf2557035fe93f073f2757d6754a29fd","amp;dn":"Roy+Gaines++The+First+TB+Album+%28blues%29%28flac%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9364f7bdbf2557035fe93f073f2757d6754a29fd","infoHashBuffer":{"type":"Buffer","data":[147,100,247,189,191,37,87,3,95,233,63,7,63,39,87,214,117,74,41,253]},"announce":[],"urlList":[]}}