{"title":"Burnout_Paradise_R.G._Mehaniki_tz","uid":6782319,"size":1657376768,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9373b6bd6a5af9900a2e12188c2df40eeda42515&amp;dn=Burnout_Paradise_R.G._Mehaniki_tz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hariuab","files":1,"time":1319953112,"description":"Welcome to Paradise City a heavenly place for autos and crazy drivers. A huge city with hundreds of streets and dozens of highways, the capital city of gleaming skyscrapers, filled with unsuspecting motorists thats where the competition will be the new Burnout! Only those who are willing to destroy opponents for fun, worthy to participate in them. Get ready to vent all their rage and spread the metropolis to pieces. Prove that the total destruction your element!\n\n\n\nThe racing Burnout is measured not speed and ability to come in turns, and how skillfully you arrange a car accident. Accidents have become even more beautiful! Instead of individual races Burnout Paradise offers an entire city, which can travel about freely in all directions. Pick and choose where, when and with whom to fight!\n\nFeatures:\n? Total freedom of action! From now on, in front of you is a city of skyscrapers, bridges, beautiful coastline and mountainous terrain nearby.\n? Freedom of movement is not limited! You are looking for a venue for regular races or skate aimlessly through the streets for fun.\n? Miracles on bends! In Paradise City you will find a wide range of exciting minigames. The longest ride on the counter without a frontal collision, the longest skid, dashing parking between two cars was close here bored!\n? Hundreds of cars! Each member of the movement can become part of the grand accident! Arrange the most extensive and spectacular accident in the history of the series, use your imagination, and victory will be on your side!\n? Mad rivals! Besides you on roads Paradise City romp yet thirtyfour autos. Each of them has unique methods and techniques of driving\n\nFeatures RePack:\nDo not cut / recoded\nGame Version 1.1.0.0\n\nInstallation and run:\n1. Mount image in Daemon Tools or Alcohol;\n2. Installed by following the instructions of the installer;\n3. To play.\nP.S. At the time of installation disable the antivirus program!\n\nSystem requirements:\nv Operating system: Windows XP / Vista / Seven\nv Processor: 3000 MHz and above\nv Memory: 1024 MB or more RAM\nv Video: 256 MB GeForce 6600 GT / Radeon X800 and more powerful, DirectX 9.0\nv Sound Card: Sound device compatible with DirectX 9.0\nv Free space on hard disk: 3.1 GB\n","torrent":{"xt":"urn:btih:9373b6bd6a5af9900a2e12188c2df40eeda42515","amp;dn":"Burnout_Paradise_R.G._Mehaniki_tz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9373b6bd6a5af9900a2e12188c2df40eeda42515","infoHashBuffer":{"type":"Buffer","data":[147,115,182,189,106,90,249,144,10,46,18,24,140,45,244,14,237,164,37,21]},"announce":[],"urlList":[]}}