{"title":"The Immortals [1995] Eric Roberts","uid":6704922,"size":736852570,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:952ec05ad94162b230147477da3ef06a8c43b751&amp;dn=The+Immortals+%5B1995%5D+Eric+Roberts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1317118257,"description":" &lt;a href=&quot;http://bayimg.com/dAkMHaAdd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/dAkMHaAdd&lt;/a&gt;\n\nThe Immortals (1995)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0113394/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0113394/&lt;/a&gt;\n\nA seedy nightclub owner recruits eight violent gangsters for an elaborate heist, but when they all begin to compare notes, they find they're pawns in a dangerous game of doublecross. \n\n  Eric Roberts  ...  Jack  \n  Joe Pantoliano  ...  Pete Tunnell  \n  Tia Carrere  ...  Gina Walker  \n  Tony Curtis  ...  Dominic  \n  Clarence Williams III  ...  Benny Hayes  \n  William Forsythe  ...  Tim James  \n  Chris Rock  ...  Deke Anthony  \n  Kevin Bernhardt  ...  Billy Knox  \n  Kieran Mulroney  ...  Kerry DeVain  \n  Brian Finney  ...  George Daniels (as Brian T. Finney)  \n  Michael Paul Chan  ...  Mifune  \n  Alex Meneses  ...  Cleopatra  \n\nThe Immortals stars Eric Roberts as Jack, a seedy club owner who assembles a crew of degenerate criminals to steal suitcases filled with cash from various drop points throughout the city. Along for the ride is Tia Carrere, Joe Pantoliano, Chris Rock, Brian T. Finney, Clarence Williams III, and one of my favorite character actors, Mr. William Forsythe himself. Paired with someone that clashes with their personality type in order to keep them honest, they set out to retrieve the proverbial goodies...with mixed results. Some are shot, some are chased by the police, and others bring their parents along for the ride. However, like most prototypical Hollywood heist movies, things don't go as planned once the money has been procured, and our band of amateur thieves find themselves smack dab in the middle of a blood-soaked double-cross. If that wasn't enough, they soon learn that they all share a common thread, one that changes the rules of the game entirely. As a vicious mob boss (Tony Curtis) infiltrates the club to collect what was stolen from him, this collection of polar opposites must band together to escape with the money...and their lives.\n\nWhile The Immortals plays out like your average low-budget heist movie, there's enough originality in its execution to make you think you're watching something both fresh and new. All of the script's shortcomings are smoothed out by the ensemble cast -- if you can call a ragtag collection of B-movies actors an &quot;ensemble cast&quot; -- who do their best to keep things exciting, kinetic, and light-hearted. \n\nThere's a hefty amount of bloodshed peppered throughout the course of the movie. Not only that, but when characters are shot, they don't immediately die.   We also get several variations on the John Woo-esque &quot;Mexican Standoff,&quot; including an inspired bit between Eric Roberts and Tony Curtis as they instruct their respective henchmen who to target and when to shoot.  The squib work is also nice, so those looking for some meaty exit wounds should have plenty to cheer about.\n\nThis film will probably get all kinds of flack from those who don't like Tarantino-inspired gangster movies. The Immortals has enough original ideas and incredible performances to help it rise above its station as yet another violent modern-day mob movie. It's not going to win any awards, but it's a pretty interesting way to spend 90 minutes of your life. Just try to keep the Tarantino comparisons to a minimum, okay? If you can watch, say, Boondock Saints without calling attention to its many borrowed ideas, you should have no problem whatsoever passing The Immortals through your cinema-choked colon.\n\n\n\n","torrent":{"xt":"urn:btih:952ec05ad94162b230147477da3ef06a8c43b751","amp;dn":"The+Immortals+%5B1995%5D+Eric+Roberts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"952ec05ad94162b230147477da3ef06a8c43b751","infoHashBuffer":{"type":"Buffer","data":[149,46,192,90,217,65,98,178,48,20,116,119,218,62,240,106,140,67,183,81]},"announce":[],"urlList":[]}}