{"title":"De Bijbel Simson en Delila DVD NL (dvd5)(Nl subs) RETAIL TBS","uid":6720201,"size":4681604374,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:95f0b282f4a05eb53c11239c9550f2051ef845ab&amp;dn=De+Bijbel+Simson+en+Delila+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sammynet","files":23,"time":1317760689,"description":"Nederlands\n\nDe Bijbel: Simson en Delila\nFatale liefde. Zoals zo vaak in de Bijbel wordt de geboorte van Simson al met een bijzondere gebeurtenis aangekondigd; een engel komt bij zijn moeder om te vertellen dat Simson geboren zal worden. God heeft een bedoeling met deze jongen. Simson zal sterker worden dan een leeuw. Hij zal een begin maken zijn volk te bevrijden van de Filistijnse overheersers. Simson groeit op tot een aantrekkelijke en aardige jongeman, maar leidt een leeg leven. Hij weet waartoe hij is voorbestemd, maar wacht op een teken. Naomi, een jonge vrouw wier hele familie door de Filistijnen is uitgemoord, besluit Simson uit te lokken tot een confrontatie. Dat lukt. Het verhaal van Simsons optreden verspreidt zich snel. Dit komt ter ore van Delila, het verleidelijke nichtje van een Filistijnse vorst.\n\nFilm informatie\nDuur \t    : \t180 min\nMedia       : \tDVD\nTaal \t    : \tEngels\nOndertitels : \tNederland\n\nEngels\n\nMara and her husband Manoa are both upstanding and religious Israelites living under the harsh and unjust rule of the Philistines. Much to their regret, they have not been able to have children. One day, a mysterious stranger appears to Mara and promises her that she will bear a son whom she is to call Samson. The stranger tells her that as one chosen by God Samson will fight the Philistines, will have immense strength at his disposal, but that he may never cut his hair (or drink alcohol); otherwise this gift will be lost. Samson is born and as foretold he grows into a boy with amazing strength. As time passes, Samson becomes an attractive young man and young women begin to interest him more and more. Naomi, a pretty but rather melancholic girl, falls deeply in love with him. During a walk Samson learns the young woman's story. When she was a small child, her village was exterminated by the Philistines and her whole family butchered...\n\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/15242&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/15242&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0117547/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0117547/&lt;/a&gt;","torrent":{"xt":"urn:btih:95f0b282f4a05eb53c11239c9550f2051ef845ab","amp;dn":"De+Bijbel+Simson+en+Delila+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95f0b282f4a05eb53c11239c9550f2051ef845ab","infoHashBuffer":{"type":"Buffer","data":[149,240,178,130,244,160,94,181,60,17,35,156,149,80,242,5,30,248,69,171]},"announce":[],"urlList":[]}}