{"title":"High School Musical 3 (E) NDS ROM Stumpie1971","uid":6701523,"size":67108864,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:9629d2bbe713c07c77c29f4dbe3a265783e96c73&amp;dn=High+School+Musical+3+%28E%29+NDS+ROM+Stumpie1971&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"stumpie1971","files":-1,"time":1316990257,"description":"High School Musical 3 - Senior Year \n\nExperience the music, scenes and characters from the &quot;High School Musical 3: Senior Year&quot; film. This is a unique rhythm-based dance game that lets you take on the role of the main characters and play along to the rhythm of songs from the theatrical release. The game features trivia-based personality quizzes that let you determine the Wildcat whose personality is most like yours. This feature lets fans dance through the game as that specific character, performing songs and experiencing the fun themed to Troy, Gabriella, Sharpay, Ryan, Chad or Taylor's personalities. In addition, High School Musical 3: Senior Year utilizes the DS stylus and D-pad to capture special photos to create a custom East High senior yearbook layout, to keep for years to come.\n\n    * Challenge friends by taking multiplayer BFF quizzes\n    * Answer trivia-based quizzes to determine player personalities based on HSM characters\n    * Capture special moments from the senior year to create yearbook layout\n    * Listen to songs from High School Musical 3 - Senior Year in the innovative jukebox mode using headphones even when the DS is closed\n    * Includes DGamer - the online community exclusively for Disney gamers. Customize unique 3-D avatar, create a persistent profile, chat with friends in a High School Musical chat room, share High School Musical themed accessories, earn in-game honors and unlock exclusive Disney content.\n\nALL MY GAMES HAVE BEEN TESTED &amp; ARE IN FULLY WORKING ORDER\n\nPLEASE SEED - MANY THANKS (Stumpie1971)","torrent":{"xt":"urn:btih:9629d2bbe713c07c77c29f4dbe3a265783e96c73","amp;dn":"High+School+Musical+3+%28E%29+NDS+ROM+Stumpie1971","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9629d2bbe713c07c77c29f4dbe3a265783e96c73","infoHashBuffer":{"type":"Buffer","data":[150,41,210,187,231,19,192,124,119,194,159,77,190,58,38,87,131,233,108,115]},"announce":[],"urlList":[]}}