{"title":"Wedfilmacadm - DSLR Filming Weddings Tutorials AE, Premiere, Pho","uid":6784215,"size":13781188947,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:9701784e36abacaf0921fc63137bdadddd6fa515&amp;dn=Wedfilmacadm+-+DSLR+Filming+Weddings+Tutorials+AE%2C+Premiere%2C+Pho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"scottvenzel","files":94,"time":1320028772,"description":"Tutorials List\nFilming Tutorials\n                                                                                                                                Audio Recorders\nRichard talks through audio recorders he\\'s used in the past, as well as his current models (Zoom H4n and Zoom H1).\n                                                                                                                                B-Cams\nGuest speaker Anton shows us the various B-Cams he uses at weddings - with video examples.\n                                                                                                                                Basic Jib/Crane\nRichard\\'s crane / jib is quick and easy and very mobile. See it in action, as well as its setup, in real-time.\n                                                                                                                                BTS of a DSLR Solo Shoot (Part 1)\nBehind-the-scenes coverage and commentary, of a DSLR solo-shoot (part 1: grooms prep)\n                                                                                                                                BTS of a DSLR Solo Shoot (Part 2)\nBehind-the-scenes coverage and commentary, of a DSLR solo-shoot (part 2: bridal prep)\n                                                                                                                                Camcorder Basics\nHere, Richard talks you through the main features of a pro camcorder, with reasons for filming in manual.\n                                                                                                                                Canon Lens Samples\nA short film showing examples of different Canon glass and a helpful tip at the end.\n                                                                                                                                Canon XF305 Camera\nJohn Cooper from Canon Europe talks to us about the exciting new XF305 from Canon.\n                                                                                                                                Choosing Your DSLR\nCan\\'t decide between DSLRs for your 1st/2nd/3rd cam? Richard tries his best to compare them!\n                                                                                                                                Creative Lighting\nOn Location - shooting with dramatic effect using off camera lights.\n                                                                                                                                DSLR Basics 5D Mk II\nA useful film if you are considering moving over to DSLR.\n                                                                                                                                DSLR Filming Techniques for Photographers\nWe highlight a few differences in using these cameras for capturing stills to capturing video.\n                                                                                                                                DSLR Lenses\nRichard talks you through his own DSLR lens choices (with example shots).\n                                                                                                                                Filming Interviews\nSome practical advice on how to film and conduct interviews with samples.\n                                                                                                                                Filming the Preparations\nA complete guide to how Engage Cinematic shoots preparations with lots of hints and tips.\n                                                                                                                                Framerates and Shutter Speeds\nA visual comparison between framerates, shutter speeds, resolution and ND fader filters.\n                                                                                                                                Glidetrack Hybrid Vertical Shots Tip\nWant vertical shots from your dolly slider, but haven\\'t got a ball head? Try this method!\n                                                                                                                                Large Crane Hints and Tips\nA run through and set up of a 15ft Camera Crane/jib.\n                                                                                                                                LCDVF\nRichard briefly shows you the LCDVF (a cost-effective DSLR viewfinder).\n                                                                                                                                Lens Choice\nA quick look at examples from the lenses in Richard\\'s kit list.\n                                                                                                                                Pete\\'s Uniform and Kit Bag\nAn explanation of what uniform and kit we use and why.\n                                                                                                                                Portable Lighting\nAn explanation of different types of lighting we use and why.\n                                                                                                                                Rapid Shooting\nHow to film with multiple pieces of equipment including glidetrack, monopod, camera stabilisers and turning a tripod into a crane!\n                                                                                                                                Richard\\'s Kit List\nRichard shares with you his camcorder / DSLR kit list setups, and proves you can transport them easily on single shoot weddings.\n                                                                                                                                Setting White Balance\nThe all-essential methods to gain correct white balance on your camcorder or DSLR, before you even hit record!\n                                                                                                                                Shot Choice\nRichard talks you through shot choice and anticipation, with many examples running in the background.\n                                                                                                                                Sounds Good\nAudio comparisons showing the importance of good microphones and their placements.\n                                                                                                                                Steadicam - Hints and Tips\nEngage Cinematic\\'s Pete takes you through \\'blinging\\' up the rig and takes you on a photo shoot with models around Cardiff Bay.\n                                                                                                                                Steadicam Tango Launch Day, London, 2010\nExclusive interviews from Oscar winning inventor Garrett Brown and Steadicam op Larry McConkey, inc. Steadicam Tango footage.\n                                                                                                                                The Glidecam\nBasic setup and balancing of a camcorder on a Glidecam, with demonstrated glide moves.\n                                                                                                                                The Glidetrack\nRichard shows off the fantastic Glidetrack - with various tips and trick manoeuvres)\n                                                                                                                                The Monopod\nHere, Richard will show you the Manfrotto Neotek Monopod, for use with DSLRs.\n                                                                                                                                Tripods\nHere, Richard shows you the tripod legs/head setup he uses, and explanations why.\n                                                                                                                                Vintage Lenses\nAnton (Image On Video) gives you a rundown of the vintage lenses he uses at weddings... with examples.\n                                                                                                                                Wireless Microphones\nThe benefits of using wireless microphones.\n________________________________________\nEditing Tutorials\n                                                                                                                                (**NEW**) NewBlueFX - Video Essentials 5\nRichard takes a look at \\'Video Essentials 5\\' (a plugin pack by NewBlueFX)\n                                                                                                                                (**NEW**) The 2.5D Effect\nHow to create a 3D-esque moving picture from a still framegrab.\n                                                                                                                                Basics of Editing (Premiere)\nThe Basics of Editing (in Premiere CS5 - more NLE\\'s will be covered over time).\n                                                                                                                                Cloning People\nMatrix-style cloning isn\\'t as difficult as you might imagine :) Features here include cropping, masking and nested sequences.\n                                                                                                                                Colour Correction (inc. White-Balancing)\nHere, Richard performs white balance corrections and general primary colour correction, using a variety of methods and plugins.\n                                                                                                                                Corporate Coolness\nHere we look at some elements of a couple of corporate promos.\n                                                                                                                                DVD and BluRay Authoring\nA look at authoring and creating DVDs and Blu-Rays, using Premiere, Encore and Photoshop.\n                                                                                                                                DVD and BluRay Design\nRichard talks you through his choice of film delivery and presentation, accompanied with tips for the design and printing.\n                                                                                                                                Dynamics Compression\nCompressing audio waveforms can have high importance for your projects. Richard shows you how!\n                                                                                                                                Entire Wedding Edit (Part 1)\nProject organisation and titling.\n                                                                                                                                Entire Wedding Edit (Part 2)\nTitles and more tips.\n                                                                                                                                Entire Wedding Edit (Part 3)\nAssembling clips and grading tips.\n                                                                                                                                Entire Wedding Edit (Part 4 - Ceremony)\nA whole ceremony edit on a 3 camera shoot, with hints n tips as always!\n                                                                                                                                Fakelapses\nRichard will talk you through creating a fake timelapse sequence, and touch on various ways to key footage.\n                                                                                                                                Fancy Titling in Photoshop (1)\nAn example of how to create a fancy title on top of a wedding framegrab (using Photoshop).\n                                                                                                                                Fancy Titling in Photoshop (2)\nAnother example of how to create a fancy title on top of a wedding framegrab (using Photoshop).\n                                                                                                                                Fixing Errors (Mattes and Cloning)\nHas your scene captured unwanted objects or difficult light exposure? Here are some tips to help you remove them!\n                                                                                                                                Fixing Errors (Noise Reduction)\nGot background hiss/hum/wind? Use professional noise removal tools to reduce it.\n                                                                                                                                Long and Short Form Edits\nLong and Short Form Edits\n                                                                                                                                Magic Bullet - Mojo\nAn introduction to this simple to use and mighty powerful plug in with workflow and samples.\n                                                                                                                                Magic Bullet Looks\nAn introduction to the interface, workflow and samples of work.\n                                                                                                                                Making a Cinematic Trailer (Part 1)\nThe whole edit explained, with all resources listed.\n                                                                                                                                Making a Cinematic Trailer (Part 2)\nSecond part in depth tutorial on the making of Vishal and Schveta\\'s epic trailer.\n                                                                                                                                Motion Tracking (Advanced)\nThese examples of accurate motion tracking were carried out with After Effects\\' own \\'Motion Tracker\\' feature.\n                                                                                                                                Motion Tracking (Beginner)\nHere\\'s a straightforward method to motion track a title or graphic, using Premiere or another NLE.\n                                                                                                                                NewBlueFX - Motion Blends\nRichard takes a look at \\'Motion Blends\\' (a transitions plugin pack by NewBlueFX)\n                                                                                                                                NewBlueFX - Video Essentials 1\nRichard takes a look at \\'Video Essentials 1\\' (a NewBlueFX plugin pack)\n                                                                                                                                NewBlueFX - Video Essentials 4\nRichard takes a look at \\'Video Essentials 4\\' (a plugin pack by NewBlueFX)\n                                                                                                                                Optical Flares Plugin\nAn introduction to the amazing plugin - Optical Flares. Watch examples and work flow.\n                                                                                                                                Photoshop Basics\nHere, Richard will talk you through commonly used tools and features in Photoshop (CS5 and below).\n                                                                                                                                Same-Day-Edits\nOur guest speaker from \\'Image on Video\\' gives you an insight (with tips) for creating \\'Same-Day-Edits\\'.\n                                                                                                                                Save the First Dance\nDark first dance footage? Here are a few ways to deal with it!\n                                                                                                                                The Vintage Look\nRichard shows you how to create a Vintage look (filmic colour / classy b+w using various colour grading techniques.\n                                                                                                                                Time Remapping\nTechniques on applying time-remapping to clips, when to use it and more.\n                                                                                                                                Titling for Beginners Part 1\nThe basics of making titles in Premiere and After Effects.\n                                                                                                                                Titling for Beginners Part 2\nMore in depth tutorial on creating a camera and animation in After Effects.\n________________________________________\nBusiness Tutorials\n                                                                                                                                (**NEW**) Enquiries and Paperwork\nRichard takes you from the initial contact of a customer, through to sending out contracts, plan of action and invoices.\n                                                                                                                                (**NEW**) Going Public with your Clips\nThis is Richard\\'s exact methodical procedure of sharing out a highlights clip, to maximise exposure and SEO.\n                                                                                                                                (**NEW**) Vimeo Embedding\nAn easy to follow guide for embedding vimeo clips into Facebook, websites and blogs.\n                                                                                                                                BVE Earls Court London - February 2011\nWedFilm Academy reporting from BVE 2011 (Earls Court, London, UK).\n                                                                                                                                Effective Ways to Advertise\nWe talk you through what works best and what\\'s not so hot.)\n                                                                                                                                FAQs Answered\nMany of your FAQs from emails, answered in one foul swoop!\n                                                                                                                                Get the Business You Want\nWe\\'ve all done free weddings to get business started. But how about FUN corporate work, leading to well-paid work. Consider these tips.\n                                                                                                                                Intro to WedFilm Academy\nBoth Richard and Pete giving you the background and ideas behind \\'WedFilm Academy\\'.\n                                                                                                                                Kevin Shahinian and Joe Simon come to London\nAn interview with 2 internationally famous wedding cinematographers.\n                                                                                                                                Networking on the Day\nSeize the opportunity to market yourself on the day. You are exposed to many opportunities!\n                                                                                                                                Online Clips\nA tutorial showing you how best to present and share your highlights clip online (e.g. Vimeo, YouTube, Exposure Room).\n                                                                                                                                Public Relations Tips 1 of 5\nGuest speaker Rebecca Sloan, gives some Public Relations tips. (Part 1 of 5, Press Releases)\n                                                                                                                                Public Relations Tips 2 of 5\nGuest speaker Rebecca Sloan, gives some Public Relations tips. (Part 2 of 5, Key Messages)\n                                                                                                                                Public Relations Tips 3 of 5\nGuest speaker Rebecca Sloan, gives some Public Relations tips. (Part 3 of 5, Reputation Management)\n                                                                                                                                Public Relations Tips 4 of 5\nGuest speaker Rebecca Sloan, gives some Public Relations tips. (Part 4 of 5, Online Presence)\n                                                                                                                                Public Relations Tips 5 of 5\nGuest speaker Rebecca Sloan, gives some Public Relations tips. (Part 5 of 5, Corporate Social Responsibility)\n                                                                                                                                Starting Out (Branding)\nA few hints and tips on how to market your company, branding and more.\n                                                                                                                                Starting Up in the Business - Our Stories\nRichard and Pete give honest insights into their own company histories.\n                                                                                                                                Useful Apps\nRichard shows you some useful apps for the iphone and ipad, that can make life easier, and help you work more efficiently.\n                                                                                                                                Video Blog filmed at SWPP London, Jan 2011\nA video blog from the January 2011 SWPP convention.\n","torrent":{"xt":"urn:btih:9701784e36abacaf0921fc63137bdadddd6fa515","amp;dn":"Wedfilmacadm+-+DSLR+Filming+Weddings+Tutorials+AE%2C+Premiere%2C+Pho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9701784e36abacaf0921fc63137bdadddd6fa515","infoHashBuffer":{"type":"Buffer","data":[151,1,120,78,54,171,172,175,9,33,252,99,19,123,218,221,221,111,165,21]},"announce":[],"urlList":[]}}