{"title":"Creating Web Sites Bible 3rd Edition{BBS}","uid":6690101,"size":50001993,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:977184b299205c24250190679653be5a6005ce06&amp;dn=Creating+Web+Sites+Bible+3rd+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316544662,"description":"    * Updated for the most recent tools, techniques, and standards for creating cutting-edge Web sites for businesses or personal use, this book is one-stop shopping for HTML, JavaScript, CSS, tables, forms, Flash, and more\n    * Brand-new chapters cover Ajax, Adobe CS3 tools, RSS, and blogging tools\n    * Hands-on guidance and expert advice dive into such topics as creating and editing images and graphics, adding multimedia elements (e.g., Flash animations, audio, and video), creating stores for Yahoo! and Amazon.com, designing auction pages for eBay, and building blogs\n\nFrom the Back Cover\nBuild your business or personal Web site in a 2.0 world\n\nIf you want to build your own Web site in a 2.0 world, you've come to right place. From facing HTML without fear to adding new ?air with multimedia, interactivity, and blogging, this comprehensive guide provides you with everything you need. Loaded with nearly a thousand pages of invaluable techniques and step-by-step instructions, this is your one-stop resource for designing a site, taking it live, keeping it fresh, and moving into the world of e-commerce.\n\n    *\n\n      Learn the Do's and Don'ts of Web development\n    *\n\n      Master HTML, CSS, and other design tools\n    *\n\n      Keep your Web site lively with color, backgrounds, hotspots, and links\n    *\n\n      Understand JavaScript and create dynamic pages\n    *\n\n      Add flash with Flash and other multimedia elements\n    *\n\n      Get up to speed on Ajax, XHTML, and XML\n\nCompanion Web Site\nFrom the book's Web site, you can access most of the programs and documents used in the course of the book, including CSS templates for the tutorials and sample code discussed in each chapter. Check out www.wiley.com/go/creatingwebsites.\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 888 pages\n    * Publisher: Wiley; 3 edition (June 30, 2008)\n    * Language: English\n    * ISBN-10: 0470223634\n    * ISBN-13: 978-0470223635","torrent":{"xt":"urn:btih:977184b299205c24250190679653be5a6005ce06","amp;dn":"Creating+Web+Sites+Bible+3rd+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"977184b299205c24250190679653be5a6005ce06","infoHashBuffer":{"type":"Buffer","data":[151,113,132,178,153,32,92,36,37,1,144,103,150,83,190,90,96,5,206,6]},"announce":[],"urlList":[]}}