{"title":"BIG Cocksucker Blues - The Rolling Stones","uid":6728315,"size":4597547008,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9773056dd88828e115e0527b159a222d63ee0257&amp;dn=BIG+Cocksucker+Blues+-+The+Rolling+Stones&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"omega6666","files":-1,"time":1318024200,"description":"What is Cocksucker Blues?\n\nCocksucker Blues is an unreleased documentary film directed by Robert Frank chronicling The Rolling Stones' North American tour in 1972 in support of their album Exile on Main St.\nThe film was shot cinÃƒÂ©ma vÃƒÂ©ritÃƒÂ©, with several cameras available for anyone in the entourage to pick up and start shooting. This allowed the film's audience to witness backstage parties, drug use (Mick Jagger is seen snorting cocaine backstage), roadie and groupie antics, and the Stones with their defenses down. One scene includes a groupie in a hotel room mainlining heroin. The provocative title notwithstanding, its nudity, needles and hedonism was incriminating enough to get the picture shelved, and this during a liberal climate that saw the likes of Cry Uncle!, Deep Throat, and Chafed Elbows playing in neighborhood theaters. A generic performance film, Ladies and Gentlemen: The Rolling Stones, was released instead, and Cocksucker Blues was forever shelved.\nThe film itself is under a court order which forbids it from being shown unless director Robert Frank is physically present.\n\nWhat is BIG Cocksucker Blues?\n\nThe &quot;big&quot; in the title is that you get an extra disc, with some interesting ephemera from the Taylor era:\n1) &quot;Satisfaction&quot;, &quot;Jack Flash&quot; and half of &quot;Carol &quot;from a Savoy theater show. Single camera from the balcony. Image is good but usually static and distant...Sound is good but vocals a little two hot.\n2) The Rolling Stones in Australia...an interesting documentary and nice counterpoint to cocksucker. Canny Australian media crew subjects STP invasion to a fairly rigorous expose.\n3) 5 PROMOS:&quot; angie, silver train, dancin with mr. d, till the next goodbye. aint to proud to bed...all lipsynch play acting to the music on these...some remarkably ridiculous wardrobe for Jagger. I read on some other page that these were created in association with Don Kirshner's Rock Concert\n4) a camera man up on the stage for bits and pieces of &quot;brown sugar&quot; sound is pretty raggedy\n5 ) David Frost...&quot;you can't always get&quot;...Jagger sings live over the canned track while all else play act ridiculously\n6) 2 interviews with mick Jagger one...black and white...is really only a fragment...and this is a shame because it's pretty fascinating. Jagger is placed before the press conference cameras like some sort of pied piper for hippie liberalism. He accepts and rejects the whole affair with a very honest grace...The second is dismal, the interview is an idiot- Jagger struggles and fails to make something of the occasion\n\nFor all the fans...","torrent":{"xt":"urn:btih:9773056dd88828e115e0527b159a222d63ee0257","amp;dn":"BIG+Cocksucker+Blues+-+The+Rolling+Stones","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9773056dd88828e115e0527b159a222d63ee0257","infoHashBuffer":{"type":"Buffer","data":[151,115,5,109,216,136,40,225,21,224,82,123,21,154,34,45,99,238,2,87]},"announce":[],"urlList":[]}}