{"title":"Gorillaz-Plastic Beach (Deluxe Version) [2011]","uid":6721386,"size":123033394,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:98c8350b672905e63c83a189b7ef3a08fdb85bf6&amp;dn=Gorillaz-Plastic+Beach+%28Deluxe+Version%29+%5B2011%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":19,"time":1317807504,"description":"Released: 08.03.10\n\nGorillaz LP3... In which our hero Murdoc was chased off to live in exile on an island of detritus somewhere in the Pacific, chloroformed his singer and recruited a smorgasbord of all star guests.\n\nFeaturing the singles: Stylo\n\t\nFormats\n\nCD/DLX:\n1. Orchestral Intro\n2. Welcome to the World of the Plastic Beach\n3. White Flag\n4. Rhinestone Eyes\n5. Stylo\n6. Superfast Jellyfish\n7. Empire Ants\n8. Glitter Freeze\n9. Some Kind of Nature\n10. On Melancholy Hill\n11. Broken\n12. Sweepstakes\n13. Plastic Beach\n14. To Binge\n15. Cloud of Unknowing\n16. Pirate Jet\n\nGoodies &amp; Info\n\nAdditionally, a deluxe &quot;Experience Edition&quot; of Plastic Beach was issued containing expanded artwork along with a bonus DVD. The DVD includes The Making of Plastic Beach Documentary, giving fans insight into all of the behind the scenes recording of the album.\n\nThe Experience Edition also comes with an access card containing a unique code, allowing fans to log into the gorillaz.com website and enjoy additional &quot;Gorillaz experience&quot; content along with the &quot;full&quot; Plastic Beach game. For additional information on accessing elements of the Experience Edition - click here.\n\nAn additional deluxe version was released for iTunes, giving fans the chance to also enjoy an HD quality download of the Stylo video (along with a Making of the Video download), Gorillaz artwork &amp; storybook, games, lyrics and mini videos for other album tracks.\n\nSpecial Guests\n\nPlastic Beach is Murdoc's concept album and he underwent an ambitious recruiting process in order to get a whole host of star names out to his Plastic Beach island to contribute to his latest classic. Here they are:\n\nOrchestral Intro features Sinfonia ViVA\nWelcome to the World of the Plastic Beach features Snoop Dogg &amp; Hypnotic Brass Ensemble\nWhite Flag features Kano, Bashy and The National Orchestra For Arabic Music\nStylo features Bobby Womack &amp; Mos Def\nSuperfast Jellyfish features De La Soul &amp; Gruff Rhys\nEmpire Ants features Little Dragon\nGlitter Freeze features Mark E. Smith\nSome Kind of Natures features Lou Reed\nSweepstakes features Mos Def &amp; Hypnotic Brass Ensemble\nPlastic Beach features Mick Jones &amp; Paul Simonon\nTo Binge features Little Dragon\nCloud of Unknowing features Bobby Womack &amp; Sinfonia ViVA\n\nCharts\n\nChart info TBD.\n\nArtwork\n\nPromo photos forthcoming.\n\nWhat They Said\n\n&quot;Sprawling, daring, innovative, surprising, muddled and magnificent... not just one of the best albums of 2010 but... a new benchmark for collaborative music as a whole.&quot; - BBC\n&quot;An intoxicating cocktail of musical styles and pioneers... instantly recognisable as a Gorillaz album&quot; - Clash\n&quot;The edifice of Plastic Beach has allowed Gorillaz to get away with making another guest-spotted album that never feels contrived. This is not just a project.&quot; - Drowned in Sound\n&quot;The tropical island where Gorillaz hang out is a &quot;plastic beach&quot; of industrial-waste products, so they recycle all the debris into shiny new toys. And that's the musical plan as well, mixing up bric-a-brac from around the world.&quot; - Rolling Stone","torrent":{"xt":"urn:btih:98c8350b672905e63c83a189b7ef3a08fdb85bf6","amp;dn":"Gorillaz-Plastic+Beach+%28Deluxe+Version%29+%5B2011%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98c8350b672905e63c83a189b7ef3a08fdb85bf6","infoHashBuffer":{"type":"Buffer","data":[152,200,53,11,103,41,5,230,60,131,161,137,183,239,58,8,253,184,91,246]},"announce":[],"urlList":[]}}