{"title":"Confessions of an Action Star [2005] Brad Martin","uid":6720976,"size":734770821,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:994642a01b06226c91abe4d1554f9a3a011b1e4f&amp;dn=Confessions+of+an+Action+Star+%5B2005%5D+Brad+Martin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1317791331,"description":" &lt;a href=&quot;http://bayimg.com/OakFNaAdF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/OakFNaAdF&lt;/a&gt;\n\nConfessions of an Action Star (2005) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0337887/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0337887/&lt;/a&gt;\n\nConfessions of an Action Star is an American action comedy mockumentary starring David Leitch, Angelina Jolie, Carrie-Anne Moss, Hugo Weaving, Eric Roberts, Dax Shepard, Debbie Allen, Lee Arenberg and directed by Brad Martin. The film was entitled Sledge: The Untold Story during its film festival run and is distributed by Vivendi Entertainment and Lightyear Entertainment.\n\n  Holmes Osborne  ...  Richard Orchid (as Homes Osborne)  \n  David Leitch  ...  Frank Sledge  \n  Kelly Hu  ...  Herself / Undercover Cop  \n  Carrie-Anne Moss  ...  Herself / Girlfriend in movie  \n  Ernie Hudson  ...  Himself / Commander  \n  Michael T. Weiss  ...  Drug Lord (as Michael T. Wiess)  \n  Mitchell Gaylord  ...  Brother (as Mitch Gaylord)  \n  Eric Roberts  ...  Himself/Police Chief  \n\nA 'mocumentary' on the rise and fall of Chip and Dales dancer turned martial arts action star, Francis Allen Sledgewick, AKA Frank Sledge. When fame and fortune caused Frank to lose his sense of what's truely important, he realised he's going to have to get in touch with his roots if there's ever going to be a comeback.\n\nWhen he was young, all Frank Sledge wanted to do was dance. His instructor/surrogate mother Samantha thought he would wind up on Broadway, or reviving the musical genre in Hollywood. Instead, Frank becomes one of Chippendale's brightest exotic stars, a showcase that lands him a shot at starring in a low budget b-movie. Unfortunately, the project has nothing to do with dance and everything to do with martial arts and fistfights. Frank is initially awkward and unable to perform. But with the help of friend/choreographer Glen Jeffers, he finds the &quot;rhythm&quot; of the scenes and shoots to stardom. It's not long before fame goes to Frank's head. He starts drinking and gets abusive with the cast and crew of his films. Soon, he's so drunk he can't stand up. Losing everything, he turns to AA for sobriety and to help solve his problems. Slowly, Frank recovers his career, introducing the concept of dance as ass-licking stunt spectacle.\n\nFor the number of famous faces they get to play act at being part of the Sledge sphere of influence, Confessions deserves creative kudos. In addition to Young and Roberts, Hugo Weaving makes a brief statement, while Angelina Jolie almost steals the film with her angry actress diva routine. Also excellent are Carrie-Anne Moss, Kelly Hu, and in a wonderful Matrix send-up, Debbie Allen. There are also some &quot;fictional&quot; folk expertly essayed by Dax Shepard, Jon Gries, Sam McMurray, and Farrelly Brothers favorite Lin Shaye. Still, one can't help feel that Confessions of an Action Star is a good idea pushed way beyond the boundaries of entertainment acceptability. It's not meant as a slam against Leitch or Martin, nor is it an attempt to undermine what they've managed to accomplish. \n","torrent":{"xt":"urn:btih:994642a01b06226c91abe4d1554f9a3a011b1e4f","amp;dn":"Confessions+of+an+Action+Star+%5B2005%5D+Brad+Martin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"994642a01b06226c91abe4d1554f9a3a011b1e4f","infoHashBuffer":{"type":"Buffer","data":[153,70,66,160,27,6,34,108,145,171,228,209,85,79,154,58,1,27,30,79]},"announce":[],"urlList":[]}}