{"title":"Karipap Karipap Cinta","uid":6697387,"size":366861894,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:99c2c6227ea05ad30e66fa18ff8a6d115a18e23e&amp;dn=Karipap+Karipap+Cinta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Zaini711","files":-1,"time":1316847093,"description":"Release Date: 31 August 2011\nLanguage: Malay\nSubtitle: Info Not Available \nGenre: Comedy / Romance\nRunning Time: 1 Hour 50 Minutes\nDirector: Othman Hafsham\nCast: Gambit Saifullah, Melia Aimellia\n\n&quot;Mengisahkan Ali, seorang pemuda yang bersopan dan baik perangainya tetapi kurang memiliki cita-cita dan motivasi. Dia bekerja di sebuah syarikat yang menerbitkan akhbar politik dan majalah misteri. Tugasnya adalah untuk mengambil foto tempatÃ‚Â² yang kelihatan seram dan mengubahsuainya kepada gambar yang kelihatan mempunyai hantu. Ali dalam diamÃ‚Â² mula jatuh hati pada Sarah, seorang Kartunis ditempat kerjanya. \n\nDalam satu kejadian meragut, Ali cuba untuk menjadi hero tetapi jadi berlaku sebaliknya. Ali tewas, namun dapat diselamatkan oleh Sarah yang mahir dengan seni kemahiran seni silat. Ali mendapat tahu yang Sarah pernah belajar di Universiti Al-Azhar dan mempunyai kelayakan sebagai Ustazah.\n\nDalam usaha unutk memikat Sarah dan keluarganya, Ali berbohong yang dia juga adalah pelajar kelulusan dari Al-Azhar. Sementara itu, bos Ali, Datuk Razali Bunari terlibat dalam satu pertelingkahan sengit dengan saingan politiknya Dato Zidan. Dia mendapat dokumen sulit mengenai skandal Dato Zidan dan ingin menerbitkannya melalui akhbar politik beliau.\n\nAli terkejut apabila dapat tahu bahawa ayah Sarah pernah bekerja dengan Dato Zidan dan memang terlibat dalam skandal tersebut.Setelah ketahui keinginan Bosnya itu, Ali ingin menebus dosa dengan mencuri dokumen-dokumen tersebut dari pejabatnya. \n\nDengan bantuan empat sekawan beliau dapat pecah masuk ke rumah Bosnya dan mencuri dokumen tersebut. Adakah hajat Ali untuk memikat sarah terkabul dengan kecurian itu? Atau adakah Ali akan bersifat jujur dengan memberitahu perkara sebenar? Dapatkan jawapannya di panggung kelak.&quot;\n\n\nPLEASE DONATE TO KEEP SEEDS ALIVE AND VISIT THE WEBSITE FOR SUPPORT\n\n &lt;a href=&quot;\nhttp://jika1.com.my&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jika1.com.my&lt;/a&gt; &lt;a href=&quot;\nhttp://urshop.com.my&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://urshop.com.my&lt;/a&gt;","torrent":{"xt":"urn:btih:99c2c6227ea05ad30e66fa18ff8a6d115a18e23e","amp;dn":"Karipap+Karipap+Cinta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99c2c6227ea05ad30e66fa18ff8a6d115a18e23e","infoHashBuffer":{"type":"Buffer","data":[153,194,198,34,126,160,90,211,14,102,250,24,255,138,109,17,90,24,226,62]},"announce":[],"urlList":[]}}