{"title":"SharePoint 2010 Disaster Recovery Guide{BBS}","uid":6699338,"size":8624485,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99cce50bd0d23f3efde18db48baf7774579628b2&amp;dn=SharePoint+2010+Disaster+Recovery+Guide%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316901183,"description":"Microsoft\\'s SharePoint platform is a complex, diverse technical tool designed to meet a range of business needs and uses. It requires several other platforms and applications for implementation, and it can be integrated with other external line of business applications. This diversity also applies to the numerous methods, tools, and approaches to preserve your SharePoint farm if it becomes affected by a catastrophic event. The majority of this book introduces you to those methods, tools, and approaches for backing up and restoring SharePoint. Furthermore, it covers the key concepts and activities necessary to develop a disaster recovery plan for SharePoint. After covering those concepts, it dives into all the crucial technical aspects of preserving SharePoint using the tools Microsoft provides with it.\nAbout the Author\nJohn Ferringer is a Microsoft Certified Technology Specialist in the installation and configuration of WSS v3, MOSS 2007, and SCOM 2007. He has co-authored the SharePoint 2007 Disaster Recovery Guide (Cengage Learning). He is a Solutions Architect for Apparatus, Inc. in Indianapolis, IN, has over five years of experience administering and supporting SharePoint technologies and over eleven years working in the technology consulting industry. John also runs SearchForSharePoint.com, a custom search engine for SharePoint.\n\nSean McDonough is a Product Manager for SharePoint Products at Idera, a Microsoft gold certified partner and creator of tools for SharePoint, SQL Server, and PowerShell. Sean is a consultant and a regular speaker at SharePoint events, and he has worked with a number of Fortune 500 companies to architect, implement, troubleshoot, tune, and customize their SharePoint environments. Sean is an MCTS, an MCPD, and the co-author of both the SharePoint 2007 Disaster Recovery Guide and the SharePoint 2010 Disaster Recovery Guide.\nProduct Details\n\n    * Paperback: 448 pages\n    * Publisher: Course Technology PTR; 2 edition (September 15, 2010)\n    * Language: English\n    * ISBN-10: 1435456459\n    * ISBN-13: 978-1435456457","torrent":{"xt":"urn:btih:99cce50bd0d23f3efde18db48baf7774579628b2","amp;dn":"SharePoint+2010+Disaster+Recovery+Guide%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99cce50bd0d23f3efde18db48baf7774579628b2","infoHashBuffer":{"type":"Buffer","data":[153,204,229,11,208,210,63,62,253,225,141,180,139,175,119,116,87,150,40,178]},"announce":[],"urlList":[]}}