{"title":"Ouran High School Host Club Ep.5 (Eng. Sub)[imsourav]","uid":6731924,"size":41112009,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:99f4c1a823b1ed8dce03519780c67943a3e59cdc&amp;dn=Ouran+High+School+Host+Club+Ep.5+%28Eng.+Sub%29%5Bimsourav%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PirateBoy","files":9,"time":1318191576,"description":"[img]http://assets.huluim.com/shows/key_art_ouran_high_school_host_club.jpg[/img]\n\n[img]http://anime.thehylia.com/album_images/3585-jystmsvkok.jpg[/img]\n\n=======================\n===========================\nOuran High School Host Club\n===========================\n=======================\n\nGenre: Drama/Comedy\n======\n\nDescription:\n=========\n\nHaruhi is a poor tomboyish student at a school for the ultra-wealthy, able to attend because of a scholarship, and unable to even afford a uniform. One day, she stumbles across the decidedly peculiar but very popular Ouran Host Club. She tries to leave, but accidentally breaks a vase, and unable to pay for it, she's told that she'll have to stay and do odd jobs. That is, until they decide she would be more valuable as a club member. Not realizing she's female due to her appearance, they fix her up and give her a male uniform. She's an instant hit, so they decide to have her keep up the charade even after they find out the truth. Haruhi, being average almost to a fault, doesn't know what to make of the unconventional activities of the Host Club (or of the even more unconventional members), but having little choice, she plays along. Before long, real bonds are formed, friends made, and Haruhi finds herself accepted in a way she could never have been otherwise in this affluent school.\n\nEpisode Details:\n=============\n\n05 \t&quot;The Twins Fight!&quot;\n\nHikaru and Kaoru beg to be allowed to visit Haruhi's home, but she refuses. Haruhi comments about the differences between Hikaru and Kaoru, which triggers a fight between the inseparable siblings, even making them dye their hair different colors, blue and pink, in order to be told apart. The feud between the twins leads to them fighting constantly. Eventually Kaoru is about to use the Belzenef doll which he obtained from Umehito Nekozawa, the president of the black magic club, and threatens to write Hikaru's name on the back of the Belzenef doll, completing the curse. However, Haruhi intervenes and snatches the Belzenef doll from Kaoru. When Haruhi finally stands up to their fighting, she tells the twins that if they apologize to each other then they can come to her house. However, she then turns the Belzenef doll over, seeing that &quot;blank&quot; was written on its back, revealing that it was all just a trick by the twins to be allowed to visit Haruhi's house. Haruhi knows that was clever, but she is still quite angry. \n\nFormat: .mp4\n======\n\nEnglish Subtitle by: Speedy Joe\n===============\n\nUploader Notes:\n==============\n\nIts one of the best animes in the comedy genre....please check it out...\nSeed...enjoy...","torrent":{"xt":"urn:btih:99f4c1a823b1ed8dce03519780c67943a3e59cdc","amp;dn":"Ouran+High+School+Host+Club+Ep.5+%28Eng.+Sub%29%5Bimsourav%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99f4c1a823b1ed8dce03519780c67943a3e59cdc","infoHashBuffer":{"type":"Buffer","data":[153,244,193,168,35,177,237,141,206,3,81,151,128,198,121,67,163,229,156,220]},"announce":[],"urlList":[]}}