{"title":"Five No Budget Films (2010)","uid":6855014,"size":4456773632,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9c3bdfeecc607b64e5fa230ec627256205d53bb3&amp;dn=Five+No+Budget+Films+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ontra","files":20,"time":1322663888,"description":"Little Fish Eat Big Fish[/B] aka LFEBF is a Kolkata based group of no-budget film makers. The first venture of the group is the 5 no-budget short films produced in 2009-10. They opted for a direct to DVD release in the last Kolkata Book Fair. Details for the five short films in the DVD are provided below.\n\n[B]1) The Sandbook --- A short fiction by Snigdhendu Bhattacharya. The film is an adoption of a short story by Jorge Luis Borges. The story moves with the landing of an amazing book in the hand of a scholer, who tries to understand \\\\\\&quot;the internal ties in events occuring\\\\\\&quot; in and around the book in order to go through it. The film is a melodramatic interpretation of the story within a very limited budget.\n\n2) Jean-Luc Godard Had No Script -- A no-budget fiction by Anamitra Roy. The film approaches the larger history of politically conscious films in a mimetic way. The title of the film is a bit exploitative as it is neither a spoof and has been made with a very tight script.\n\n3) ...Or A Horror film -- A short film by Souva Chattopadhyay. The film is an improvisation of a short story by Daniil Kharms, a little known Russian poet and short story writer.The film is about the paranoia inherent in the urban mindscape that prohibits oneself from fulfilling his/her desire.\n\n4) A Hiding -- A typical Arupratan Ghosh short film. A little fiction, a little non-fiction, a hint of an incomplete romance, a bit reflection of social reality --- all of it punched with an uncanny voiceover, that\\\\\\'s what \\\\\\'A Hiding\\\\\\' is.\n\n5) Long Live (all) the Revolution -- A short film about a young writers struggle in the power-craving world of ideology and disbelief. In this short fiction you will find a fake-magician, and you will be haunted by a prolonged and bizarre nightmare. This film is basically a fantasy of telling the (un)truth. Written and Directed by Sankhasubhra Ganguly.","torrent":{"xt":"urn:btih:9c3bdfeecc607b64e5fa230ec627256205d53bb3","amp;dn":"Five+No+Budget+Films+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c3bdfeecc607b64e5fa230ec627256205d53bb3","infoHashBuffer":{"type":"Buffer","data":[156,59,223,238,204,96,123,100,229,250,35,14,198,39,37,98,5,213,59,179]},"announce":[],"urlList":[]}}