{"title":"Prison Break - Season 2 - 22 Episodes","uid":6839961,"size":4807204330,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:9cbb0409572a1ed17904241776391e64bd874cbd&amp;dn=Prison+Break+-+Season+2+-+22+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"carbride","files":47,"time":1322135027,"description":"Prison Break - Season 2 - 22 Episodes - 480p BRRip\n\nStory\n\nThe second season begins eight hours after the escape, focusing mainly on the eight escapees. Series creator Paul Scheuring describes the second season as &quot;The Fugitive times eight&quot; and likens it to the &quot;second half of The Great Escape.&quot; The fugitives split up and journey to locations across the country with the authorities close behind them as they each pursue their individual goals. Brad Bellick gets fired from the prison where he worked as a guard and chases after the inmates himself for the reward money. Several of the escapees reunite in search of a large cache of money buried long ago by another prisoner. Federal agent Alexander Mahone is assigned to track down and capture the eight fugitives, but is revealed to be working for The Company, which wants all eight men dead. When Sara discovers her dead father, Governor Frank Tancredi, she meets with Michael, remaining with him as the brothers try to bring down the current President, a Company member. To ensure the brothers' safety, Sara allows herself to be arrested and faces trial. During the trial, the testimony of former Secret Service agent Paul Kellerman, who used to work for the Company-controlled President, exonerates Lincoln and Sara. Several of the escapees are killed or recaptured, but the brothers make it to Panama. Michael, T-Bag, Mahone, and Bellick are arrested by the Panamanian authorities and imprisoned at the PenitenciarÃƒÂ­a Federal de Sona.\n\nPlease seed after downloading and spread this as much as you can!","torrent":{"xt":"urn:btih:9cbb0409572a1ed17904241776391e64bd874cbd","amp;dn":"Prison+Break+-+Season+2+-+22+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cbb0409572a1ed17904241776391e64bd874cbd","infoHashBuffer":{"type":"Buffer","data":[156,187,4,9,87,42,30,209,121,4,36,23,118,57,30,100,189,135,76,189]},"announce":[],"urlList":[]}}