{"title":"Dr Israr Ahmed Bayan ul Quran Full","uid":7419033,"size":12727803904,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9e3b8c7a98c28be48fb33a00f20bbd06144d5597&amp;dn=Dr+Israr+Ahmed+Bayan+ul+Quran+Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"altaf1","files":3,"time":1341607523,"description":"Dr. Israr Ahmed's complete tafseer (in Urdu) of the Quran in 108 video CDs\n&quot;The Founder of Tanzeem-e-Islami Dr. Israr Ahmad is a well-known figure in Asia, the Middle East, and North America for his efforts in drawing the attention of Muslims in general and their educated classes in particular towards the teachings and wisdom of the Qur'an.\n\nIn the context of Qur'anic exegesis and understanding, Dr. Israr Ahmad is a firm traditionalist of the genre of Maulana Mehmood Hassan Deobandi and Allama Shabeer Ahmad Usmani; yet he presents Qur'anic teachings in a scientific and enlightened way, being also a disciple of Allama Iqbal and Dr. Muhammad Rafiuddin, and also because of his own background in science and medicine. Concerning the internal coherence of and the principles of deep reflection in the Qur'an, he has essentially followed the thinking of Maulana Hameed Uddin Farahi and Maulana Ameen Ahsan Islahi, though even here he has further developed their line of argument.\nDr. Israr Ahmad believes in a dynamic and revolutionary conception of Islam, and in this regard he is a disciple of Maulana Abul Kalam Azad and Maulana Sayyid Abul A`la Maududi.\n\nFor the last forty years or so, Dr. Israr Ahmad has been actively engaged not only in reviving the Qur'an-centered Islamic perennial philosophy and world-view but also reforming the society in a practical way with the ultimate objective of establishing a true Islamic State, or the System of Khilafah. He has widely traveled abroad and the audio and video tapes of his Qur'anic discourses in Urdu and English have circulated in thousands throughout the world.&quot; Edupk.com\nLanguage: Urdu/Hindi\n\nVideo Quality: VCD\n\nSound Quality: Good\n\nFormat: MP4\n\nOther Comments: All credit goes to brother Nazim Khan &amp; Arif Memon who gave me the set of Bayan Ul Quran which contains 108 VCD's I have only ripped it into MP4 format in order to save the space and also the time taken for downloading, the actual size of these 108 VCD's are 75.6 GB approximately which has been ripped to MP4 format so the size has reduced to 23.2 GB, if any one's still wish to have the original VCD's to be uploaded please feel free to mention so in the comment box, may Allah reward brother Nazim &amp; Arif for their good deed.","torrent":{"xt":"urn:btih:9e3b8c7a98c28be48fb33a00f20bbd06144d5597","amp;dn":"Dr+Israr+Ahmed+Bayan+ul+Quran+Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e3b8c7a98c28be48fb33a00f20bbd06144d5597","infoHashBuffer":{"type":"Buffer","data":[158,59,140,122,152,194,139,228,143,179,58,0,242,11,189,6,20,77,85,151]},"announce":[],"urlList":[]}}