{"title":"Step Up(2006)DVDRip.AC3(ENG)-DROCK","uid":6692926,"size":736300130,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f35cce119416b82a674110861d27aa6968cd281&amp;dn=Step+Up%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":1,"time":1316677751,"description":"An aspiring ballerina from a wealthy family learns some lessons about both dancing and life from a roughneck with soul in this teen drama. Tyler Gage (Channing Tatum) grew up on the wrong side of the tracks in a rough section of Baltimore, and has been in and out of trouble with the law most of his life. Finding himself before the judge yet again, Tyler is sentenced to 200 hours of community service, and he ends up mopping floors at the Maryland School of the Arts. Tyler catches the eye of Nora (Jenna Dewan), a gifted ballet student who is trying to incorporate hip-hop moves into her classical routines. None of Nora's fellow students seem to be on the same page as her, but Tyler is a talented street dancer with strength, moves, and enthusiasm. Despite the misgivings of the school's administrators, Nora persuades Tyler to team up with her for a major class project. Tyler gains a new self-respect as he gives in to the discipline of the dance academy, but he wonders if this new opportunity means turning his back on who he really is. Matters become all the more complicated when Tyler and Nora realize they're falling in love. Step Up was the first directorial credit for choreographer Anne Fletcher, who designed dance routines for the films Bring It On, She's All That, and Boogie Nights.\n\nRipped with Handbrake.\n\nLength: 1 Hour 37 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 384\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps\n","torrent":{"xt":"urn:btih:9f35cce119416b82a674110861d27aa6968cd281","amp;dn":"Step+Up%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f35cce119416b82a674110861d27aa6968cd281","infoHashBuffer":{"type":"Buffer","data":[159,53,204,225,25,65,107,130,166,116,17,8,97,210,122,166,150,140,210,129]},"announce":[],"urlList":[]}}