{"title":"Skunny 32-bit Full Game works in dosbox","uid":6699730,"size":9333610,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a0bffce4945fda9781ffe21b6b11a6ae6adbb5e6&amp;dn=Skunny+32-bit+Full+Game+works+in+dosbox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"stekelzak","files":1,"time":1316918591,"description":"Seems it wasn't downloadable yet anywhere. Too bad for such a fun arcade game.\n\nLast and best entry in the semi-popular Skunny series of platform games from Magic Touch, starring a cartoony squirrel who looks like a distant cousin of Jazz Jackrabbit. First (and last) in the series to be marketed as a full commercial game (the rest are shareware), Skunny 32-bit sees our squirrel hero cross-cross the world to six locations in search of ancient treasure. The locations are colorful and varied, spanning a pirate ship, arctic caverns, enchanted castles, Egyptian pyramids, desert oasis and an oriental temple.\n\nWith over 100 levels to conquer, you will face dozens of cool 3D animated objects and secret passages with treasures and bonuses galore. The engine, upgrade to 32-bit for Windows, is very fast, with smooth scrolling, multiple layers, crisp 256-color graphics, and hundreds of thousands of graphics tiles. Best of all, Skunny includes a built-in interactive level editor with which you can customize levels, edit levels on the fly and easily create custom levels for unlimited game play. Well worth a look, especially for fans of Jazz Jackrabbit or Zool. It is by far not as inventive as those two games, but it does offer dozens of hours of platform fun for gamers of all ages. Recommended!","torrent":{"xt":"urn:btih:a0bffce4945fda9781ffe21b6b11a6ae6adbb5e6","amp;dn":"Skunny+32-bit+Full+Game+works+in+dosbox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0bffce4945fda9781ffe21b6b11a6ae6adbb5e6","infoHashBuffer":{"type":"Buffer","data":[160,191,252,228,148,95,218,151,129,255,226,27,107,17,166,174,106,219,181,230]},"announce":[],"urlList":[]}}