{"title":"Body.of.Proof.S02 Top Episode.HDTV.XviD","uid":6789689,"size":372797996,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a1a5be672cc24a6dd7893822e9f231cc0457af17&amp;dn=Body.of.Proof.S02+Top+Episode.HDTV.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thisqglobel","files":-1,"time":1320224205,"description":"The Description of the body (La description du corps humain) is definitely an incomplete treatise designed in 1647 by RenÃƒÂ© Descartes. Descartes felt knowing yourself was particularly helpful. This for him incorporated medical understanding. He wished for stopping and stop disease, even going to decelerate aging.\n\nRenÃƒÂ© Descartes thought the soul triggered conscious thought. Your body triggered automatic functions such as the beating from the heart and digestion he felt. Your body was essential for voluntary movement along with the will. However, he thought the energy to maneuver your body was wrongly imagined to range from soul. A sick or hurt body doesn\\'t do what we should want or moves with techniques we don\\'t want. He thought the dying from the body stopped it from being fit to create movement. This didn\\'t always happen since the soul left your body.\n\nRenÃƒÂ© Descartes thought your body could exist through mechanical means alone. This incorporated digestion, bloodstream circulation, muscle movement plus some thinking processes. He felt everyone knows what the body is much like because creatures have similar physiques and most of us have seen them opened up up.\n\nHe saw your body like a machine. He thought the warmth from the heart in some way triggered all movement from the body. Bloodstream ships he recognized were pipes, he saw that veins transported digested food towards the heart. (It was introduced further by William Harvey. Harvey developed the thought of the circulation from the bloodstream.) Descartes felt that the energetic a part of bloodstream visited the mind there gave the mind a unique kind of air ingrained with vital pressure that enabled the mind to see, think and imagine. This special air then experienced the nerves towards the muscles enabling these to move.\n\nThe above mentioned is really a amazing combination of advanced thought in front of his some time and unproved, unsound speculation which today could be known as unscientific.","torrent":{"xt":"urn:btih:a1a5be672cc24a6dd7893822e9f231cc0457af17","amp;dn":"Body.of.Proof.S02+Top+Episode.HDTV.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1a5be672cc24a6dd7893822e9f231cc0457af17","infoHashBuffer":{"type":"Buffer","data":[161,165,190,103,44,194,74,109,215,137,56,34,233,242,49,204,4,87,175,23]},"announce":[],"urlList":[]}}