{"title":"Dances With Wolves (1&amp;2) - Michael Blake epub &amp; mobi","uid":6690139,"size":2251974,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a23ebbe2ce6579f8e199c40f4c20776703c6122f&amp;dn=Dances+With+Wolves+%281%26amp%3B2%29+-+Michael+Blake+epub+%26amp%3B+mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"karaokeking123","files":4,"time":1316545864,"description":"Dances With Wolves (1&amp;2) - Michael Blake epub &amp; mobi\n\n\nDances With Wolves\nThe world renowned, American epic Dances With Wolves is the eternal story of one man's search for his place in the world.\n\nSet in 1863, the novel follows Lieutenant John Dunbar on a magical and unpredictable journey from the ravages of the Civil War to the far reaches of the imperiled American frontier, a frontier he naively wants to see &quot;before it's gone&quot;.\n\nHis posting to a desolate and deserted outpost is the springboard for contact with the lords of the southern plains...the Comanches.\n\nThough he does not speak their language, has no knowledge of their customs and is considered a trespasser, Lieutenant Dunbar finds himself intrigued by the exotic and alien culture of the buffalo-hunting people of the plains.\n\nA simple desire to know more about his wild neighbors ignites a great adventure of transformation that culminates with the emergence of a different kind of man...a man called Dances With Wolves.\n\nDances With Wolves has appeared in hardcover only once in the United States. That edition has been out of print for more than ten years.\n\nHrymfaxe is proud to bring this timeless and beloved story to hardcover once again, availing readers, old and new, of an opportunity to give the saga Dances With Wolves the treasured place of permanence it deserves in personal libraries everywhere.\n\n\nThe Holy Road\nIn The Holy Road, sequel to Dances With Wolves, master storyteller Michael Blake at long last continues the saga.\n\nEleven years have passed subce Lieutenant John Dunbar became Dances With Wolves and married Stands With A Fist, a white-born woman raised as a Comanche from early childhood. With their three children, they live peacefully in the village of Ten Bears. But there is unease in the air, caused by increased reports of violent confrontations with white soldiers, who want to drive the Comanches onto reservations.\n\nDisquiet turns to horror, and then to rage, when a band of white rangers descends on Ten Bear's village, slaughtering half its inhabitants and abducting Stands With A Fist and her infant daughter. The three surviving great warriors - Wind In His Hair, Kicking Bird and Dances With Wolves - decide they must go to war with the white invaders. At the same time, Dances With Wolves realizes that only he can rescue his wife and child.\n\nTold with the same sweep, insight, and majesty that have made Dances With Wolves a worldwide phenomenon, The Holy Road is an epic story of courage and honor.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:a23ebbe2ce6579f8e199c40f4c20776703c6122f","amp;dn":"Dances+With+Wolves+%281%26amp%3B2%29+-+Michael+Blake+epub+%26amp%3B+mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a23ebbe2ce6579f8e199c40f4c20776703c6122f","infoHashBuffer":{"type":"Buffer","data":[162,62,187,226,206,101,121,248,225,153,196,15,76,32,119,103,3,198,18,47]},"announce":[],"urlList":[]}}