{"title":"Implementing.Cisco.Unified.Communications.Manager.Part2.2nd.Edit","uid":6717087,"size":13676185,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2fe47f80c8cef37cb07ce5d1c70c94e99ea58de&amp;dn=Implementing.Cisco.Unified.Communications.Manager.Part2.2nd.Edit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"medossa","files":2,"time":1317600077,"description":"Implementing Cisco Unified Communications Manager, Part 2 (CIPT2) Foundation Learning Guide: (CCNP Voice CIPT2 642-457) (2nd Edition) (Foundation Learning Guides)\n\nHardcover: 448 pages \nPublisher: Cisco Press; 2 edition (September 2, 2011) \nLanguage: English \nISBN-10: 1587142538 \nISBN-13: 978-1587142536 \\'\n\n\nImplementing Cisco Unified Communications Manager, Part 2 (CIPT2), Second Edition is a CiscoÃ‚Â®-authorized, self-paced learning tool for CCNP VoiceÃ‚Â® foundation learning. This book provides you with the knowledge needed to install and configure a Cisco Unified Communications Manager solution in a multisite environment. By reading this book, you will gain a thorough understanding of how to apply a dial plan for a multisite environment, configure survivability for remote sites during WAN failure, and implement solutions to reduce bandwidth requirements in the IP WAN.\n\n \n\nThis book focuses on Cisco Unified Communications Manager (CUCM) Release 8.x, the call routing and signaling component for the Cisco Unified Communications solution. The book has been fully updated and includes new coverage of topics such as Service Advertisement Framework (SAF), and Call Control Discovery (CCD).\n\nWhether you are preparing for CCNP Voice certification or simply want to gain a better understanding of deploying Cisco Unified Communications Manager in a multisite environment, you will benefit from the foundation information presented in this book.\n\n \n\nImplementing Cisco Unified Communications Manager, Part 2 (CIPT2), Second Edition, is part of a recommended learning path from Cisco that includes simulation and hands-on training from authorized Cisco Learning Partners and self-study products from Cisco Press. To find out more about instructor-led training, e-learning, and hands-on instruction offered by authorized Cisco Learning Partners worldwide, please visit www.cisco.com/go/authorizedtraining.\n\n \n\nChris Olsen, CCVP, and CCNP, along with numerous other Cisco voice specializations, Microsoft, VMware, and Novell certifications, has been an independent IT and telephony consultant, author, and technical editor for more than 15 years. He has been a technical trainer for more than 19 years and has taught more than 60 different courses in Cisco, Microsoft, VMware, and Novell. For the last seven years he has specialized in Cisco, and recently Microsoft Unified Communications along with VMware virtualization and Cisco data center technologies. He has done a wide array of IT and telephony consulting for many different companies.\n\n \n\nÃ‚Â·        Identify multisite issues and deployment solutions\n\nÃ‚Â·        Implement multisite connections\n\nÃ‚Â·        Apply dial plans for multisite deployments\n\nÃ‚Â·        Examine remote site redundancy options\n\nÃ‚Â·        Implement Survivable Remote Site Telephony (SRST) and Media Gateway Control Protocol (MGCP) Fallback\n\nÃ‚Â·        Implement CUCM Express in SRST mode\n\nÃ‚Â·        Implement bandwidth management and call admission control (CAC)\n\nÃ‚Â·        Configure device and extension mobility\n\nÃ‚Â·        Apply Service Advertisement Framework (SAF) and Call Control Discovery (CCD)\n\n \n\nThis volume is in the Foundation Learning Guide Series offered by Cisco PressÃ‚Â®. These guides are developed together with Cisco as the only authorized, self-paced learning tools that help networking professionals build their understanding of networking concepts and prepare for Cisco certification exams.\n\n \n","torrent":{"xt":"urn:btih:a2fe47f80c8cef37cb07ce5d1c70c94e99ea58de","amp;dn":"Implementing.Cisco.Unified.Communications.Manager.Part2.2nd.Edit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2fe47f80c8cef37cb07ce5d1c70c94e99ea58de","infoHashBuffer":{"type":"Buffer","data":[162,254,71,248,12,140,239,55,203,7,206,93,28,112,201,78,153,234,88,222]},"announce":[],"urlList":[]}}