{"title":"mahanagar@Kolkata","uid":6758498,"size":731894007,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a55d3958c5b1af3b45bfbecc63b114e86c277b41&amp;dn=mahanagar%40Kolkata&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":1,"time":1319118252,"description":"DDR Presents\n\nMahanagar@Kolkata (2009)\n(A film by Suman Mukhopadhyay)\n\nDVD Rip - 700MB (1-CD) - X.264\n\n\nTech Specifications:\n &lt;a href=&quot;\nhttp://img440.imageshack.us/img440/2570/mahadata.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img440.imageshack.us/img440/2570/mahadata.png&lt;/a&gt;\n\n\nSynopsis:\n\nMahanagar@Kolkata is really a set of three stories: Ek Tukro Nyloner Dori, Amar Kono Bhoy Nei Toh and Angshik Chandragrahan - all written by Nabarun Bhattachraya. Suman Mukhopadhyay the director has described the the cinematographic idea of the film as 'PHOBIA' and 'VIGOR' in a contemporary Indian metropolis like Kolkata. This city and its people are reeling under the contradiction of rapid social developments and innate prejudices of the 'old world.'\n\nEk Tukro Nyloner Dori or a piece of nylon rope is tyhe story of Manmatha (Anjan Dutt) and Jagannath (Biplab Chattopadhyay) who meet by chance at a hospital. Manmatha is one of the elite, while Jagannath is an ordinary man. As Manmatha sees the underbelly the violence and the cruelty of Kolkata at night, he is strangley attracted to Jaggannath, the feraful survivor who urges Manmatha to ignore what is going on around him. As tragedy unfolds, Jagannaths fears too amplify and the piece of nylon rope becomes his only link to sanity...\n\nIn &quot;Amar Kono Bhoy Nei To&quot; (&quot;Do I ahve any cause to fear?&quot;)we come across the elderly Biren (Arun Mukhopadhyay) is constantly in fear for his life as he struggles to eke out a miserable existence. Until one day a local goon Selim decides to cure him of his phobia - with unforeseen circumstances. It is now Selim who asks Do I have anything to fear? It is is plea for mercy as well as his bewilderment at the turn of events.\n\nIn &quot;Angshik Chandragrahan&quot; (&quot;Partial Lunar Eclipse&quot;), Kamalini the marx spouting socialite and her husband Rohit are estranged. Rohit turns to Rongili, but when she becomes pregnant with his child, the age old prejudices come to the fore...\n\nComments:\n\nIt is difficult to really classify this film except to say that it is unrelentingly pessimistic. Each character is hopelessly entangled and each reacts predictably to the crises facing them. In a way, the director is portraying the helplesslness of the individual against fate and the way socirty is developing. Yet there are moments of sheer joy. Take the instance in &quot;Nyloner Dori&quot;, where the members of a mafia are just about to rush to a spot where they will gight a gang war and as they go out, the mafia don rings the bell for the nurse as the patient in the next bed does not seem to be doing well. Or take the brilliant irony of Biren's life. He is fearful of losing his life and yet he falls to the very instance which sought to cure him of this phobia. Kamalini (Sreelekha Mitra) may be a communist but she is a pub hopping one... I wasn't too impressed by the attempts at creating symbolisms (e.g. the women in the last scene). It seemed forced and did not bring out the conflict between tradition and the changing mores all that well.\n\nI was fascinated by the acting of Arun Mukherjee as Biren. The others are good too, but Arun Mukherjee towers over them. Rituparna looks beautiful and Sreelekha does well in her role. Cinematography can be described as dark scenes, darker scenes and even darker scenes. I have seen that done better. I have left the original sound track intact. Editing is competent and helps keep interest. The production qualities of the film (or at least the DVD) leave much to be desired.\n\nUploader's Notes:\n\nThe DVD from Eagle films was typically poor in quality. There was a huge logo taking up nearly 20% of the screen and the colors are oversaturated. I've tried to imrove things a bit, but I must admit that I hhave done better rips in the past. The original AC3 sound has been preserved.\n\nThis film ahs been uploaded in the past by more than one uploader. I have ripped this again because I thought people may still be interested in a good quality rip. Also it was a challenge to tackle the huge logo. I would be glad to get your feedback on my attempts to get rid of it.\n\nIMDB Link:\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1543284/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1543284/&lt;/a&gt;\n\nScreens -\n &lt;a href=&quot;\nhttp://img52.imageshack.us/img52/7605/mahale.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img52.imageshack.us/img52/7605/mahale.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/8ab02b154798292&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/8ab02b154798292&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/cac584154798324&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/cac584154798324&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/153211154798351&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/153211154798351&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/db9b5b154798380&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/db9b5b154798380&lt;/a&gt;","torrent":{"xt":"urn:btih:a55d3958c5b1af3b45bfbecc63b114e86c277b41","amp;dn":"mahanagar%40Kolkata","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a55d3958c5b1af3b45bfbecc63b114e86c277b41","infoHashBuffer":{"type":"Buffer","data":[165,93,57,88,197,177,175,59,69,191,190,204,99,177,20,232,108,39,123,65]},"announce":[],"urlList":[]}}