{"title":"Close Combat III - The Russian Front","uid":6701255,"size":625877110,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a5afb7b05c86b421aeaa90c67e64db701e1cee0f&amp;dn=Close+Combat+III+-+The+Russian+Front&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Smoggy_Hamster","files":1,"time":1316979154,"description":"Close Combat III: The Russian Front is the third game of the Close Combat universe. It was highly acclaimed by many organizations, such as GameSpot, IGN, and Computer Games Magazine. It revolves around the Eastern Front during WWII, and takes players from the invasion of the Soviet Union to the final battle for Berlin in 1945.\n\nGameSpotUK Review:\n\nAt first glance, Close Combat IIII seems a lot like Close Combat II, which in itself is not a terrible thing. The game runs comfortably on older hardware, and thankfully Atomic hasn't jumped on the &quot;every game needs to be 3D&quot; bandwagon that has become so pervasive in the industry. Graphically it looks just like Close Combat II with photo-realistic terrain and smoothly animated units. The sound effects seem a tad bit weaker than in previous games. They still sound great, but Close Combat III doesn't have quite the symphony of death as the previous installment. It could be because the fighting is more spread out, thanks to the larger maps. The size of the maps, which are three times the size of Close Combat II's battlefields, is the first real gameplay difference you'll notice. They give you more room for maneuvering but at the expense of a lot of hurrying up and waiting. The first general difference you'll notice is the enormous scale of the game. Instead of focusing on one operation, Close Combat III focuses on the entire Eastern Front from 1941 to 1945. This opens up a huge array of weapon platforms and troops for dealing death, and hey, variety is always a good thing in a game.\n\nFull Review At:\n\n\nTested &amp; Working, No Serial Needed.","torrent":{"xt":"urn:btih:a5afb7b05c86b421aeaa90c67e64db701e1cee0f","amp;dn":"Close+Combat+III+-+The+Russian+Front","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5afb7b05c86b421aeaa90c67e64db701e1cee0f","infoHashBuffer":{"type":"Buffer","data":[165,175,183,176,92,134,180,33,174,170,144,198,126,100,219,112,30,28,238,15]},"announce":[],"urlList":[]}}