{"title":"Film Theater  3 Films op 1 DVD 5 (Subs Dutch)  TBS","uid":6702755,"size":4708596801,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a9962cb5f83f0958ea7f8e4cfc065e3cd347cea3&amp;dn=Film+Theater++3+Films+op+1+DVD+5+%28Subs+Dutch%29++TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Marjanb","files":-1,"time":1317042223,"description":"\n\nSRT Film Theater 37 3 films op een DVD 5 TBS\n\nTransformers: Dark of the Moon (2011) (Source Retail) (Audio DD 5.1)\n\n\n\nVerenigde Staten\nActie / Sciencefiction\n157 minuten\n\ngeregisseerd door Michael Bay\nmet Shia LaBeouf, Rosie Huntington-Whiteley en Patrick Dempsey\n\nNadat Sam Witwicky is afgestudeerd, lukt het hem niet om werk te vinden en dat zet de relatie met zijn vriendin Carly onder druk. Sam ontdekt dat de NASA tijdens de eerste maanlanding in 1961 een gestrand ruimteschip heeft aangetroffen afkomstig van de planeet Cybertron, waar de moedige Autobots een bittere strijd voerden tegen de boosaardige Decepticons. Wanneer Optimus Prime, de leider van de Autobots, hoort van het ruimteschip op de maan, plant hij een missie om de waardevolle Zuilen aan boord veilig te stellen. Sam ontdekt echter dat de Decepticons hem voor zijn geweest en met de Zuilen een ruimtebrug maken die een heel leger naar de aarde brengt. Kunnen Sam en de Autobots voorkomen dat de Decepticons de mensen tot hun slaven maken?\n\nStoryline\n\nAutobots Bummblebee, Rachet, Ironhide and Sideswipe led by Optimus Prime, are back in action taking on the evil Decepticons, who are eager to avenge their recent defeat. The Autobots and Decepticons become involved in a perilous space race between the U.S. and Russia, to reach a hidden Cybertronian spacecraft on the moon and learn its secrets, and once again Sam Witwicky has to come to the aid of his robot friends. New villain, Shockwave, who rules Cybertron, is on the scene while the Autobots and Decepticons continue to battle it out on Earth.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1399103/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1399103/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/72436&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/72436&lt;/a&gt;\n\n=================================================================================================\n\n\nGreen Lantern (2011) (Source Retail) (Audio DD 5.1)\n\n\nVerenigde Staten\nActie / Sciencefiction\n114 minuten\n\ngeregisseerd door Martin Campbell\nmet Ryan Reynolds, Blake Lively en Peter Sarsgaard\n\nErgens in het universum bestaat er een kleine maar krachtige strijdmacht die al eeuwen bestaan heeft. Beschermers van vrede en recht met de naam Green Lanterns, een broederschap van strijders die gezworen hebben de intergalactische orde te bewaren. Iedere lantern heeft een ring die hem superkrachten geeft, maar wanneer de nieuwe vijand Parallax dreigt de balans in het universum te verstoren ligt het lot van de aarde in handen van hun nieuwste recruit: de eerste mens ooit die ooit geselecteerd is, Hal Jordan (Ryan Reynolds).\n\nStoryline\n\nA cocky test pilot, Hal Jordan ('Ryan Reynolds' ), acquires superhuman powers when he is chosen by &quot;the Ring&quot;, the willpower-fed source of power, of the Green Lantern Intergalactic Corps. He, reluctantly at first, takes on the challenges these superheroes face. Putting his self-doubts aside, and spurred on by his sense of duty and love for his beautiful, intellectually equal, colleague, Carol Ferris (Blake Lively), he is soon called to defend mankind from Parallax, a super-powerful being who feeds on fear. He is the universe's last chance, as many Lanterns have been killed and the Corps is weakened. And he might just be the right Lantern for the job of keeping the world safe from harm. Based on the characters of DC Comics series &quot;Green Lantern&quot;.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1133985/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1133985/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/67767&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/67767&lt;/a&gt;\n\n\n==================================================================================================\n\n\nBunraku (2010) (Retail) (Audio DD 5.1)\n\n\n\nVerenigde Staten\nActie / Drama\n118 minuten\n\ngeregisseerd door Guy Moshe\nmet Josh Hartnett, Woody Harrelson en Ron Perlman\n\nEen geheimzinnige zwerver (Josh Hartnett) en een vurige jonge Japanse strijder Yoshi (Gackt Camui) arriveren allebei in een stad die gedomineerd wordt door een misdaadsyndicaat. Ieder voor zich is geobsedeerd door zijn afzonderlijke missie. Wijzer geworden door het advies van een plaatselijke kroegbaas (Woody Harrelson), besluiten ze samen te werken bij de bestrijding van de misdaad in de stad. Makkelijk krijgen ze het daarbij niet: ze moeten het onder meer opnemen tegen de ontzagwekkend kwade &quot;woodcutter&quot; Nicola (Ron Perlman) en zijn levensgezellin Alexandra (Demi Moore), een femme fatale met een geheim verleden.\n\nStoryline\n\nIn a world with no guns, a mysterious drifter, a bartender and a young samurai plot revenge against a ruthless leader and his army of thugs, headed by nine diverse and deadly assassins. \n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/50425&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/50425&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1181795/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1181795/&lt;/a&gt;\n\n==================================================================================================\n\n Category\t:\tVideo\n Format\t:\tDVD5\n Source\t:\tRetail\n Subtitle\t:\tDutch subs burned\n Genre\t:\tAction Drama Science Fiction\n Files\t:\t105 Files\n Size\t:\t4.6 GB\nCover       :               Yes\n\nEnjoy the Movie's\n\n************************************\n\nKom ook eens kijken :\n &lt;a href=&quot;\nhttp://www.black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.black-sam.org&lt;/a&gt;\n\nEnjoy\n\n*************************************\n\n \t\n\n","torrent":{"xt":"urn:btih:a9962cb5f83f0958ea7f8e4cfc065e3cd347cea3","amp;dn":"Film+Theater++3+Films+op+1+DVD+5+%28Subs+Dutch%29++TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9962cb5f83f0958ea7f8e4cfc065e3cd347cea3","infoHashBuffer":{"type":"Buffer","data":[169,150,44,181,248,63,9,88,234,127,142,76,252,6,94,60,211,71,206,163]},"announce":[],"urlList":[]}}