{"title":"Six faces of dice Bitter Surprises_eng.pdf","uid":6783336,"size":19445365,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:aab513c3d0ae3b85047a917ab100916070097e87&amp;dn=Six+faces+of+dice+Bitter+Surprises_eng.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zorglub3","files":1,"time":1319994134,"description":"Bitter surprises introduction\n\nOriginally, &quot;The Six Faces of Dice&quot; was a six short stories book written by Juan SepÃƒÂºlveda Sanchis. They have now been adapted to comic format, executed by means of the technical expertise of designers HernÃƒÂ¡n Campos, AndrÃƒÂ©s Gimeno, and Alberto Tavira; They have been published by Studiocomix under the supervision of Alfonso EspinÃƒÂ³s and his creative team.\n\nThe first thing that must be said about 6 F.O.D is that, given the experimental nature of the stories, it its difficult to explain what the reader is going to find in this comic. Some of the stories could be thought to fit into genres as diverse as thriller or romance. However, when the reader begins to delve into the subsequent stories, he/she will quickly abandon this idea. It will gradually become more difficult to classify the stories. Puzzling arguments will arise on behalf of other genres and atmospheres that are dreamlike, surreal, nightmarish so the reader will be transported to a different world where nothing is what it seems.\n\nThe six stories will be published independently. \n\nSynopsis Bitter Surprises (Face 1/6):\nIn this unusual comic you will find a story that takes place deep in Spain; more specifically, in a place were no tourist would dare set foot. However, it is in this dark place that Aurelio, a sleazy pimp whose debts have driven him to extremes, operates best. \t","torrent":{"xt":"urn:btih:aab513c3d0ae3b85047a917ab100916070097e87","amp;dn":"Six+faces+of+dice+Bitter+Surprises_eng.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aab513c3d0ae3b85047a917ab100916070097e87","infoHashBuffer":{"type":"Buffer","data":[170,181,19,195,208,174,59,133,4,122,145,122,177,0,145,96,112,9,126,135]},"announce":[],"urlList":[]}}