{"title":"Las Brujas de Mayfair - 1 La Hora de las Brujas - Annie Rice [Ep","uid":6846798,"size":3787017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aaf30a335657adcbd60cdd48ff05a1e2d883e052&amp;dn=Las+Brujas+de+Mayfair+-+1+La+Hora+de+las+Brujas+-+Annie+Rice+%5BEp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"virana","files":-1,"time":1322383159,"description":"La Hora de las Brujas I\n\n\nSinopsis:\n\nMichael Curry es un exitoso contratista profesional, pero sufre extraÃƒÂ±os sueÃƒÂ±os relacionados con su hogar ancestral, en Nueva Orleans. Tras una experiencia cercana a la muerte, desarrolla extraÃƒÂ±os poderes. La persona que le rescata es la doctora Rowan Mayfair, brillante neurocirujana y descendiente de una legendaria familia de dicha ciudad. Ambos se verÃƒÂ¡n obligados a enfrentarse a su sorprendente herencia.\n\nRowan Mayfair llega a ser una  bella y extraordinaria neurocirujana en California, con una habilidad especial para casos mÃƒÂ©dicos desesperados, pero con una vida personal un tanto desordenada y solitaria. Un dÃƒÂ­a salva del ahogamiento a un hombre, Michael Curry, devolviÃƒÂ©ndole a la vida. A partir de entonces, ÃƒÂ©ste comienza a ver retazos de la vida de las personas cuando toca sus objetos... un extraÃƒÂ±o poder que poco a poco estÃƒÂ¡ volviÃƒÂ©ndole loco. Cuando estaba clÃƒÂ­nicamente muerto, varios espÃƒÂ­ritus le obligaron a prometer que cumplirÃƒÂ­a una misiÃƒÂ³n si conseguÃƒÂ­a volver al mundo de los vivos, aunque una vez despierto, un velo de misterio envuelve aquellos momentos, y ÃƒÂºnicamente va recordando ciertos detalles.\nVisiblemente superior a la saga vampÃƒÂ­rica de Anne Rice, Las Brujas de Mayfair supone la combinaciÃƒÂ³n magistral de misterio, terror, violencia y sensualidad, apenas ensayada en Entrevista con el Vampiro y posteriores secuelas. Ambientada en su mayor parte en un duro y evocador entorno, la ciudad de Nueva Orleans y su barrio irlandÃƒÂ©s, donde la autora naciÃƒÂ³ y viviÃƒÂ³ sus primeros aÃƒÂ±os, La Hora de las Brujas (1990) supone el inicio de las aventuras de la antigua y misteriosa familia Mayfair, gobernada por poderosas matriarcas conocedoras de las artes oscuras, cuyo apellido e inmensa fortuna van pasando de generaciÃƒÂ³n en generaciÃƒÂ³n, ya que un antiquÃƒÂ­simo mandato obliga a las herederas de la familia a conservar su apellido de soltera aunque se casen. La saga continÃƒÂºa con La Voz del Diablo (1993) y Taltos (1994), que mejoran aÃƒÂºn mÃƒÂ¡s el estilo narrativo del primer volumen, y dan mÃƒÂ¡s detalles de la historia general que enmarca la intriga. \nSi ya por regla general Rice atrapa al lector en la trama, en La Hora de las Brujas uno queda abrumado, no sÃƒÂ³lo por la profusa cantidad de detalles con los que describe a cada uno de sus personajes y a su entorno, sino por la intrincada maraÃƒÂ±a de acontecimientos aparentemente inconexos que jalonan la narraciÃƒÂ³n. El ovillo cede su maraÃƒÂ±a poco a poco, detalle a detalle, tanto para el lector como para los protagonistas, que se ven inmersos en la confusa red de sentimientos y necesidades primarias que despiertan los acontecimientos.\nLa inquietante presencia que acompaÃƒÂ±a cada capÃƒÂ­tulo en la sombra y condiciona el devenir de la historia va emergiendo poco a poco en cada lÃƒÂ­nea, haciÃƒÂ©ndose mÃƒÂ¡s concreta a medida que los detalles de la vida de los Mayfair van apareciendo ante los ojos del lector, hasta que ÃƒÂ©ste entiende buena parte de lo que va sucediendo como si fuesen eslabones de una cadena, cuyo fin bÃƒÂ¡sico es desencadenar el final.\nDe lectura densa y apasionante, el lector podrÃƒÂ¡ encontrar entre las pÃƒÂ¡ginas del libro las emociones mÃƒÂ¡s bÃƒÂ¡sicas que cualquier persona experimenta cuando su entorno mÃƒÂ¡s ÃƒÂ­ntimo es atacado y violado de forma inevitable y devastadora... aunque los personajes de Rice, siempre poderosos en su propio ÃƒÂ¡mbito, lucharÃƒÂ¡n contra las tremendas fuerzas que amenazan a su familia. \n\nOpiniÃƒÂ³n personal:\n\nEmpieza lento, muy lento (no se cuantas veces intentÃƒÂ© leermelo, creo que fueron 4) pero le cogi el ritmo y me gustÃƒÂ³, no es un libro para nada juvenil, cambia un poco el esquema de lo que suelo leer y la verdad es que la historia esta muy bien centrada y cada personaje aporta algo mas a la trama.\nDeirdre es la que mas me ha gustado,me da mucha pena,por todo lo que ha tenido que pasar y que haya tenido que acabar asÃƒÂ­, por causa de cierta persona (leezlo)\nYo lo recomiendo solo para personas que sean pacientes con los libros, ya que al principio parece aburrido pero despues se anima. Cuando me le empezÃƒÂ©, me lo terminÃƒÂ© al dia siguiente, asique al final me he enganchado a esta serie.","torrent":{"xt":"urn:btih:aaf30a335657adcbd60cdd48ff05a1e2d883e052","amp;dn":"Las+Brujas+de+Mayfair+-+1+La+Hora+de+las+Brujas+-+Annie+Rice+%5BEp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaf30a335657adcbd60cdd48ff05a1e2d883e052","infoHashBuffer":{"type":"Buffer","data":[170,243,10,51,86,87,173,203,214,12,221,72,255,5,161,226,216,131,224,82]},"announce":[],"urlList":[]}}