{"title":"Ulla Pirttijarvi - Mattarahku Askai-In Our Foremothers Arms 2002","uid":6731369,"size":285996184,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:acf440fd7ec8a8cb7917f408b8ec9769d90142a2&amp;dn=Ulla+Pirttijarvi+-+Mattarahku+Askai-In+Our+Foremothers+Arms+2002&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"barber9","files":-1,"time":1318169654,"description":"Contemporary traditional, living culture, innovative folk.Whatever you call it, the music of Sami singer Ulla Pirttijarvi (formerly a member of Girls of Angeli / Angelit) is engaging on a deep, primal level. A simple description is traditional Sami yoik (joik) songs blended with modern instrumentation. But look around the Web, and you'll find many descriptions of yoik that fail to give a sense of the tradition's emotional/spiritual power. Sounding like a cross between Tuvan throat-singing and Native American chants, yoik has a grounded, gutteral sound, heavy and earthy, evoking the harsh northern landscape from which it emerged. At the same time, it's melodic and beautiful, particularly as practiced by Pirttijarvi, who keeps the tradition alive for a new generation by blending it with electronics, beats, and non-traditional instruments.\n\nThe organic feel of this blend may be due, in part, to location: most of the vocals were recorded at Pirttijarvi's home in northern Finland, while much of the instrumentation was recorded in New York. The yoik is within me, she says, and can be brought to the surface whether I'm at home in my own house or standing on a busy corner in New York. But of course - the surroundings will affect the music in different ways.\n\nFrom the windswept opening song Northern Silk, Pirttijarvi progresses through a song about her great-great grandfather set to a hiphop beat (Calkko-Niillas), the blips and bleeps of a modern metropolis (New York), and a wedding yoik (Inger-Mari) that would be right at home in a Bollywood romance. The music and yoik singing style may not be for everyone, but this album is engaging throughout, and producer Frode Fjellheim deftly avoids falling into new age cliches or dull electronica whirlpools, keeping the arrangements fresh and supporting of the main instrument, the fabulous voice Pirttijarvi. Highly recommended. (earball.net/spintheglobe/reviews)\n\n- - -\n\nUlla PirttijÃƒÂ¤rvi - Mattarahku askai - In our foremother's arms  2002\n(Helsingfors Innovator Series)\n\n 1. Nuortta silkkit (Northern silk) \n 2. De juoiggas (Hear the sound of the yoik) \n 3. Calkko-Niillas (They said he was a noaidi)  \n 4. Gadja Nilla (He was rich and famous) \n 5. Ladjogahpir (The traditional SÃƒÂ¡mi hat) \n 6. New York \n 7. Inger-Mari (The wedding yoik for Inger-Mari and Sudhir) \n 8. Njuvccat bohtet (The return of the swan) \n 9. Riddu badjana (The storm is cominh) \n10. Odda aigi (Modern times) \n11. Aigi vassa (Time doesn't stop) \n12. Mattarahku askai (In our foremother's arms)\n\n\nUlla PirttijÃƒÂ¤rvi, joik, frame drum, silver bells\nSveinung Lillebjerka, violin \nGunnar Berg, guitar \nFrode Fjellheim, synt, background vocals\nMattis Kleppen, bass\nHilda LÃƒÂ¤nsman, background vocals\nGaute Solaas, soprano saxophone\nJovan Pavlovi, accordion\n","torrent":{"xt":"urn:btih:acf440fd7ec8a8cb7917f408b8ec9769d90142a2","amp;dn":"Ulla+Pirttijarvi+-+Mattarahku+Askai-In+Our+Foremothers+Arms+2002","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acf440fd7ec8a8cb7917f408b8ec9769d90142a2","infoHashBuffer":{"type":"Buffer","data":[172,244,64,253,126,200,168,203,121,23,244,8,184,236,151,105,217,1,66,162]},"announce":[],"urlList":[]}}