{"title":"Rhoda (1974) - The Wedding Episode (Iconic TV Moment)","uid":6854233,"size":526196691,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:add38a0386b0fedc87f4c0b65437d44aee75eb81&amp;dn=Rhoda+%281974%29+-+The+Wedding+Episode+%28Iconic+TV+Moment%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1322639620,"description":"Rhoda's Wedding (Season 1, Episodes 8-9)\n\nVideo Codec.: XviD ISO MPEG-4 \nVideo Bitrate..: 1159kbps \nDuration.: 51:24.245\nResolution..: 600*458 \nFramerate: 29.970 \nAudio Codec.: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate..: 192 kbps CBR \nAudio Channels.: 2 \nFilesize.: 525,647,202 \nNo SUBTITLES\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0685881/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0685881/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Rhoda&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Rhoda&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/JAlcKAAdD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/JAlcKAAdD&lt;/a&gt;\n\n\nRhoda's wedding\n\nEight weeks into the series on Monday, October 28, 1974, Rhoda and Joe were married in a special hour-long episode which broke several television records. Heavily publicized, it became the highest-rated television episode of the 1970s, a record it held until the miniseries Roots claimed that title in 1977. Additionally, on the night of its airing it had the distinction of being the second most-watched television episode of all time, only slightly surpassed by the birth of Little Ricky in I Love Lucy in 1953. It was watched by more than 52 million Americans, over half of the US viewing audience. At the conclusion of the episode, Monday Night Football host Howard Cosell knowing that few had been watching the football game up to that point joked on the air that he had not been invited to the wedding, and welcomed viewers back to the game. Hundreds of &quot;wedding parties&quot; were held by fans across the United States on the night of the episode to celebrate the television wedding, and within days the CBS-TV studios were inundated with wedding gifts sent in by fans for the fictional Joe and Rhoda Gerard.[10] The episode was overwhelmingly praised by critics, widely touted as a &quot;television phenomenon&quot;, &quot;unlike anything that had happened on television for nearly twenty years&quot;, and garnered Harper her fourth Emmy award in 1975.[13] Vogue magazine reported that people across the country pulled off the road into motels, and friends cancelled out on dinner invitations (feigning illness), just to watch Rhoda's wedding.\n\nThe wedding episode featured guest appearances by many of the main characters from The Mary Tyler Moore Show, including Mary Richards (Mary Tyler Moore), Lou Grant (Edward Asner), Murray Slaughter (Gavin MacLeod), Georgette Franklin (Georgia Engel), and Phyllis Lindstrom (Cloris Leachman). The only major characters who didn't attend were Ted Baxter (played by Ted Knight) and Sue Ann Nivens (played by Betty White).\n\nIn The Mary Tyler Moore Show episode &quot;The New Sue Ann,&quot; airing Saturday, October 26, 1974, two days before Rhoda's Wedding, the characters frequently discuss the upcoming event and buy wedding gifts. At the end of the episode Murray and Lou leave the TV station to drive Mary to the airport. During Rhoda's Wedding it is revealed that on a lark they had all decided to fly to New York to surprise Rhoda, including her frequent nemesis, Phyllis, who had intentionally not been invited. During the episode, Phyllis asks for the opportunity to participate in the wedding and is appointed the responsibility to pick up Rhoda at Brenda's Manhattan apartment and drive her to her parents' apartment in the Bronx where the ceremony is being held. The self-absorbed and forgetful Phyllis neglects to keep her promise. This forces Rhoda to take the subway, running through the streets of Manhattan and the Bronx fully regaled in her wedding dress and veil, crossing the Grand Concourse and dashing into her parents' apartment building in one of the most memorable and iconic moments in the history of series television. Ida, in a state of shock, refuses Phyllis's profuse apologies saying &quot;I'll kill you&quot;. Phyllis begs everyone in the room to forgive her, but the only one who does is Georgette, who then suggests to Phyllis that she leave before Rhoda arrives. The episode also features special closing credits, showing additional footage of Rhoda (Harper) running down a Manhattan street in her wedding dress and veil accompanied by an alternative version of the theme song played to the tune of Mendelssohn's Wedding March.\n\nCast\n\nValerie Harper\t \tRhoda Morgenstern Gerard\nDavid Groh\t \tJoe Gerard\nJulie Kavner\t \tBrenda Morgenstern\nEdward Asner\t \tLou Grant\nGeorgia Engel\t \tGeorgette Franklin\nHarold Gould\t \tMartin Morgenstern\nCloris Leachman\t \tPhyllis Lindstrom\nGavin MacLeod\t \tMurray Slaughter\nMary Tyler Moore\tMary Richards\nNancy Walker\t \tIda Morgenstern\nLorenzo Music\t \tCarlton, the Doorman (voice) (as L. Music)\n","torrent":{"xt":"urn:btih:add38a0386b0fedc87f4c0b65437d44aee75eb81","amp;dn":"Rhoda+%281974%29+-+The+Wedding+Episode+%28Iconic+TV+Moment%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"add38a0386b0fedc87f4c0b65437d44aee75eb81","infoHashBuffer":{"type":"Buffer","data":[173,211,138,3,134,176,254,220,135,244,192,182,84,55,212,74,238,117,235,129]},"announce":[],"urlList":[]}}