{"title":"Berg - Mazur - Willemark - Stemmenes skygge 2005","uid":6734708,"size":237862305,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ae0e1e75878d9cf55d02214a7a8dedbc9f10644d&amp;dn=Berg+-+Mazur+-+Willemark+-+Stemmenes+skygge+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"barber9","files":-1,"time":1318285593,"description":"It all began as a concert with dance premiered at the Molde International Jazz Festival in 2000. Five years later brought the CD release of Stemmenes skygge (Shadow of Voices)\n\nNorway's foremost ambassador of traditional music, Kirsten BrÃƒÂ¥ten Berg, and Sweden's Lena Willemark are two of the most prominent performers of vocal folk music in the Nordic Countries. Together with the leading Danish percussionist Marilyn Mazur they have made a recording which crosses far more borders than mere geographical ones.\n\nStemmenes skygge is based on Nordic medieval ballads, and an intense relationship between its contrasts characterizes this journey in music, moods, and changing folk rhythms.\n\nThe CD was recorded at Sun Studio in Copenhagen, August 2003, and was produced by Asle Karstad with technical assistance from Bjarne Hansen and Jan Erik Kongshaug.\n\nLena and Kirsten have been close friends for nearly fifteen years and have worked together on many courses and concerts. The idea grew to create a joint project featuring the voices of both. Stemmenes skygge developed from a common Nordic heritage and tradition. The regional Norwegian dialects in Alvdal and Setesdal have retained much of their old Norse roots. Nordic songs and medieval ballads provided the basis for the project, and were coloured with Marilyn's wonderful playing. A chance encounter with the dancer Ingrid Lorentzen was decisive; she had long wished to dance to medieval ballads!\n\nStemmenes skygge became a performance embracing mysticism and longing, love and suppressed emotions. A dance about life, to songs and ballads addressing the major existential questions.\n\n- - -\n\nKirsten BrÃƒÂ¥ten Berg was born in Arendal, Norway, in 1950, and is known first and foremost for her unique style of singing, though she also runs a silver workshop in Setesdal where she has lived since 1973. Over the years she has presented traditional music in new contexts, and has been instrumental in developing and passing on local music traditions.\n\nKirsten BrÃƒÂ¥ten Berg has won many prizes, performed in Norway and abroad, and released a great number of recordings. She has collaborated with, among others, Hallvard T. BjÃƒÂ¶rgum and Arild Andersen, and has been involved in Scandinavian and African projects. She has contributed invaluably to renewing folk music traditions in Norway - and the rest of the world, reminding us that folk music exists across the boundaries of language and culture.\n\nMarilyn Mazur was born in New York in 1955 and has lived in Denmark since she was six. Her musical career has been highly varied: as pianist and composer she started her first band, Zirenes, in 1973, and has been part of innumerable line-ups since. Marilyn has worked with other leading international musicians in many different genres, though she has developed her own unique style. Since 1991 Marilyn Mazur has been a regular member of the Jan Gabarek Group, and in addition to her work with this and other projects, she is an active composer.\n\nLena Willemark is one of Sweden's leading interpreters of traditional folk music. She was born in the small village of Evertsberg in 1960; the folk music heritage is at the root of her music-making. Her encounter with jazz at the Royal College of Music in Stockholm led to a fusion of these two distinct styles, giving her the unique artistic voice she has today. Together with Ale MÃƒÂ¶ller in the Nordan project she was awarded a Swedish Grammy and the German Preis der Deutschen Schallplattenkritik in 1994. Following a recording with Frifot for ECM Records, contributions to a number of other critically acclaimed recordings and performances on radio and television, Lena Willemark is acknowledged as a world-class singer and musician. (.cdroots.com)\n\n- - -\n\n\nKirsten BrÃƒÂ¥ten Berg-Marilyn Mazur-Lena Willemark - Stemmenes skygge-\ntradisjonell musikk gammel og ny fra Norge, Sverige, Danmark og FaeÃƒÂ¶yene \n(Oslo Heilo 2005)\n\n 1. I skyggelandet  \n 2. Agnus Dei \n 3. Rike mannens sjÃƒÂ¤l  \n 4. Huvkraft \n 5. Gammelspaken polskan  \n 6. Ljom \n 7. Edh buser  \n 8. PÃƒÂ¥l Karl polskan \n 9. Varulven \n10. Valivan\n\n\nKirsten BrÃƒÂ¥ten Berg, sÃƒÂ¥ng, mungiga \nMarilyn Mazur, percussion, sÃƒÂ¥ng \nLena Willemark, sÃƒÂ¥ng, violin, altviolin\n","torrent":{"xt":"urn:btih:ae0e1e75878d9cf55d02214a7a8dedbc9f10644d","amp;dn":"Berg+-+Mazur+-+Willemark+-+Stemmenes+skygge+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae0e1e75878d9cf55d02214a7a8dedbc9f10644d","infoHashBuffer":{"type":"Buffer","data":[174,14,30,117,135,141,156,245,93,2,33,74,122,141,237,188,159,16,100,77]},"announce":[],"urlList":[]}}