{"title":"Democracy Now - 29 sep 2011","uid":6710122,"size":458192694,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:aeb1d4fa7c0408fed7fec230e4096df88a5ab5ed&amp;dn=Democracy+Now+-+29+sep+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1317320495,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 29, 2011\n\n- White House Seeks Supreme Court Ruling on Healthcare Law\n- Judge Upholds Key Parts of Alabama Immigration Law\n- Study: Hispanic Children Largest Group Living in Poverty\n- Afghan Violence Increases 40%\n- Clinton: U.S. Nearing Decision on Haqqani Designation\n- U.N. Security Council Committee Takes Up Palestinian Statehood Bid\n- Obama: U.S. to Continue Cuba Embargo\n- 20 Bahraini Medical Workers Sentenced to Prison\n- Gitmo Prisoner Faces Death Penalty in Resumed Military Trial\n- Massachusetts Man Accused of Plot to Attack Pentagon, Capitol\n- Pennsylvania Prison Guard Charged With Sexual, Physical Abuse of Prisoners\n- Free Press Challenges New Internet Rules\n- State Dept. Holds Public Hearings on Keystone XL Tar Sands Pipeline\n- NYPD Investigating Officer for Pepper-Spraying Wall Street Protesters\n\n\nSpecial reports\n\n- Michael Moore: Man Interviewed by Democracy Now! on Troy Davis Execution Inspired My Georgia Boycott\n\nFilmmaker Michael Moore was a part of the global audience tuning in for Democracy Now!'s live coverage from outside the Georgia prison where death row prisoner Troy Davis was executed on September 21. Moore describes how he was inspired by one of the people Democracy Now! host Amy Goodman interviewed on the scene after news of the execution was announced. The man, who introduced himself as Wesley Boyd, immediately called for a boycott of the state of Georgia in response to Davis' execution. Moore says he then asked his publisher to recall all copies of his new book from stores in Georgia, saying, &quot;I don't want any commerce being done in my name in the state of Georgia.&quot; When he was told the books were already on the shelves, Moore decided to donate proceeds from the sales in the state to the Innocence Project and a voter registration drive. He also discusses his previous work on the case of a death row prisoner who shares his name, a topic he writes about in the chapter, &quot;The Execution of Michael Moore,&quot; in his new memoir Here Comes Trouble: Stories from My Life.\n\n\n- Michael Moore: Health Insurers Use Costlier Premiums to Fund Campaigns Against Critics Like Me\n\nHealthcare costs for insured working Americans continue to rise, with premiums increasing 9 percent for family plans over the past year. In this part of our interview with filmmaker and author Michael Moore, he discusses how health insurers have used the funds they receive from premiums to try to undermine their critics, including Moore himself. A health insurance company whistleblower, Wendell Potter, previously revealed in a Democracy Now! interview how industry executives plotted to undermine Moore's 2007 film &quot;SiCKO,&quot; which took on the for-profit U.S. healthcare system.\n\n\n- Michael Moore Backs Call to Re-Open Investigation of 9/11 Attacks\n\nIn his film &quot;Fahrenheit 9/11,&quot; Michael Moore explored the complex ties between Bush administration officials and associates, the Saudi Royal family, and those believed to have carried out the 9/11 terrorist attacks on the United States. Today, Moore is backing former Florida governor and senator Bob Graham's call for President Obama to reopen the investigation into 9/11 after new information emerged about the possible role of prominent Saudis. According to recent news reports, a wealthy young Saudi couple fled their home in a gated community in Sarasota, Florida, just a week or so before Sept. 11, 2001, leaving behind three cars and nearly all of their possessions. &quot;There are many unanswered questions and they should be answered,&quot; Moore says. He also was targeted by his critics for this film. Moore talks about how the Bush administration worried the movie would hurt Bush's re-election chances, and how he found out that he ranked second behind then-President Bush on the number of discovered plots to attack him.\n\n\n- Nobel Peace Prize, Right Livelihood Winner Wangari Maathai (1940-2011)\n\nThe Kenyan environmentalist Wangari Maathai, the first African woman to win the Nobel Peace Prize, died on Sunday at the age of 71 after a battle with cancer. In 1977, she spearheaded the struggle against state-backed deforestation in Kenya and founded the Green Belt Movement, which has planted tens of millions of trees in the country. She has also been an outspoken advocate for women's rights and democratic development. In 1984 ,she won the Right Livelihood Award. Twenty years later, she won the Nobel Peace Prize, becoming the first African woman to do so. We air excerpts of her 2009 interview on Democracy Now! and of her 2004 speech when accepting the Nobel Peace Prize.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:aeb1d4fa7c0408fed7fec230e4096df88a5ab5ed","amp;dn":"Democracy+Now+-+29+sep+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aeb1d4fa7c0408fed7fec230e4096df88a5ab5ed","infoHashBuffer":{"type":"Buffer","data":[174,177,212,250,124,4,8,254,215,254,194,48,228,9,109,248,138,90,181,237]},"announce":[],"urlList":[]}}