{"title":"DEADKENNEDYS-The Early Years-xvid-ac3/2-mkv","uid":6701809,"size":750499893,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:af1fa549169980c78ab4d55c7278e45ecbe28e1e&amp;dn=DEADKENNEDYS-The+Early+Years-xvid-ac3%2F2-mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lurkinator","files":1,"time":1317005410,"description":"DEADKENNEDYS-The Early Years\n\nThis 30 minute VHS features the seminal punk band Dead Kennedys, live from their early years at various venues, including the Mabuhay Gardens, the Sproul Plaza at Berkeley and at Target Studios between 1978 through 1981. Much of the material is from the classic &amp; critically acclaimed debut LP &quot;Fresh Fruit for Rotting Vegetables.&quot; In addition to 9 live songs, there is also hilarious news footage from Jello Biafra's notorious Mayoral candidacy in San Francisco (In which he came in fourth!) Special DVD features include a Sing-a-long option, band biographies, Dolby Digital Stereo and a chapter search by songs.\n\nLed by the radical and charismatic punk poet Jello Biafra, the Dead Kennedys are one of America's seminal punk bands. One of the most influential political punk bands, DK took a stance against the American government, capitalism, and of course, corporate rock. THE EARLY YEARS LIVE brings the viewer back to the band's beginnings, compiling live footage from 1978 to 1981. Filmed at various locations, including Berkeley's Sproul Plaza and Target Studios, these performances feature much of the material off of the 1978 FRESH FRUIT FOR ROTTING VEGETABLES record. In addition, news clips tracking Jello Biafra's legendary attempt at San Francisco mayorhood is included. \n\n\nXvid-mkv\nac3/2ch  original audio.\n\nEnjoy\n","torrent":{"xt":"urn:btih:af1fa549169980c78ab4d55c7278e45ecbe28e1e","amp;dn":"DEADKENNEDYS-The+Early+Years-xvid-ac3%2F2-mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af1fa549169980c78ab4d55c7278e45ecbe28e1e","infoHashBuffer":{"type":"Buffer","data":[175,31,165,73,22,153,128,199,138,180,213,92,114,120,228,94,203,226,142,30]},"announce":[],"urlList":[]}}