{"title":"Fahrenheit Portable - [Espera]","uid":6772710,"size":2008755785,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:af21a5c7188eaefb844bf0f417d6905bf71d1f6f&amp;dn=Fahrenheit+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1319588198,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Fahrenheit 1 Click.exe&quot;\n3.Enjoy.\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nFahrenheit, also known as Indigo Prophecy in North America, is a cinematic adventure video game developed by Quantic Dream and manufactured and marketed by Atari Europe SAS.[1] According to the Quantic Dream website, Fahrenheit has sold over 700,000 units worldwide since it was released in September 2005,[2] and it has won several awards.\n\nIn this paranormal thriller, New York City is stunned by a series of mysterious murders that follow the same pattern: ordinary people become possessed and kill absolute strangers in public. The main characters of the story must uncover the supernatural forces behind his crime.\n\nA good deal of publicity was generated from the developer's rejection of conventional game genre labeling for the title; Quantic Dream prefers to brand it as the first truly &quot;interactive film&quot; rather than an adventure or third-person action title. This game features a large amount of motion captured animation as well as branching story lines, split screen cameras and an interface designed to be intuitive and realistic. Event triggers in the game are also mainly time-based, as opposed to the more common player-initiated progression found in most games.\n\nConsole versions of the game eschew most of the traditional methods of control, making minimal use of the face buttons on the controller, instead using twin analog sticks for almost all player actions. The left stick controls movement of the character, and the right is used for context-sensitive actions. For instance, when Lucas approaches his table at the diner in the opening scene, one direction may cause him to take a seat, while another makes him examine his bill, and a third lets him pick up his drink and take a sip. The available options are displayed with simple diagrams at the top of the screen. More complex motions, such as climbing a fence or spinning a yo-yo in &quot;around the world&quot; fashion, require controller motions akin to those used for special moves from conventional fighting games.\n\nSystem requirements: Processor: Pentium III 800 MHz or faster, 256MB RAM, 32 MB Hardware T&amp;L-compatible video card, compatible sound card, DVD-ROM Drive, 4.0 GB free HDD space","torrent":{"xt":"urn:btih:af21a5c7188eaefb844bf0f417d6905bf71d1f6f","amp;dn":"Fahrenheit+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af21a5c7188eaefb844bf0f417d6905bf71d1f6f","infoHashBuffer":{"type":"Buffer","data":[175,33,165,199,24,142,174,251,132,75,240,244,23,214,144,91,247,29,31,111]},"announce":[],"urlList":[]}}