{"title":"Albert King-Funky London(blues((mp3@320)[rogercc]","uid":6705640,"size":100325584,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:affcdfd40a07cd805bfb67c16497e1cf1bdc9ca9&amp;dn=Albert+King-Funky+London%28blues%28%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rogercc1","files":8,"time":1317146961,"description":"ALBERT KING FUNKY LONDON\nLabel: Stax\nReleased:1994\nFormat:Mp3@320\n\nAlbert King cut his teeth on the blues circuits of Arkansas and St. Louis, developing his style in a number of electric outfits. His recording career was, at least initially, erratic, though the quality of the sides he cut for the Parrot, King, and Coun-Tree imprints certainly was not. It wasn't until King signed to Stax in 1966, however, and the guitarist's electric blues fused with the muscular bass, funky guitars, and sparkling horns of the label's outstanding session players, that he found his first home. King stayed with the label for eight years, leaving only when Stax was entering its financial decline. Funky London manages to dig up a few from the period that nearly got away, compiling three 45 sides and six unreleased tracks. The singles include a pair of instrumentals (a cover of James Brown's &quot;Cold Sweat&quot; and &quot;Funky London,&quot; a dispensable, up-tempo 12-bar workout) and one vocal (&quot;Can't You See What You're Doing to Me&quot;). By the nature of the material, those songs and the six that follow lack the cohesiveness of an album, though the quality of the music ultimately prevails. Downshifting for &quot;Lonesome,&quot; the combo is steeped in the blues. After a false start (&quot;What's the matter with y'all!?&quot; asks King), the band begins again, King's crying guitar lines joined by keyboard commentary, smoky threads of wah-wah guitar and an exquisite horn arrangement. &quot;Sweet Fingers&quot; is an excellent example of funky blues ensemble playing and &quot;Driving Wheel&quot; a fine interpretation of the Roosevelt Sykes tune. Perhaps most important is the fact that the majority of the music here maintains the standards established on King's official Stax releases, making this a desirable set. ~ Nathan Bush\n\nRecording information: Stax Studios, Memphis, TN (01/07/1970-01/29/1974).\n\n\nTracklist\n1 Cold Sweat 5:21 \n2 Can't You See What You're Doing to Me 4: \n3 Funky London 3:19 \n4 Lonesome  8:46 \n5 Bad Luck 5:54 \n6 Sweet Fingers 5:18 \n7 Finger on the Trigger 4:02 \n8 Driving Wheel 4:47 \n9Lovingest Woman in Town 10:46\n\nPersonnel includes: Albert King (vocals, guitar); Bobby Manuel (guitar, keyboards); Michael Toles (guitar); Harvey Henderson (tenor saxophone); Ben Cauley (trumpet); Winston Stewart, Lester Snall (keyboards); James Alexander, Donald &quot;Duck&quot; Dunn (bass); Willie Hall (drums).\n\n","torrent":{"xt":"urn:btih:affcdfd40a07cd805bfb67c16497e1cf1bdc9ca9","amp;dn":"Albert+King-Funky+London%28blues%28%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"affcdfd40a07cd805bfb67c16497e1cf1bdc9ca9","infoHashBuffer":{"type":"Buffer","data":[175,252,223,212,10,7,205,128,91,251,103,193,100,151,225,207,27,220,156,169]},"announce":[],"urlList":[]}}