{"title":"POtHS 4 - Conspiracy Facts - Part 26 - Secret Societies - Nibiru","uid":7412316,"size":1866617971,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b0ee36766531aa91e957730f13cfddac393c3565&amp;dn=POtHS+4+-+Conspiracy+Facts+-+Part+26+-+Secret+Societies+-+Nibiru&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":72,"time":1341419794,"description":"POtHS 4 - Conspiracy Facts - Part 26 - Secret Societies - Nibiru 2012\n\n\nPOtHS Comments on This one: Planet X\n\nI still haven't reached any conclusions on Nibiru..I guess when I CAN SEE IT IN THE SKY myself I will believe it. Keep your eyes on the SKY my friends, everything is happening in The Sky. Keep your heads, search the Heavens not The Earth. Signs and Wonders are already happening in the SKY.\n\nMan has been waiting for these Days for 5000 years or So. Think of All the Billion and Billions of Earth residents that steadfastly waited for this time that we are living in now but died before seeing the Return of Jesus Christ. DO NOT WASTE YOUR TIME ON EARTHLY FOOLISHNESS. You have everything that you need....except a one year supply of food for every member of your family, two would be better. Then you will need a wheel barrow full of Ammunition to protect your food from the starving millions that did not believe in The Return of Jesus Christ. Better start taking some self defenses courses too. You will need a way to get water and a heating source, you can build cheep. or\n\nYou can Pray for The Rapture. In the twinkle of an eye we will elevated to the Clouds where we meet Jesus!!! We will watch this End Times Scenario play out from The Heavens. Jesus DOES NOT USE SPACECRAFT. DO NOT BE DECEIVED. a litttle PLANNING FOR YOUR TRIP THROUGH ETERNITY IS HIGHLY RECOMMENDED.\n\nDescription:\nPlanet X - NIBIRU and The Nephilim Return\nSteve Quayle and Tom Horn - Alien Stargates and The Nephilim\nMisc. Unsorted Nibiru Videos\nChuck Missler\nMore\n\n\n","torrent":{"xt":"urn:btih:b0ee36766531aa91e957730f13cfddac393c3565","amp;dn":"POtHS+4+-+Conspiracy+Facts+-+Part+26+-+Secret+Societies+-+Nibiru","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0ee36766531aa91e957730f13cfddac393c3565","infoHashBuffer":{"type":"Buffer","data":[176,238,54,118,101,49,170,145,233,87,115,15,19,207,221,172,57,60,53,101]},"announce":[],"urlList":[]}}