{"title":"The Casebook of Victor Frankenstein - Peter Ackroyd","uid":6775991,"size":238706718,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b1d075355f2882fcb5e1abbeca3541017e1cd70e&amp;dn=The+Casebook+of+Victor+Frankenstein+-+Peter+Ackroyd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neil1966hardy","files":13,"time":1319728773,"description":"Unabridged and read by Nick Rawlinson. 11 hours 2 mins duration. 11 CD's. (48 kbps / 44 kHz Mono Fraunhofer CBR, using jetAudio 8+)\n\n\n[2008]\nPeter Ackroyd's imagination dazzles in this brilliant novel written in the voice of Victor Frankenstein himself. Mary Shelley and Shelley are characters in the novel. It was at Oxford that I first met Bysshe. We arrived at our college on the same day; confusing to a mere foreigner, it is called University College. I had seen him from my window and had been struck by his auburn locks. The long-haired poet - 'Mad Shelley' - and the serious-minded student from Switzerland spark each other's interest in the new philosophy of science which is overturning long-cherished beliefs. Perhaps there is no God. In which case, where is the divine spark, the soul? Can it be found in the human brain? The heart? The eyes? Victor Frankenstein begins his anatomy experiments in a barn near Oxford. The coroner's office provides corpses - but they have often died of violence and drowning; they are damaged and putrifying. Victor moves his coils and jars and electrical fluids to a deserted pottery and from there, makes contact with the Doomesday Men - the resurrectionists. Victor finds that perfect specimens are hard to come by . . . until that Thames-side dawn when, wrapped in his greatcoat, he hears the splashing of oars and sees in the half-light the approaching boat where, slung into the stern, is the corpse of a handsome young man, one hand trailing in the water. . . .\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:b1d075355f2882fcb5e1abbeca3541017e1cd70e","amp;dn":"The+Casebook+of+Victor+Frankenstein+-+Peter+Ackroyd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1d075355f2882fcb5e1abbeca3541017e1cd70e","infoHashBuffer":{"type":"Buffer","data":[177,208,117,53,95,40,130,252,181,225,171,190,202,53,65,1,126,28,215,14]},"announce":[],"urlList":[]}}