{"title":"Songs of Green Pheasant...Gyllyng Street(2007)[FLAC]","uid":6705958,"size":221468265,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b1dd8e2bce28f795dd5a1f68b2f4ae99d7c5227f&amp;dn=Songs+of+Green+Pheasant...Gyllyng+Street%282007%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":12,"time":1317162878,"description":"\n[color=Green]Gyllyng Street [2007]  FatCat Records / FATCD61[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1. Boats (5:02)\n2. King Friday (3:31)\n3. The Ballad of Century Paul (4:08)\n4. West Coast Profiling (8:15)\n5. Alex Drifting Alone (8:02)\n6. Fires P.G.R. (4:53)\n7. A Sketch for Maenporth (8:15)\n\n\nDon't get me wrong-- I love kids. I love them so much that I cling to my belief that they're simply miniature, catastrophically insane humans, not evil geniuses from space, despite all evidence to the contrary. Nevertheless, it's no secret to anyone that the little tykes are getting crazier and crazier all the time. Some blame reality television, or MySpace, or violent video games, but I have a pet theory-- their teachers are all too busy recording indie rock into their four-tracks, trying to nail that perfect balance of mono guitar lines and tape hiss, to properly socialize the brood. Seriously, can you imagine Bob Pollard being one of your formative models for responsible adulthood?\n\nLike the prolific GBV frontman, Duncan Sumpner is a teacher whose bedroom dabbling snuck into our earbuds via a side door marked &quot;outsider artist.&quot; Unlike Pollard, Sumpner's debut album didn't convey the impression that catchy indie rock nuggets effortlessly sifted off of him like dead skin cells. His hazy, lugubrious folk songs were carefully tended moods, not Pollard's weird-pop epiphanies, and while the album was garlanded by the crown prince of new folk, Devendra Banhart, I found the title highly ironic-- where, in fact, were the songs? On his debut, Sumpner was a whiz with tone and color, but to hear one of his sepia-toned dirges was to have heard them all.\n\nPitchfork enthused over the album, but even we admitted that it &quot;lacked enough swirling builds and surprises to sustain its initial birr over 10 tracks.&quot; The same cannot be said of Gyllyng Street, which trades early Pheasant's lo-fi folk for expansive, psychedelic shoegaze, with improved results. What Sumpner's voice actually adds to the music remains questionable-- for the most part, it's an unintelligible moan that seems dwarfed by the clear-cutting percussion and long arcs of eldritch guitar. But the music is buoyed up by a newfound flair for drama, unfurling with magisterial simplicity, and while it retains that homespun feel, it sounds larger by several orders of magnitude. &quot;Boats&quot; starts off drizzly, but instead of petering out, it limps toward a glistering guitar lead crescendo, while the cascading reverb of &quot;King Friday&quot; eventually, through a maze of growling distortion and capering piano keys, hits on an honest-to-god groove.\n\nGyllyng Street also makes Sumpner seem more team-player than lone-gunman-in-the-bell-tower. It has a feeling of collaborative spontaneity that you just can't access when multi-tracking yourself, and even loosely arranged songs that resemble those from the debut, like &quot;The Ballad of Century Paul&quot;, sound livelier. And trumpeter Clive Scott proves to be Songs of Green Pheasant's most valuable player: He scores the record's best moment on &quot;Alex Drifting Alone&quot;, when his mournful theme returns with ragged emphasis for a weary yet triumphal climax. It's a warm, welcome contrast to the glassy hymns, &quot;West Coast Profiling&quot; and &quot;Fires P.G.R.&quot;, that bookend it. If our teachers keep cranking out music like this, little Johnny may never learn to read properly, but at least he'll have some enchanting tunes to succor him through his illiteracy.\n\ncd ripped by EAC  inasafeplace \n\nplease seed\n\n[url]http://dickthespic.org/2011/09/20/songs-of-green-pheasant/[/url]\n\n\n","torrent":{"xt":"urn:btih:b1dd8e2bce28f795dd5a1f68b2f4ae99d7c5227f","amp;dn":"Songs+of+Green+Pheasant...Gyllyng+Street%282007%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1dd8e2bce28f795dd5a1f68b2f4ae99d7c5227f","infoHashBuffer":{"type":"Buffer","data":[177,221,142,43,206,40,247,149,221,90,31,104,178,244,174,153,215,197,34,127]},"announce":[],"urlList":[]}}