{"title":"20111027-Stossel-[Stupid Consumers]-Fox Business.CF.avi","uid":6780613,"size":367255494,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b234b6b8abb2befa302e238320203103c844c8c6&amp;dn=20111027-Stossel-%5BStupid+Consumers%5D-Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1319885867,"description":"----------\n\nSTOSSEL - [Stupid Consumers] - Fox Business Network\n2011, October 27, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\nWere it not for the protective coercion of government in the &quot;public&quot; interest, checking the inherent evil of doing business, consumers would be exploited mercilessly. Thank goodness for beneficent government!\n\nJohn Stossel attempts to convince viewers that this commonplace notion is all wrong.\n\n[excerpted from John Stossel's blog:]\n\nI built my career doing consumer reporting, exposing bad businesses for pulling scams on people. I called for more government regulation. This kind of thing won me 19 Emmy awards.\n\nNow I realize that I had it wrong. The free market deters and punishes scams better than regulation does. Also, government rips-off more people than business ever does.\n\nAnother point: some consumers are just stupid.\n\nTo illustrate this, tonight we turn to Candid Camera. We'll show video of a blind taste test, in which consumers are asked to analyze the differences between several glasses of wine. They find &quot;differences&quot; even though every glass is the same. In another experiment, people vividly describe the &quot;smell&quot; from a perfume that is actually just water.\n\nThese Candid Camera bits are funny, but they prove a serious point. Consumers fall for everything, including bogus &quot;eco fads&quot; like cage free eggs, organic produce, and much more.\n\nWhy consumers are stupid, but DON'T need protection from government. That's my show, tonight.","torrent":{"xt":"urn:btih:b234b6b8abb2befa302e238320203103c844c8c6","amp;dn":"20111027-Stossel-%5BStupid+Consumers%5D-Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b234b6b8abb2befa302e238320203103c844c8c6","infoHashBuffer":{"type":"Buffer","data":[178,52,182,184,171,178,190,250,48,46,35,131,32,32,49,3,200,68,200,198]},"announce":[],"urlList":[]}}