{"title":"Nicolai Dunger - Nicollide and the carmic retribution 2008","uid":6732503,"size":244865663,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b25f9d8ca2bae39fe5214171fd090f9bd1046208&amp;dn=Nicolai+Dunger+-+Nicollide+and+the+carmic+retribution+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"barber9","files":-1,"time":1318209614,"description":"The lovely black-and-white cover photo of an old-school chandelier, combined with the film stock incorporated into the graphic design, suggests that the inelegantly titled Nicollide &amp; the Carmic Retribution is eclectic Swedish singer/songwriter Nicolai Dunger's move into a lush, cinematic musical form as opposed to his usual back and forth shifts between sparse country-influenced folk-rock and quirky modern jazz in the company of the EsbjÃƒÂ¶rn Svensson Trio. The truth is that Nicollide &amp; the Carmic Retribution is something closer to Dunger's version of Van Dyke Parks' lavishly overstuffed 1968 debut Song Cycle: the orchestral sweep is present here, but it doesn't replace Dunger's previous chosen musical styles so much as it fuses those disparate styles into one at times deeply odd whole. The stark Will Oldham-style twang of There's a Room and the haunted Lee Hazlewood vibe of Too Free to Be Gone, would have fit neatly on Dunger's alt-country breakthrough Tranquil Isolation, while the lengthy unaccompanied piano solo of opening track 10th Anniversary Collide, is pure Svensson-style contemporary jazz, but through the presence of beautifully orchestrated, melancholy passages like Our Filmscore and Picking Up the Pieces, the album's eclectic threads coalesce into an unexpectedly elegant and satisfying whole. There are moments of Dunger's familiar oddity, Lifelong Song imagines what might have happened if Charles Ives had done the orchestral charts for Nick Drake's Bryter Layter, and in typical cussedness, the track called Children Gathering (Outro), actually precedes the track called Children Gathering, but listening to Nicollide &amp; the Carmic Retribution as a whole, unbroken work reveals it to be one of Dunger's finest so far.\n(Stewart Mason, allmusic.com)\n\n- - -\n\nNicolai Dunger - Nicollide and the Carmic Retribution  2008\n(Stockholm EMI Music Sweden)\n\n 1. 10th anniversary collide \n 2. Been cheating \n 3. Holy communion box  \n 4. Retribution \n 5. Too free to be gone  \n 6. Our filmscore \n 7. Wind serenade \n 8. Children (outro) \n 9. Children gathering \n10. Lifelong song \n11. I love you only \n12. Our river scores \n13. There's a room \n14. Picking up the pieces\n\n\nNicolai Dunger, piano, guitar, vocals\nJohan Berthling, bass\nKjell Nordeson, drums, percussion, vibraphone\nThomas Hallonsten, organ, trumpet, toy piano\n\nProduced by Jari Haapalainen and Nicolai Dunger\n","torrent":{"xt":"urn:btih:b25f9d8ca2bae39fe5214171fd090f9bd1046208","amp;dn":"Nicolai+Dunger+-+Nicollide+and+the+carmic+retribution+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b25f9d8ca2bae39fe5214171fd090f9bd1046208","infoHashBuffer":{"type":"Buffer","data":[178,95,157,140,162,186,227,159,229,33,65,113,253,9,15,155,209,4,98,8]},"announce":[],"urlList":[]}}