{"title":"NCIS - IMARS - XBOX360 - REGION FREE {BOOBSMAN}","uid":6778421,"size":7082099808,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:b27cd2a1606dbabacec7478face9110b154581cc&amp;dn=NCIS+-+IMARS+-+XBOX360+-+REGION+FREE+%7BBOOBSMAN%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boobsman","files":78,"time":1319763308,"description":"LT1.9 REQUIRED!!!\nDO NOT PLAY THIS GAME UNLESS YOU HAVE UPDATED TO THE LATEST FIRMWARE!!!\nIF YOU ARE ASKED TO UPDATE AND YOUR NOT RUNNING LT1.9 STOP THE GAME!!!\n &lt;a href=&quot;\nhttp://www.freeimage.us/image-B516_4EAA82DE.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-B516_4EAA82DE.jpg&lt;/a&gt;\n\nFor the first time ever, the world of the NCIS TV show comes to your home console. Experience four original NCIS episodes created with the writers of the show, and travel across the USA and around the world to solve complex murder, espionage and terrorist cases as your favorite characters from the hit TV drama.\n\nPlay as the cast, be part of the family: Take on the role of the best NCIS team using the special skill set and field of expertise of each team member. Investigate crime scenes as agents Ziva David and Tony DiNozzo, conduct forensics analyses as Abby and victim autopsies as Ducky, interrogate and break suspects as Gibbs, and use satellite tracking to apprehend bad guys on the run as McGee. The game also features cameo appearances by some of the show's most popular characters, such as NCIS director Leon Vance and Anthony DiNozzo Sr., Agent DiNozzo's father.\n\nYour own NCIS adventure: An all-new NCIS story arc written with the writers of the show. From a Casino in Atlantic City, USA, to a luxury hotel in Dubai, UAE, work as the NCIS team to save the day. Discover exciting connections between four original cases as you crack each one, and work towards solving the overall investigation.\n\nEnjoy the NCIS team camaraderie: Bond with your favorite NCIS characters and get first-hand experience with the group's humor, personality quirks, and defining characteristics. Interact with the characters through layers of storyline and dialogue designed to make you an integral part of the cast's compelling dynamic.\n\nTotal NCIS experience: As in the show, use your guts and the cutting edge of technology to solve cases. Engage in varied mini-games and activities: search crime scenes for clues and collect evidence - use the latest forensic tools and perform autopsies, conduct dramatic suspect interrogations and put your reflexes to the tests in tense action sequences. Finally piece the clues together using your wits to deduct the truth.\n","torrent":{"xt":"urn:btih:b27cd2a1606dbabacec7478face9110b154581cc","amp;dn":"NCIS+-+IMARS+-+XBOX360+-+REGION+FREE+%7BBOOBSMAN%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b27cd2a1606dbabacec7478face9110b154581cc","infoHashBuffer":{"type":"Buffer","data":[178,124,210,161,96,109,186,186,206,199,71,143,172,233,17,11,21,69,129,204]},"announce":[],"urlList":[]}}