{"title":"Mass Casualties (mobi)","uid":6728422,"size":2996234,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b42bc514754e592910f5346d8d5cc792711ecee1&amp;dn=Mass+Casualties+%28mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":".StoneX.","files":-1,"time":1318026076,"description":"A raw, honest narrative by a young soldier thrust into an atmosphere that demanded care for the wounded, yet seemingly deprived of leaders who understood their role was to help, and not to be self-absorbed.&quot; -- Bing West, Former Assistant Secretary of Defense for International Security Affairs; Author of The Village and No True Glory\n\n&quot;I was moved by Michael's very personal account of life in Iraq and the wisdom he gained in that crucible--including not to salute if I ever find myself in a war zone.&quot; -- Susan N. Herman, President, American Civil Liberties Union; Centennial Professor of Law\n\n&quot;Michael Anthony introduces us to an alien world that is unimaginable unless experienced--or witnessed--through the author's eyes and pain, and youthful, matter-of-fact wisdom. It is hard to read about the unexpected casualties of war, but Michael takes us on an unforgettable personal journey as filled with humor as it is with horror.&quot; -- Philip G. Zimbardo, New York Times Bestselling Author of The Lucifer Effect: Understanding How Good People Turn Evil\n\n&quot;Michael Anthony's memoir is not about the politics of Iraq. Instead it takes up deep inside the war, inside and outside the operation room, the barracks, the talk of the soldiers, the feeling of the situation...unique and powerful.&quot; --HOWARD ZINN, Author of A People's History of the United States\n\n&quot;Riddled with very dark humor, Mass Casualties is M*A*S*H absent the lightheartedness. For those who love war stories, this should be mandatory reading.&quot; --Gary Hart, United States Senator\n\nMuch will be written about the Iraq War in years to come, but it's difficult to envision any of it ever topping Michael Anthony's Mass Casualties. The book is subtitled A Young Medic's True Story of Death, Deception and Dishonor in Iraq, but even that does little justice to Anthony's raw, unfiltered look at the heartache and misery he found himself surrounded by. Anthony's one-year tour was spent alternately dodging mortar fire and spending long, sleep-deprived hours in operating rooms where medical teams struggled frantically to stitch similarly young lives back together. All the staples of war from classics like The Things They Carried by Tim O'Brien or A Rumor of War by Phillip Caputo are here, from the disillusionment to the mind-numbing detachment to the utterly pointless political infighting. The difference is those books were at least mostly fiction, while Anthony's real-life tale is presented in riveting diary form. Slight, short and to the point, Mass Casualties is destined to become a classic of its kind. Anthony's prose is draped in caution, a warning sign flashed before the eyes of the jingoistic sensibilities of those who strut their patriotism before a curtain of deferments. -- AuthorMagazine.org, October 2009\nSee all Editorial Reviews\nProduct Details\n\n    * Format: Kindle Edition\n    * File Size: 334 KB\n    * Print Length: 256 pages\n    * Page Numbers Source ISBN: 1440501831\n    * Publisher: Adams Media; 1 edition (September 1, 2009)","torrent":{"xt":"urn:btih:b42bc514754e592910f5346d8d5cc792711ecee1","amp;dn":"Mass+Casualties+%28mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b42bc514754e592910f5346d8d5cc792711ecee1","infoHashBuffer":{"type":"Buffer","data":[180,43,197,20,117,78,89,41,16,245,52,109,141,92,199,146,113,30,206,225]},"announce":[],"urlList":[]}}