{"title":"The Enviromental Documentary Pack","uid":6775199,"size":7479425821,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b4b4602001c7cbf7cd900f180d23df4bd610b4bf&amp;dn=The+Enviromental+Documentary+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neil1966hardy","files":15,"time":1319716064,"description":"Enviromental Documentaries\n\n1.An Inconvenient Truth 2006\n\nA documentary on Al Gore's campaign to make the issue of global warming a recognized problem worldwide.\n\n2.Carbon Nation 2010\n\nAn optimistic (and witty) discovery of what people are already doing, what we as a nation could be doing and what the world needs to do to prevent (or at least slow down) the impending climate crisis.\n\n3.Crude 2009\n\nThe story of lawsuit by tens of thousands of Ecuadorans against Chevron over contamination of the Ecuadorean Amazon.\n\n4. Fuel 2008\n\nDirector Josh Tickell takes us along for his 11 year journey around the world to find solutions to America's addiction to oil. A shrinking economy, a failing auto industry, rampant unemployment, an out-of-control national debt, and an insatiable demand for energy weigh heavily on all of us\n\n5.Gasland 2010\n\nIt is happening all across America-rural landowners wake up one day to find a lucrative offer from an energy company wanting to lease their property. Reason? The company hopes to tap into a reservoir dubbed the &quot;Saudi Arabia of natural gas.&quot; Halliburton developed a way to get the gas out of the ground-a hydraulic drilling process called &quot;fracking&quot;-and suddenly America finds itself on the precipice of becoming an energy superpower\n\n6. Our Daily Bread 2005\n\nA look into what is happening to the food we eat.\n\n7. The 11th Hour 2007\n\nA look at the state of the global environment including visionary and practical solutions for restoring the planet's ecosystems.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:b4b4602001c7cbf7cd900f180d23df4bd610b4bf","amp;dn":"The+Enviromental+Documentary+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4b4602001c7cbf7cd900f180d23df4bd610b4bf","infoHashBuffer":{"type":"Buffer","data":[180,180,96,32,1,199,203,247,205,144,15,24,13,35,223,75,214,16,180,191]},"announce":[],"urlList":[]}}