{"title":"KILLER ELITE RMVB GLOBE","uid":6703763,"size":238644308,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b5412f39e599124422b36284872ef92f2611abc0&amp;dn=KILLER+ELITE+RMVB+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1317081886,"description":"* RMVB CAM  * 01H45M26S * Worked with the Dub plugins\n\n\n\nINFO :  \n\n\n- Black borders corrected to a perfect resolution\n\n- Colours improved\n\n\nNOTE :\n\nMediacope or RMVB Player are recommended to play this movie file\n\n\n\n* SYNOPSE :\n\nKiller Elite is a 2011 action film starring Jason Statham, Clive Owen, Robert De Niro, Yvonne Strahovski, and Dominic Purcell. The film is based on the 1991 novel The Feather Men by Sir Ranulph Fiennes, and is directed by Gary McKendry.\n\n\n\n* Plot :\n \nSir Ranulph Fiennes' novel, controversially claimed to have been based on actual events, concerns a series of assassinations of members of the British Special Air Service (SAS) by a hit squad called &quot;The Clinic&quot;. The &quot;Feather Men&quot; of the title is a group of vigilante special forces members who take on the hit men to protect members of their regiment.\n \nThe film takes place in the early '80s. We see Danny (Jason Statham) and Hunter (Robert De Niro) involved in a hit on a Mexican leader. Danny kills the Mexican, but is spooked when he finds a child in the car with him. He retires to Australia.\n \nHe receives a package with a plane ticket and a photo of Hunter being held hostage, and flies to Oman. A sheik explains that 3 of his 4 sons have been killed by the SAS, and he must see the killers dead so that his fourth son can take over. He is offering $6 million to do the job. Hunter took on the task, but ran into problems. The sheik is old and dying, and says that he will kill Hunter before he dies unless Danny completes the job. The job is complicated by the condition that all kills must look like accidents or natural deaths, and the SAS victims must confess to killing the sheik's sons on camera.\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n* GLOBE FILES 2011\n","torrent":{"xt":"urn:btih:b5412f39e599124422b36284872ef92f2611abc0","amp;dn":"KILLER+ELITE+RMVB+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5412f39e599124422b36284872ef92f2611abc0","infoHashBuffer":{"type":"Buffer","data":[181,65,47,57,229,153,18,68,34,179,98,132,135,46,249,47,38,17,171,192]},"announce":[],"urlList":[]}}