{"title":"The Trumpet Major  -  Thomas Hardy  (Unabridged)","uid":6692315,"size":154106636,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b5e5e6dd02f3a9445a2cb37366ca3d2fe66af398&amp;dn=The+Trumpet+Major++-++Thomas+Hardy++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"neil1966hardy","files":22,"time":1316639924,"description":"This is an unabridged version, 146MB, running for 10.7 hours.\n\nEncoded as 32kbps 22050Hz MP3 mono - radio quality\n\n------------------------------------------------------------------------------------------\n\nSynopsis\n\nAnne Garland, who lives with her widowed mother in a mill owned by Miller Loveday, has three suitors: the local squire's nephew Festus and the miller's two sons, Robert and John. While Festus' aggressive pursuit deters the young woman from considering him as a husband, the indecisive Anne wavers between light-hearted Bob and gentle, steadfast John. But as their Wessex village prepares for possible invasion by Napoleon's fleet, all find their destinies increasingly tangled with the events of history.\n\nThe Loveday brothers, one a sailor and one a soldier, must wrestle with their commitments to their country and their feelings for Anne. Lyrical and light-hearted, yet shot through with irony, &quot;The Trumpet-Major&quot; (1880) is one of Hardy's most unusual novels and a fascinating tale of love and desire.\n\n\nReview from Amazon.co.uk\n\nIf a Thomas Hardy novel can be characterised by descriptions of landscape and the depiction of its characters within that landscape, then 'The Trumpet-Major' is not a typical Hardy novel.\n\nHardy adopts a light narrative style with the emphasis on the story of the heroine Anne Garland and her interactions with three suitors, the Loveday brothers (including the eponymous trumpet-major) and Festus Derriman. There were occasions when I felt like telling Anne Garland to &quot;get on with it and make up your mind&quot;.\n\nThere is a nice sting in the tail at the end of the novel where Hardy confounds the reader's expectations by not providing a conventional happy ending. Anne Garland's (final) choice of suitor is determined more by sexual attraction than mutual compatibility (though Hardy, of course, cannot explicitly state this).\n\nThe novel is populated with 'stock' characters: there is the miller, the soldier, the sailor, the bounder, the actress. Indeed, play-acting is an important theme; characters dissemble, disguise their true feelings, put on an act.\n\nThe Napoleonic wars and the threat of invasion are the background against which the story plays out, though, in keeping with the overall tenor of the novel, it is not a serious threat. The episode where the local men drill could come straight from an episode of the television series `Dad's Army'.\n\n'The Trumpet-Major' is a minor Hardy novel, but minor Hardy is better than many other writers' major novels.\n\n------------------------------------------------------------------------------------------\n\nRead by Simon Vance\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:b5e5e6dd02f3a9445a2cb37366ca3d2fe66af398","amp;dn":"The+Trumpet+Major++-++Thomas+Hardy++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5e5e6dd02f3a9445a2cb37366ca3d2fe66af398","infoHashBuffer":{"type":"Buffer","data":[181,229,230,221,2,243,169,68,90,44,179,115,102,202,61,47,230,106,243,152]},"announce":[],"urlList":[]}}