{"title":"SPAZ v1.001 [Hyperdrive25].exe","uid":6689245,"size":131104947,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b600b6103e7a46d3774bf9b2748e4da5232a6216&amp;dn=SPAZ+v1.001+%5BHyperdrive25%5D.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hyperdrive25","files":-1,"time":1316515198,"description":"             Space Pirates &amp; Zombies (S.P.A.Z.) v1.001\n             +++++++++++++++++++++++++++++++++++++++++\n\nThis is the latest version of the game v1.001. All the changes are listed below.\n\nChanges from v1.000 to v1.001\n.............................\nfixed uncommon spec achievement sometimes not working\nfixed fusion beams, mines, particle cannon now cause anger in enemy ships\nfixed mass driver can pass through zombie killer shields\nfixed no acheivement credit for re-exploring stars\nfixed sometimes warpin stuck ship state\nchanged balance of power starbase not an insanely strong\n\nChanges from v0.9007 to v1.000\n..............................\nAdded tutorial skipper\nAdded cloning system\nAdded update checker\nAdded in game upcoming feature list\nAdded respec\nAdded difficulty levels\nAdded specialists\nAdded stored designs for each hangar for easy switching\nAdded a reset design button to reset the design to the current ship\nAdded ships have a sense of self preservation (avoid exploding ships, if it will do major harm)\nAdded cloaking stealth damage 1.5x + specialist and research boosts.\nAdded Surplus cloaking device.\nAdded zombie killers have shields\nAdded zombie killers have armor\nAdded on killer conversion shields and armor gone but will repair\nAdded an extra set of 3 intro stars to make game start more sane\nAdded critters damage shields armor and hull over time, progressively\nAdded level down difficulty option (one way only)\nAdded option to turn off auto pause on lose focus\nAdded goon pods.\nChanged doubled critter shield damage.\nChanged higher critter health\nChanged smoother critter spawning\nChanged cull extra effects when frame rate is low.\nChanged critter updates optimized\nChanged self destructing ships cut their engines to drift into targets\nChanged zombie ships cannot spawn eggs for 5 seconds after birth.\nChanged ruptured eggs cause greater damage to the spawned ship.\nChanged rammed zombie critters do double damage but go splat\nChanged armor must be &lt; 25% for critters to invade\nChanged hull must be &lt; 50% for critters to invade.\nChanged zombie ship repair rate lowered\nChanged doubled boarding combat speed\nChanged zombies will not fire on infected ships.\nChanged zombie tech level scales with the progress toward the final battle. instead of being locked at 90\nChanged increased data cube lifetime\nChanged mass bombs inherit ship velocity\nChanged mass bombs now explode to drop a gravity well (does not effect allies)\nChanged mass bomb flight time effects grav well radius.\nChanged research damagestrength effects wisp damage too\nChanged research damagestrength also effects strength of gravity well.\nChanged mass bombs impact with high projectile damage\nChanged hunter srms are do ion damage but can hunt cloakers too (ion damage trippled)\nChanged lowered SRM count. spamming was overpowered. (also cpu pig)\nChanged launcher boosters from 25% bonus to 20% bonus to reload speed.\nChanged slight increase to missile reload times\nChanged slight increase in power consume for missiles\nChanged escorted ships get much less angry from friendly fire.\nChanged mass bombs no longer player pilotable. fire like torps now\nChanged upped mission counts in general and made metagame changers more common\nChanged lowered spread on scatter and particle cannons\nChanged drone bombers do high explosive damage\nChanged increase to disruptor cannon damage and speed\nChanged particle cannons, shoot 2x as fast as disruptors, do universal damage, shorter range than cannons, more power effieient shoot 6 shots at a time\nChanged scatter cannons longer range and do ion damage.\nChanged tractor beams work while cloaked\nChanged Auto target and first press of prev or next target target closest to reticule\nChanged targeting system will target the ship under the reticule on prev or next target pressed, always\nChanged inertial engines upgraded. Better top speed and acceleration. Very nice engine now.\nChanged removed inertial engines ambient damping\nChanged ai avoids wisps dropped by mass bombs\nChanged leech beams 40% weaker.\nChanged +50% goons cap, 20% default goons\nChanged more turns between zombie attacks\nChanged leech beams effect zombie killers but not breeders\nChanged ion damage effects zombie killers but not breeders\nChanged dont allow zombie ships to shoot crew pods\nChanged turret firing mode made global and saved\nChanged collection mode made global and saved\nChanged request crew hotkey added (M)\nChanged lots of upgrades for mines. beware.\nChanged AI better at deploying minefields.\nChanged mine droppers cloak disrupts when they lay a mine\nFixed ai should not attack spaced goons anymore\nFixed Cloaking booster hooked up properly\nFixed repaired ships inheriting current design instead of just fixing current ship\n\n[Install Notes]: Double-click the setup file to begin installing to your hard-drive. Menu entry, Desktop Shortcut and Uninstaller will be created automatically. Start game from either menu or double-click the desktop shortcut. \n\n___________________________________________________________________________________\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~HYPERDRVIVE 25~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n___________________________________________________________________________________","torrent":{"xt":"urn:btih:b600b6103e7a46d3774bf9b2748e4da5232a6216","amp;dn":"SPAZ+v1.001+%5BHyperdrive25%5D.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b600b6103e7a46d3774bf9b2748e4da5232a6216","infoHashBuffer":{"type":"Buffer","data":[182,0,182,16,62,122,70,211,119,75,249,178,116,142,77,165,35,42,98,22]},"announce":[],"urlList":[]}}