{"title":"Goin' Downtown - Full English","uid":6705580,"size":1163880591,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b62a18fba64a867926f378370c32af05b75192c1&amp;dn=Goin%5C%27+Downtown+-+Full+English&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marco699","files":2,"time":1317144572,"description":"Release Date : May 22, 2008 \nGame Platforme(s) : PC \nLanguage : Multi \nPublisher : Kalypso Media \nDeveloper : Silver Style Ent.  \nGenre : Sci- Fiction/Adventures \nFile Size : 1.11 Gb \n\nSomewhere along the line, Goin' Downtown took a detour on the way to its English-language release. This futuristic sci-fi whodunit debuted in Germany in 2008 and took nearly three years to be localized, no doubt due to its original publisher, The Games Company, going bankrupt in the meantime. Fortunately, Kalypso Media finally picked it up and saw it through to completion, although only in downloadable, subtitled form. Even with these limitations, many will be glad they did, as its a stylish-looking adventure with an impressive atmosphere and setting, user-friendly interface, and a compelling mystery premise that can make for quite a ride. The downside is, its rather bare-bones plot development and overly simplistic gameplay will have you speeding through to the end in no time.\n\nGoin' Downtown begins with a jolt literally. A man is strapped to an electric chair moments before death, leading the game protagonist to reflect back on the dramatic events leading to that point. (Maybe ones life really does flash before your eyes right before you die?) Once a rising star of New York Citys finest, Jake McCorly career as a cop has seriously hit the skids in recent years. ItÃƒÂ¯Ã‚Â¿Ã‚Â½s the late 21st century, and police are paid strictly through rewards for arrests, but Jake can only wallow in the misery of his wifes death. A holographic news report details the increasing disappearance of prostitutes, but nothing can shake Jakes apathy until an explosion outside his high-rise apartment sends him out to investigate. Finding a beautiful call girl named Rose unconscious in the street, Jake shelters her while she recovers. But when Rose goes missing under suspicious circumstances several hours later, the wheels of a much larger mystery are set in motion, finally rousing Jake to action.\n\nWheels are an important part of this adventure, as you zip around between locations on a motorcycle. All events occur within a small inner city radius, from the police station to various homes and factory warehouses to Fat FranzyÃƒÂ¯Ã‚Â¿Ã‚Â½s bar. A slick quick travel map can be called up just about any time, which shows a miniature of the city and any destinations Jake can drive to at that time. But the impressive visual presentation doesnt end there. The locations themselves are done in a wonderful hand-drawn comic fshion with cel-shaded characters. Backgrounds arent overly detailed, but theyre richly coloured and nicely designed with little touches like wall graffiti in the Red Light District, a lotus pond in a Chinese mall, and blurred streams of traffic racing below Jakes pad. There arent many cinematics or ambient animations, but character actions are generously displayed, from Fido the robodog performing tricks to an Itchy &amp; Scratchy-like cartoon playing on TV, although we probably could have done without watching Jake relieve himself. Character models are quite blocky and the shadows are distractingly heavy, but each one is distinctively designed, whether the mohawked paramedic, the pink-and-blue-haired junkie, or the pony-tailed child pickpocket. Non-interactive characters, on the other hand, appear as featureless moving background props, which is surprisingly effective.\n\nJust as important as the artistic quality is the futuristic vision of the world itself. This is a society much like our own, full of elevators and key cards and old-fashioned guns, yet advanced enough to create an immersive urban sci-fi atmosphere. Jakes apartment comes complete with a personal ATM (where can I get one of those?) and an automated TeleDoc, which offers personal psychiatric advice (forget the bank machine, where can I get one of THOSE?!!). Elsewhere, you wll encounter finger chips and thumb scanners that log all relevant personal details for 70 years, weapon detectors, and a Cerebro-like simulation room where you can recreate and interact with recorded personal events. ItÃƒÂ¯Ã‚Â¿Ã‚Â½s a good mix of present fact and future fiction that keeps the story grounded in reality but refreshingly different, like the use of mobile handsets for stationary ComStations to make phone calls and access police files, now necessary due to electromagnetic pollution from excessive cell phone use.\n\nSetup Instruction\n\n1- Mount or burn ISO\n2- Click &quot;Setup.exe&quot; to Instal the Game\n3- Copy &quot;POSTMORTEM&quot; Folder Content to the Directory Game (Replace)\n4- Play &amp; Have Fun .................... Enjoy\n\n","torrent":{"xt":"urn:btih:b62a18fba64a867926f378370c32af05b75192c1","amp;dn":"Goin%5C%27+Downtown+-+Full+English","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b62a18fba64a867926f378370c32af05b75192c1","infoHashBuffer":{"type":"Buffer","data":[182,42,24,251,166,74,134,121,38,243,120,55,12,50,175,5,183,81,146,193]},"announce":[],"urlList":[]}}