{"title":"DREAM HOUSE RMVB GLOBE","uid":6720404,"size":178049109,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b62e2308bcb44e145af4c34367f5e8b26181e25b&amp;dn=DREAM+HOUSE+RMVB+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1317766947,"description":"* RMVB CAM    * 01H21M54S   * Worked with the Dub plugins\n\n\nFILE INFO :\n===========\n\n\n- NO BLACK BORDERS IN FULL SCREEN\n\n- COLOURS IMPROVED \n\n- NO BORRING PARTICLES ON THE SCREEN BACKGROUND\n\n\n\nNOTE : THE USER OF THIS VIDEO FILE WILL BE SURPRISED BY THE EXCELENT QUALITY ON THE PICTURE BESIDE THE LOWER SIZE OF THE VIDEO FILE , FOR WHAT WAS POSSIBLE TO DO WITH THE ORIGINAL THE FINAL WORK OBTAINED IT IS SIMPLY EXCELLENT !!!\n\n\n\nSUGGESTED PLAYERS :\n===================\n\n- RMVB PLAYER     or    - MEDIACOPE     (BOTH FREEWARE)\n\n\n\n* Plot :\n========\n\nPublisher Will Atenton (Daniel Craig) moves from New York City to a suburban Connecticut town with his wife Libby (Rachel Weisz) and their young daughters Trish (Taylor Geare) and Dee Dee (Claire Geare) so that Will can work on a novel. There, Will meets their new neighbors, Ann Patterson (Naomi Watts), who is divorcing her husband, Jack Patterson (Marton Csokas), and fighting for full custody of their teenage daughter, Chloe (Rachel G. Fox).\n\nTrish and Dee Dee start seeing a man watching the house from the front yard, and Will and Libby find evidence that something has happened to the house\\'s previous owners. Will eventually discovers that, years prior, a woman named Elizabeth and her daughters Beatrice and Katherine were murdered, and her husband, Peter Ward, was the main suspect, but was let off because of lack of evidence. Will starts believing that Peter Ward has returned and is stalking his family, and starts searching for more information about him.Will\\'s research leads him to the psychiatric hospital where Peter Ward was committed after being arrested for murdering his family. There, Will discovers that he is Peter Ward, and created a new identity for himself in order to cope with the grief of his family\\'s death. He is informed by the doctors that he claimed he was innocent. He returns to his house, which is actually abandoned and decrepit, and converses with the projections of his wife and daughters, who claim that they believe in his innocence.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2011\n","torrent":{"xt":"urn:btih:b62e2308bcb44e145af4c34367f5e8b26181e25b","amp;dn":"DREAM+HOUSE+RMVB+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b62e2308bcb44e145af4c34367f5e8b26181e25b","infoHashBuffer":{"type":"Buffer","data":[182,46,35,8,188,180,78,20,90,244,195,67,103,245,232,178,97,129,226,91]},"announce":[],"urlList":[]}}