{"title":"Mafia full GAME [RIP] [CZ]","uid":6710306,"size":2412739506,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b6ea16a2053be13bb1716d68a8cf250bc30e119f&amp;dn=Mafia+full+GAME+%5BRIP%5D+%5BCZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"shoortyk","files":6,"time":1317328317,"description":"Mafia\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s storyline gameplay consists of driving, mainly easy city cruise between different locations, as well as chases and races; the rest of the game is based on third-person on-foot navigation and shooting - all inter-connected with cutscenes. In addition to the photo-realistic city and a huge countryside, detailed interiors like the city\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s airport, a museum, a church, a hotel, an abandoned prison, restaurants and Don Salieri\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s bar are included. Weather changes and day/night cycles are also in use.\n\n51 classic American cars around the city can be driven in Mafia, plus 19 bonus cars (of which 5 are racing models) unlockable after the main mode and the opening of a new game mode. Cars are introduced periodically - in the beginning of the game, early 1920s models drive on the streets of the city, while models from 1930 begin appearing in later game stages.\n\nPolice book players for minor offenses such as speeding or running a red light, and car accidents cause physical harm to the driving player. While other forms of transport are available, such as trams and elevated rails, they are only ridable and not drivable by the player.\n\nMafia is also noted for having comprehensive damage physics on nearly all vehicles. While substantially more robust than their real counterparts, smaller and weaker vehicles stand less abuse before breaking down and finally exploding, than large armoured vehicles. More realism is added here compared to other games in the same genre, such as the ability to puncture the fuel tank, overheat the engine, and the ability to break transmission gears. Many exterior components (such as windows, tires, headlights, and bumpers) can be removed from most vehicles with physical means such as crash-driving, hitting with blunt weapons (fists, baseball bat) as well as firing weapons at them.\n\n----------------------------------------------------------\n\nThe game is 100% functional just unzip and play\n\n","torrent":{"xt":"urn:btih:b6ea16a2053be13bb1716d68a8cf250bc30e119f","amp;dn":"Mafia+full+GAME+%5BRIP%5D+%5BCZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6ea16a2053be13bb1716d68a8cf250bc30e119f","infoHashBuffer":{"type":"Buffer","data":[182,234,22,162,5,59,225,59,177,113,109,104,168,207,37,11,195,14,17,159]},"announce":[],"urlList":[]}}