{"title":"Terminator Salvation(2009)DVDRip.AC3(ENG)-DROCK","uid":6700075,"size":734897810,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b7bc5fd7652f5df3acaf439aa81e3119764f02f0&amp;dn=Terminator+Salvation%282009%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1316940295,"description":"The fourth installment of the Terminator series follows an adult John Connor (played by Christian Bale) as he attempts to organize a human resistance force which could prove to be mankind's last true hope in the war against the machines. Opening in the year 2018, Terminator Salvation finds John Connor's certainty about the future shaken by the sudden appearance of a mysterious stranger named Marcus Wright (Sam Worthington), whose last memory is of sitting on death row and awaiting execution. Unable to determine whether Marcus was sent from the future or rescued from the past, Connor begins to wonder whether there is still any hope left for the human race as the robots grow more powerful and aggressive than ever before. It appears that Skynet is preparing a devastating final attack designed to eliminate the human resistance once and for all, leaving Connor and Marcus with no choice but to strike back at the cybernetic heart of Skynet's operations. Once there, the two battle-scarred soldiers discover a devastating secret regarding the potential annihilation of all humankind. Anton Yelchin fills Michael Biehn's shoes as a young Kyle Reese in the first installment of a planned Terminator trilogy from director McG (Charlie's Angels).\n\nRipped with Handbrake.\n\nLength: 1 Hour 55 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:b7bc5fd7652f5df3acaf439aa81e3119764f02f0","amp;dn":"Terminator+Salvation%282009%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7bc5fd7652f5df3acaf439aa81e3119764f02f0","infoHashBuffer":{"type":"Buffer","data":[183,188,95,215,101,47,93,243,172,175,67,154,168,30,49,25,118,79,2,240]},"announce":[],"urlList":[]}}