{"title":"Democracy Now - 17 oct 2011","uid":6751294,"size":455607096,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b85431a2e1e457918c72e3fae3bee7bd60c930fb&amp;dn=Democracy+Now+-+17+oct+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1318885184,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 17, 2011\n\n- Hundreds of Thousands Protest Around the World in Solidarity with Occupy Wall Street Movement\n- U.S. Police Departments Arrest Hundreds in Demonstrations Inspired by Occupy Wall Street\n- Hundreds of Kenyan Troops, Backed by Tanks, Helicopters, Invade Somalia\n- Obama Deploys Troops to Africa to Fight Lord's Resistance Army in Uganda\n- U.S. Intensifies Drone War in Yemen, Carrying Out Five Strikes in One Day\n- Alabama: Federal Court Blocks Elements of Controversial Anti-Immigrant Law\n- Republican Presidential Hopeful Herman Cain Linked to Billionaire Koch Brothers\n- Longtime Egyptian Opposition Leader Ayman Nour Barred from Presidential Election\n- Tens of Thousands Gather in Washington, D.C., for Martin Luther King, Jr. National Memorial Dedication\n- Native American Elder, Activist Elouise Cobell Dies at 65\n\n\nSpecial reports\n\n- Global Day of Rage: Hundreds of Thousands March Against Inequity, Big Banks, as Occupy Movement Grows\n\nFrom Buenos Aires to Toronto, Kuala Lumpur to London, hundreds of thousands of people rallied on Saturday in a global day of action against corporate greed and budget cutbacks, demanding better living conditions and a more equitable distribution of wealth and resources. Protests reportedly took place in 1,500 cities, including 100 cities in the United States-all in solidarity with the Occupy Wall Street movement that launched one month ago in New York City. We go to Athens for a report from a protest at Syntagma Square against austerity measures and corporate greed, speak to an activist in Rome where 200,000 rallied, and go to Japan for a report on the Occupy Tokyo demonstration. We also air excerpts of a speech by Julian Assange of WikiLeaks at Occupy London Stock Exchange.\n\n\n- Danny Glover, Cornel West Speak Out at Occupy Protests as MLK Memorial is Dedicated in D.C.\n\nIn the United States, police arrested hundreds of people over the weekend at demonstrations and occupations inspired by Occupy Wall Street. Arrest totals include: 175 in Chicago; 100 in Arizona; 92 in New York City; 19 in Raleigh, North Carolina; 19 in Denver; and 19 in Washington, D.C., including Princeton University Professor Cornel West, on the steps of the Supreme Court. West was arrested shortly after attending the dedication ceremony for the new Rev. Dr. Martin Luther King, Jr. Memorial. At the dedication, President Obama said, &quot;It is right for us to celebrate Dr. King's marvelous oratory, but it is worth remembering that progress did not come from words alone. Progress was hard. Progress was purchased through enduring the smack of billy clubs and the blast of fire hoses. It was bought with days in jail cells and nights of bomb threats.&quot; We also go to California, where actor and activist Danny Glover addressed Occupy Oakland.\n\n\n- Times Square Taken Over as Occupy Wall Street Enters Second Month, Hundreds Arrested Across Country\n\nIt was a month ago today that Occupy Wall Street began in Manhattan's Financial District. The protest encampment based at Zuccotti Park remains and continues to grow despite last week's threatened eviction by the City of New York. On Saturday, thousands of protesters marched from Zuccotti Park to Times Square, the heart of New York's media, tourism and entertainment district. Earlier in the day, about two dozen people were arrested at a Citibank in Lower Manhattan while they attempted to take their money out of the bank. We speak to Ryan Devereaux, a Democracy Now! reporter who has been closely following the Occupy Wall Street movement. We also speak with Julie Gonzales, director of organizing for the Colorado Immigrant Rights Coalition, about the Occupy Denver protests.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b85431a2e1e457918c72e3fae3bee7bd60c930fb","amp;dn":"Democracy+Now+-+17+oct+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b85431a2e1e457918c72e3fae3bee7bd60c930fb","infoHashBuffer":{"type":"Buffer","data":[184,84,49,162,225,228,87,145,140,114,227,250,227,190,231,189,96,201,48,251]},"announce":[],"urlList":[]}}