{"title":"Killer Robots - Legality and Ethicality of Autonomous Weapons","uid":6699225,"size":3012743,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9a4caccb421f459210352647f7da7a01d5d19d7&amp;dn=Killer+Robots+-+Legality+and+Ethicality+of+Autonomous+Weapons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316897025,"description":"Military robots and other, potentially autonomous robotic systems such as unmanned combat air vehicles (UCAVs) and unmanned ground vehicles (UGVs) could soon be introduced to the battlefield. Look further into the future and we may see autonomous micro- and nanorobots armed and deployed in swarms of thousands or even millions. This growing automation of warfare may come to represent a major discontinuity in the history of warfare: humans will first be removed from the battlefield and may one day even be largely excluded from the decision cycle in future high-tech and high-speed robotic warfare. Although the current technological issues will no doubt be overcome, the greatest obstacles to automated weapons on the battlefield are likely to be legal and ethical concerns. Armin Krishnan explores the technological, legal and ethical issues connected to combat robotics, examining both the opportunities and limitations of autonomous weapons. He also proposes solutions to the future regulation of military robotics through international law.\nAbout the Author\nArmin Krishnan is a Senior Research Assistant in the National Centre for Research Methods at the University of Southampton, UK.\nProduct Details\n\n    * Hardcover: 216 pages\n    * Publisher: Ashgate (July 28, 2009)\n    * Language: English\n    * ISBN-10: 0754677265\n    * ISBN-13: 978-0754677260","torrent":{"xt":"urn:btih:b9a4caccb421f459210352647f7da7a01d5d19d7","amp;dn":"Killer+Robots+-+Legality+and+Ethicality+of+Autonomous+Weapons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9a4caccb421f459210352647f7da7a01d5d19d7","infoHashBuffer":{"type":"Buffer","data":[185,164,202,204,180,33,244,89,33,3,82,100,127,125,167,160,29,93,25,215]},"announce":[],"urlList":[]}}