{"title":"Kaipa - Notes from the past 2002","uid":6720393,"size":526888609,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:badfe02b2c595923b41f21cc35445b91410eb71f&amp;dn=Kaipa+-+Notes+from+the+past+2002&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"barber9","files":-1,"time":1317766534,"description":"Kaipa, svenskt symfoniskt rockband.\n\n1973 startade Hans Lundin, Tomas Eriksson och Thomas SjÃƒÂ¶berg bandet Ura Kaipa. Namnet var ett fÃƒÂ¶rslag frÃƒÂ¥n deras kompis Martin Ander och refererade till en svensk stenÃƒÂ¥ldershÃƒÂ¶vding frÃƒÂ¥n boken Svenskarna och deras hÃƒÂ¶vdingar av Verner von Heidenstam. 1974 kortades namnet ner till Kaipa, strax efter att Thomas SjÃƒÂ¶berg tvingats lÃƒÂ¤mna gruppen pÃƒÂ¥ grund av sjukdom och ersatts av Ingemar Bergman. I samma veva vÃƒÂ¤rvades ÃƒÂ¤ven gitarristen Roine Stolt. Musiken skrevs av Lundin och Stolt, en musik inspirerad av grupper som Genesis och Yes. De tre fÃƒÂ¶rsta skivorna har efterhand nÃƒÂ¥tt kultstatus hos ÃƒÂ¤lskare av progrock vÃƒÂ¤rlden ÃƒÂ¶ver. Roine lÃƒÂ¤mnade gruppen -79 och dÃƒÂ¤refter ÃƒÂ¤ndrade gruppen musikalisk riktning mot en mer syntrock-inspirerad musik i tidens anda. 1982 brÃƒÂ¶t bandets medlemmar efter en sista spelning pÃƒÂ¥ Studion i Stockholm den 13:e december.\n\nI februari 2000 realiserade Hans Lundin sin vision om att ÃƒÂ¥ter ge Kaipa liv och har sedan dess gett ut ett flertal vÃƒÂ¤l mottagna CD-skivor. Gitarristen Roine Stolt, kÃƒÂ¤nd frÃƒÂ¥n bl.a. The Flower Kings och Transatlantic var den ende av originalmedlemmarna som medverkade i projektet. Han lÃƒÂ¤mnade bandet efter inspelningen av Mindrevolutions (2005), pÃƒÂ¥ grund av samarbetssvÃƒÂ¥righeter med Hans Lundin grundade i olika ideer om musikalisk inriktning. Han har ersatts av Per Nilsson frÃƒÂ¥n Scar Symmetry. (wikipedia)\n\n- - -\n\nThe album Notes from the past is filled with all new material. All the colours, shapes and vibes of the unique Kaipa-music from the 70's are present, but with enough new grooves and textures to be attractive to both die hard fans and the uninitiated alike. This is definitely progressive rock for the new millennium - rocking, and raving with blistering guitars and distorted synths, paving the way for all those glorious Mellotrons and Hammond organs that have been and are still the trademarks of 70's progressive rock.\n\nAlthough Hans and Roine had been musically parted for more than twenty years, Notes from the past, is proof the chemistry is still alive and well. It's as if the band and music were teleported directly from 1976. It doesn't take long to realize that all the right pieces are in place again. As was the case during their heyday, Kaipa is a force once again with Hans and Roine at the helm.\n\nTogether with a handful of Swedens top musicians in the prog and fusion genre, they excel with this most recent offering of classic vocal lines, textured keyboard and guitar wizardry. It also features Patrik LundstÃƒÂ¶m (of Ritual) on lead vocals and Morgan Agren (Zappa, Mats&amp;Morgan) pounding the drums in his own unique frenzied style - a true master class experience in percussion. New bass phenomenon Jonas Reingold, (The FlowerKings) adds his slightly distorted, high energy basslines to this fusion drive, and makes for a completely solid rhythm section. They fire off a cascade of prog-folk-symph- rock that has as many similarities to the previous Kaipa records as it has differences.( kaipa.info)\n\n- - -\n\nKaipa - Notes from the past  2002\n(Kleve Inside Out)\n\n 1. Notes from the past part I  \n 2. Night bike ride (on Lilac Street) \n 3. Mirrors of yesterday \n 4. Leaving the horizon \n 5. In the space of a twinkle \n 6. Folke's final decision \n 7. Thename belongs to you \n 8. Second journey inside the green glass \n 9. A road in my mind ; \n10. Morganism  \n11. Notes from the past part II\n\n\nMusicians:\nHans Lundin, keyboard\nRoine Stolt, guitars\nPatrik LundstrÃƒÂ¶m, lead vocals\nMorgan Agren, drums\nJonas Reingold, Bass\nAleena Gibson, vocals on A road in my mind\nTove ThÃƒÂ¶rn Lundin, vocals on In the space of a twinkle\n\nAll music and words by Hans Lundin,\nexcept In the space of a twinkle, words: Mari-Pierre Amat,\ninterpretation of the Swedish words: Kevin Fickling\n\nProduced by Hans Lundin\nRecorded by Lundin at HGL Studio, Uppsala, Sweden\n\nGuitars recorded by Stolt at Cosmic Lodge, Uppsala, Sweden\nDrums recorded by Lundin &amp; Agren at UAE Magnetofon, Stockholm, Sweden\nBasses recorded by Reingold at Reingold Studio, MalmÃƒÂ¶, Sweden\n\nMixed at Cosmic Lodge by Lundin &amp; Stolt 23-26 July 2001\nMastered at Cosmic Lodge by Stolt 30-31 July 2001\n","torrent":{"xt":"urn:btih:badfe02b2c595923b41f21cc35445b91410eb71f","amp;dn":"Kaipa+-+Notes+from+the+past+2002","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"badfe02b2c595923b41f21cc35445b91410eb71f","infoHashBuffer":{"type":"Buffer","data":[186,223,224,43,44,89,89,35,180,31,33,204,53,68,91,145,65,14,183,31]},"announce":[],"urlList":[]}}