{"title":"Anti-Trojan Elite 5.5.2 Portable","uid":6705455,"size":25231360,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bd722dafb00343fcefe419b44fe0b7b586eefc17&amp;dn=Anti-Trojan+Elite+5.5.2+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pirate0610","files":-1,"time":1317139096,"description":"Anti-Trojan Elite 5.5.2 Portable\n\n\nAnti-Trojan Elite (ATE) is a malware remover. Malware is softwares designed specifically to damage or disrupt a system, such as trojan horses, spywares or keyloggers. ATE has a real time anti-malware firewall, it protects system and cleans malwares immediately. It also be a system security tool, you can view and control processes, control TCP/IP network connections and so on. It can detect and clean malware in disk or memory.\n\n Anti Trojan Elite provide a real-time malware firewall for user, once a trojan or keylogger would been loaded, the ATE can detect, block and then clean it in time. The ATE can detect more than 55000 trojans, worms and keyloggers currently, and the number of malware ATE could clean is growing up very quickly, we collect world-wide malwares, user can using our auto live update feature to get the power to clean these new malwares in time.\n\n Anti Trojan Elite has some useful utilities especially. The network utility can been used to disconnect suspicious TCP connections; The process utility can been used to kill suspicious processes even the process has the system priviage, even it has the ability to unload suspicious modules in all processes; The registry repair utility can been used to repair registry altered by malware; The registry monitor utility can been used to repair any change of important registry keys and values with real time.\n\n &lt;a href=&quot;\nhttp://www.shotpix.com/images/15419549800226969240.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shotpix.com/images/15419549800226969240.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:bd722dafb00343fcefe419b44fe0b7b586eefc17","amp;dn":"Anti-Trojan+Elite+5.5.2+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd722dafb00343fcefe419b44fe0b7b586eefc17","infoHashBuffer":{"type":"Buffer","data":[189,114,45,175,176,3,67,252,239,228,25,180,79,224,183,181,134,238,252,23]},"announce":[],"urlList":[]}}