{"title":"IN TIME RMVB GLOBE","uid":6785888,"size":242363881,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bdc8e6080c147b2a319e173923389d555fb1c02c&amp;dn=IN+TIME+RMVB+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1320087160,"description":"* RMVB CAM  * 01H45M46S  * worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* RECOMMENDED PLAYERS :\n\n\n- RMVB PLAYER or - MEDIACOPE \n\nor convert to your prefered video type for any other player\n\n\n\n* INTRO :\n\n\nIn Time, previously titled Now and I\\'m.mortal, is a 2011 science fiction thriller film starring Amanda Seyfried, Justin Timberlake, Cillian Murphy, Olivia Wilde, Matt Bomer, Alex Pettyfer, Johnny Galecki, and Vincent Kartheiser. The film, written and directed by Andrew Niccol, was released on October 28, 2011.\n\n\n\n* PLOT :\n\n\nIn a retro-future, the aging gene has been switched off. At the age of 25, aging stops, meaning that everyone looks 25 forever and could be immortal. But to prevent overpopulation, each person is genetically engineered so that by default they have just one more year to live after 25. Embedded in their arm is a bioluminescent clock displaying how much time they have left. Once the clock reaches zero, they die.\n \nBut this does not mean that everyone automatically dies at 26. Time can be transferred into and out of persons, and therefore, it has become the new currency. People earn time by working and spend it to pay for everyday necessities. For example, in the film, a coffee costs four minutes and a day\\'s labor in a factory will earn a worker a little over 24 hours. Time can also be stolen or robbed from another person. Consequently, the poor are constantly trying to earn, steal, beg, or borrow enough time to stay alive for one more day, while the rich can theoretically live forever (unless they are murdered or killed in accidents). Different economic classes are segregated into different \\&quot;time zones.\\&quot; To preserve the status quo, it costs a whole year just to cross the border into a wealthy time zone.\n \nA wealthy man named Henry Hamilton (Matt Bomer) goes to a bar in the impoverished time zone of Dayton, having over a hundred years left on his clock. He attracts some unwanted attention from a gang of robbers who try to steal his time, but is saved by local poor man Will Salas (Justin Timberlake). After they find shelter in an abandoned warehouse, Hamilton explains to Salas that he is 105 years old and tired of life. Later, while Salas is asleep, Hamilton transfers his time to Salas. Waking up, Salas discovers he now has over 116 years on his clock. Out the window, he sees Hamilton sitting on the edge of a bridge as his time runs out. Before Salas can do anything, Hamilton dies and falls into the shallow water of a storm drain.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2011\n","torrent":{"xt":"urn:btih:bdc8e6080c147b2a319e173923389d555fb1c02c","amp;dn":"IN+TIME+RMVB+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdc8e6080c147b2a319e173923389d555fb1c02c","infoHashBuffer":{"type":"Buffer","data":[189,200,230,8,12,20,123,42,49,158,23,57,35,56,157,85,95,177,192,44]},"announce":[],"urlList":[]}}