{"title":"VA - ministry of sound remix heaven - 2010","uid":6720443,"size":10915111,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:be46ebda077ee993c5318827082f1d5c60139d5c&amp;dn=VA+-+ministry+of+sound+remix+heaven+-+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ambient_music_girl88","files":1,"time":1317768951,"description":"Download Mp3s From VA - Ministry Of Sound - Remix Heaven 2010 - 2 CDs\n\nMp3 Song \n--------------------------------------------------------------------------------\n01 - Katy Perry Feat. Snoop Dogg - California Gurls (manhattan Clique Radio Edit) mp3 \n02 - Katy Perry - the synthetic dream foundation remix mp3 \n03 - Zoe Badwi - Freefallin (denzal Park Remix) mp3 \n04 - The Potbelleez - Hello (sneaker Fox Remix) mp3 \n05 - Taio Cruz Feat. Ludacris - Break Your Heart (wideboys Radio Edit) mp3 \n06 - Lady Gaga - Alejandro (bimbo Jones Radio Edit Remix) mp3 \n07 - Black Eyed Peas - Rock That Body (chris Lake Remix) mp3 \n08 - Benny Benassi Feat. Kelis Apl.de.ap And Jean - Baptiste - Spaceship (alex Gaudino And Jason Rooney Remix) mp3 \n09 - Rihanna - Rude Boy (low Sunday Radio Edit) mp3 \n10 - Kesha - Ti K To K (tom Nevilles Crunk And Med Mix) mp3 \n11 - Britney Spears - 3 (wolfgang Gartner Radio Edit) mp3 \n12 - Inna - Hot (cahill Club Edit) mp3 \n13 - Other Ego - Love The Way You Lie (amsterdam Cupcakes Remix) mp3 \n14 - Meck Feat. Dino - Feels Like A Prayer (club Mix) mp3 \n15 - N - Finity - Getting Over You (gordon And Doyle Electro - Gettin Over Remix) mp3 \n16 - Edward Maya - Stereo Love (dave Ramone Remix) mp3 \n17 - Cheryl Cole Feat. Will.i.am - 3 Words (steve Angello Radio Re - Production) mp3 \n18 - Jessica Mauboy - Up - Down (nufirm Remix) mp3 \n19 - Sia - Clap Your Hands (fred Faulke Remix) mp3 \n20 - Yolanda Be Cool And Dcup - We No Speak Americano (urchins Remix) mp3 \n21 - Hook N Sling Feat. Snob Scrilla - Gotta Make A Move (original Mix) mp3 \n22 - Ou Est Le Swimming Pool - Dance The Way I Feel (blue Eyed Remix) mp3 \n23 - Gus Gus - David (christian Luke Remix) mp3 \n24 - Miami Horror - Sometimes (hook N Sling Remix) mp3 \n25 - Example - Watch The Sun Come Up (moam Remix) mp3 \n26 - Roger Sanchez - 2 Gether mp3 \n27 - Apdw Vs. Tim Deluxe Feat. Sam Obernik - It Just Wont Do (warren Clarke Remix) mp3 \n28 - Armand Van Helden And A - Trak Present Duck Sauce - Anyway mp3 \n29 - Denzal Park - Filter Freak mp3 \n30 - Carl Kennedy And Tommy Trash Feat. Rosie Henshaw - Blackwater (original) mp3 \n31 - David Tort And Norman Doray - Chase The Sun (original ) mp3 \n32 - Bingo Players - Devotion (original) mp3 \n33 - Sgt. Slick - Everyday (digital Lab Remix) mp3 \n34 - Richard Vission And Static Revenger Starring Luciana - I Like That (angger Dimas Remix) mp3 \n35 - Deekline And Tim Healey Feat. Babe Ruth - The Mexican (deekline And Tim Healey Remix) mp3 \n36 - Dada Life - Just Bleep Me (satisfaction) mp3 \n37 - Neon Stereo - I See You Baby (vandalism Remix) mp3 \n38 - Will Reckless - Heaven Scent (vandalism Remix) mp3 \n39 - Hitmeister D - Looking Out For Love (radio Edit) mp3 \n\n\n","torrent":{"xt":"urn:btih:be46ebda077ee993c5318827082f1d5c60139d5c","amp;dn":"VA+-+ministry+of+sound+remix+heaven+-+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be46ebda077ee993c5318827082f1d5c60139d5c","infoHashBuffer":{"type":"Buffer","data":[190,70,235,218,7,126,233,147,197,49,136,39,8,47,29,92,96,19,157,92]},"announce":[],"urlList":[]}}