{"title":"PUSS IN BOOTS RMVB GLOBE","uid":6782783,"size":225894089,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bf029a0898bfe6526aac15c18d8c8294abefc8d9&amp;dn=PUSS+IN+BOOTS+RMVB+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1319975280,"description":"* RMVB CAM  * 01H20M50S  * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* RECOMMENDED PLAYERS :\n\n\n- RMVB PLAYER or - MEDIACOPE \n\nor convert to your prefered video type for any other player\n\n\n\n* INTRO :\n\n\nPuss in Boots is a 2011 computer-animated adventure film produced by DreamWorks Animation, directed by Chris Miller (who directed Shrek the Third in 2007), executive produced by Guillermo del Toro, starring Antonio Banderas, Billy Bob Thornton and Salma Hayek, and written by Tom Wheeler. It was released in theaters on October 28, 2011 in Digital 3D and IMAX 3D.\n \nThe film is a spinoff prequel to the Shrek series, and it follows the character Puss in Boots on his adventures before his first appearance in Shrek 2 in 2004. Accompanied by his sidekicks, Humpty Dumpty and Kitty Softpaws, Puss is pitted against Jack and Jill, two murderous outlaws who discover an ancient power which threatens the world.\n\n\n\n* Plot :\n \nThe story takes place before Puss met Shrek and Donkey, when he was a swashbuckling hero who protected the innocent. A bunch of old pub thugs tell him that two murderous outlaws called Jack and Jill have discovered an ancient power that can destroy the world. Puss then sets off on a journey with his old friend Humpty Dumpty who also introduces him to Kitty Softpaws, a sly black cat who takes an interest in Puss's journey. With his new sidekicks, Puss sets off on his most adventurous and dangerous journey ever.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n+ GLOBE FILES 2011\n","torrent":{"xt":"urn:btih:bf029a0898bfe6526aac15c18d8c8294abefc8d9","amp;dn":"PUSS+IN+BOOTS+RMVB+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf029a0898bfe6526aac15c18d8c8294abefc8d9","infoHashBuffer":{"type":"Buffer","data":[191,2,154,8,152,191,230,82,106,172,21,193,141,140,130,148,171,239,200,217]},"announce":[],"urlList":[]}}