{"title":"Great Orchestra music w/vocals 30's 40's Retro (musicfromrizzo","uid":6691362,"size":719955332,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c21474e4970eb8d806ac5973cc469be2e82c18da&amp;dn=Great+Orchestra+music+w%2Fvocals+30%5C%27s+40%5C%27s+Retro+%28musicfromrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"musicfromrizzo","files":-1,"time":1316599254,"description":"Enjoy some great old fashioned music from the 30s and 40s by well\nknown names in several Euro languages of vocal accompaniment - \njust like being on the set of &quot;Casablanca&quot; perhaps!\nCheers!\n\nMichael Rizzo Chessman\nmusicfromrizzo \n\n320k - approx 100 selections\n\n\nGreat Orchestras with singing 30s 40s (musicfromrizzo) \n\nAdalbert Lutter Mit Seinem Grossen Tanzorchester - Fatum\nAlfredo And His Orchestra - Tina\nAllan Jones &amp; Orchestra - The Donkey Serenade\nAmbrose &amp; His Orchestra - Too Many Tears\nAmbrose &amp; His Orchestra - When My Ship Comes In\nAmbrose &amp; His Orchestra With Chorus - O'kay, Toots\nAmbrose And His Orchestra - La Cucaracha\nAmbrose And His Orchestra - The Continental\nBarnabas Von Geczy Mit Orchester - Bitte, Bitte, Bitte (Vieni, Vieni)\nBarnabas Von Geczy Mit Orchester - Wie Ein Maerchen Vom Glueck\nBarnabas Von Geczy Mit Seinem Orchester - Ungarwein\nBarnabas Von Geszy Mit Orchester - Ich Bin Der Hans Im Glueck\nBenny De Weille Mit Seinem Orchester - Sie Will Nicht Blumen Und Nicht Chokolade\nBert Shefter And His Rhythm Octet - Chopin's Ghost\nDajos Bella And His Dance Orchestra - The Wedding Of Mr.mickey Mouse\nDuke Ellington And His Orchestra - Diga Digs Doo\nDuke Ellington And His Orchestra - Doin' The New Low Down\nEddy Duchin And His Orchestra - Cheek To Cheek\nElgarl Helgar, Grosses Tanzorchester Adalbert Lutter - Komm Doch In Meine Arme\nEnrique Madriguera Et Son Orchestre Avec Efrain Vocal - She's A Latin From Manhattan\nEnrique Rodri-Mur, Accomp. Orquesta Los Bolivios - Maldita Mujer!\nEric Helgar, Grosses Tanzorchester Adalbert Lutter - Heute Abend Bin Ich Frei!\nFredo Gardoni, Manuel Puig Et Leur Ensemble - Who's Afraid Of Big Bad Wolf\nGeorge Olsen And His Music - Rock-A-Bye Moon\nGeorges Milton Orchestre - Qui Craint Le Grand Mechant Loup\nGeorges Sellers Et Son Orchestre - Bon Coeur De Paris\nGeorges Sellers Et Son Orchestre - Ti-Ohi-Ohi-Oho\nGeraldo And His Gaucho Tango Orchestra With Vocal Chorus - Argentina\nGeraldo's Gaucho Tango Orchestra - Lady Of Madrid\nGrosses Tanzorchester Adalbert Lutter - Schenk Mir Dein Laecheln, Maria\nGuy Lombardo &amp; His Royal Canadians - Bei Mir Bist Du Schoen\nGuy Lombardo &amp; His Royal Canadians - Boo-Hoo\nGuy Lombardo &amp; His Royal Canadians - Donn'ama\nGuy Lombardo &amp; His Royal Canadians - Oh! Ma-Ma (The Butcher Boy)\nHarry Roy With May Fair Hotel Orchestra (London) - La Cucaracha\nHavana Novelty Orchestra - Oh, Mama\nHenry Hall &amp; His Bbc Dance Orchestra - By A Waterfall\nHenry Hall And His Bbc Dance Orchestra - Oh! Johanna\nHillo-Hawaiian Orchester - Aloma\nHillo-Hawaiian Orchester - Hawaiische Naechte\nHilo Hawaiian Orchestra - Hawaiian Dreams\nHilo Hawaiian Orchestra - Honolulu Moon\nJack Hylton And His Orchestra - Life Begins At Oxford Circus\nJazz-Harmonika - Ja, Das Ist Meine Melodie\nJean Vaissade Et Son Ensemble Musette - Deception\nJean Vaissade Et Son Ensemble Musette - Soleil Polka\nJeane Vaissade &amp; Ensemble Musette - The Smile\nKordt Sisters With Swing Accompaniment - Night And Day\nKordt Sisters With Swing Accompaniment - Some Of These Days\nL'accordeoniste Alexander Et Son Orchestre - C'est La Java\nL'accordeoniste Alexander Et Son Orchestre Refrain Chante Par Malloire - Pour Toi, Rio-Rita\nL'accordeoniste Deprince Et Son Orchestre - Il Pleut Sur La Route\nL'accordeoniste Deprince Et Son Orchestre - Laisse-Moi Partir\nLew Stone And His Band With Vocal Chorus - Anything Goes\nMarek Weber &amp; His Orchestra - C'est Pas Comme Ca (Not Like That)\nMarek Weber &amp; His Orchestra - Chinese Street Serenade\nMarek Weber &amp; His Orchestra - Ich Will Ja Nichts Als Deine Liebe (Argento-Step)\nMarek Weber &amp; His Orchestra - Lantern Dance\nMarek Weber &amp; His Orchestra - Tonight\nMarek Weber &amp; His Orchestra - Zigeuner, You Have Stolen My Heart\nMarek Weber Und Sein Orchester - Das Gibt's Nur Einmal\nMarek Weber Und Sein Orchester - Heurigenlied  Das Muss Ein Stueck Vom Himmel Sein\nMarek Weber Und Sein Orchester - Musik Muss Sein\nMarek Weber Und Sein Orchester - Schoen Ist Das Leben\nMarek Weber Und Sein Orchester - Zwei Herzen Im 34 Takt\nOdeon-Tanz-Orchester Met Gesang - Abends, Benn Die Lichter Gluehn\nOdeon-Tanz-Orchester Met Gesang - Halli! Hallo!\nOrchester Will Glahe (Mit Refraingesang) - Hein Spielt Abends So Schoen Auf Dem Schifferklavier\nOrchester Will Glahe (Mit Refraingesang) - Spanische Dorfmusik\nOrchestre Nullo Romani (Avec Guitare Hawaiienne) - Valse De Minuit\nOrchestre Nullo Romani Avec Scie Musicale Et Guitare Hawaiienne - Nuits Napolitaines\nOskar Joost Tanz-Orchester - Hu-O-Ho, Alter Schimmel, Hu-O-Ho (Roll Along Covered Wagon)\nOskar Joost Tanz-Orchester - Oh, Muki, Muki, Oh Wich Means!\nPaul Whiteman &amp; His Orchestra - Lonely Melody\nRay Noble &amp; His Orchestra - Sing As We Go\nRay Noble &amp; His Orchestra With Vocal Refrain - Yes, Mr.brown\nRay Ventura Et Ses Collegiens - Je Crois Bien Que C'est L'amour\nRay Ventura Et Ses Collegiens - Tout Va Tres Bien (Madam La Marquise)\nRobert Renard And His Dance Orchestra - Caro Mio\nRobert Renard And His Dance Orchestra - Femme Et La Roses\nRudy Valee &amp; His Connecticut Yankees - Ha-Cha-Cha\nTenore Daniele Serra (Con Orchestra Dino Olivieri) - Quando Canta Alla Radio Raimonda\nTenore Renzo Mori E Coro (Con Orchestra Dino Olivieri) - Veronica... Senza Fisarmonica\nThe BBC Dance Orchestra (With Vocal Chorus) - I'm Hitching My Wagon To You\nThe BBC Dance Orchestra (With Vocal Chorus) - La-Di-Da-Di-Da\nThe BBC Dance Orchestra - Samum (A Symphonic Foxtrot)\nTino Rossi &amp; Orchestra - Tchi Tchi\nTino Rossi &amp; Orchestre - C'est Toujours Toi (Ricordati Di Me)\nTino Rossi &amp; Orchestre - Ecris-Moi (Scrivimi)\nTino Rossi Et Orchestre Marcel Cariven - Guitare D'amour\nTino Rossi Et Orchestre Pierre Shagnon - Adieu Hawaii\nTino Rossi With Orchestra - Un Violon Dans La Nuit (Serenade In The Night)\nTurnier-Kapelle Dajos Bela - Der Arme Geiger (El Pobre Violinista)\nTurnier-Kapelle Dajos Bela - Rosen Und Frauen\nWaring's Pennsylvanians - Elizabeth\nWaring's Pennsylvanians - Oh, Donna Clara\nWill Glahe &amp; Sein Musette Orchester - Skoda Lasky (Beer Barrel Polka)\nWill Glahe Mit Seinem Orchester - Music! Music! Music!\nWill Glahe Und Sein Musette-Orchestre - Schoene Argentina","torrent":{"xt":"urn:btih:c21474e4970eb8d806ac5973cc469be2e82c18da","amp;dn":"Great+Orchestra+music+w%2Fvocals+30%5C%27s+40%5C%27s+Retro+%28musicfromrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c21474e4970eb8d806ac5973cc469be2e82c18da","infoHashBuffer":{"type":"Buffer","data":[194,20,116,228,151,14,184,216,6,172,89,115,204,70,155,226,232,44,24,218]},"announce":[],"urlList":[]}}