{"title":"In the Name of the Father","uid":6837806,"size":1414461432,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c33c66e7380350e2c904703b79eb6a177c6bcca8&amp;dn=In+the+Name+of+the+Father&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TUXtorrent","files":1,"time":1322065732,"description":"In the Name of the Father is a 1993 \n\nbiographical film directed by Jim Sheridan. It is based on the true life story of the Guildford Four, four people falsely convicted[2] of the IRA's Guildford pub bombings which killed four off-duty British soldiers and a civilian. The screenplay was adapted by Terry George and Jim Sheridan from the autobiography Proved Innocent: The Story of Gerry Conlon of the Guildford Four by Gerry Conlon\n\n\nCAST-------\n\nDaniel Day-Lewis as Gerry Conlon\n \nPete Postlethwaite as Giuseppe Conlon\n \nJohn Lynch as Paul Hill\n \nMark Sheppard as Paddy Armstrong\n \nBeatie Edney as Carole Richardson\n \nEmma Thompson as Gareth Peirce\n \nDon Baker as Joe McAndrew\n \nCorin Redgrave as Inspector Robert Dixon\n \nGerard McSorley as Detective Pavis\n\n Frank Harper as Ronnie Smalls\n \nJamie Harris as Deptford Jim\n \nTom Wilkinson as Appeal Prosecutor\n\n\nIn the Name of the Father won the Golden Bear at the 44th Berlin International Film Festival.[4]\n \nThe film was also nominated for seven Academy Awards, including Best Actor in a Leading Role (Daniel Day-Lewis), Best Actor in a Supporting Role (Pete Postlethwaite), Best Actress in a Supporting Role (Emma Thompson), Best Director, Best Film Editing, Best Picture and Best Writing, Screenplay Based on Material from Another Medium\n\n\nGerry Conlon is shown in Belfast stripping lead from roofs when the security forces home in on the district with armoured cars, and the dustbin lids beat out a riot. His father later saves him from IRA justice, as they are about to kneecap him, and he is sent off to London for his own good. There he finds a squat, to explore, as he puts it, free love and drugs. The evening when he walks off with some money from a prostitute's flat is when an explosion at a pub in Guildford kills five people and wounds 65.\n \nReturning to Belfast to share his fortune, the house is raided by special forces who arrest the whole family. Gerry and his friend are interrogated by police who intimidate them and he gives in and signs a confession when they threaten to kill his dad. In the subsequent trial, his family (the Macguire seven) are convicted of supporting the bombing on the basis of nitroglycerine traces, and four, including Gerry, are sentenced to long terms of imprisonment.\n \nHis time in jail shows a progression from a bitter son who rails at his father to an awakening when he discovers the real perpetrator of the bombing in the same jail. When this man sets fire to a jailer in a prison riot, Gerry is the one who saves him with a blanket. Gerry takes over the fight for justice himself when his father dies in custody.\n \nA campaigning lawyer (Emma Thompson) who has been trying to talk to Gerry has a break when she tries to access his father's file and is able to look instead at Gerry's, finding a file marked &quot;Not to be shown to the Defence&quot;. This leads to a triumphant scene in court when she produces the evidence that the police officers have been lying all the way through, which leads to the acquittal of all the accused.\n","torrent":{"xt":"urn:btih:c33c66e7380350e2c904703b79eb6a177c6bcca8","amp;dn":"In+the+Name+of+the+Father","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c33c66e7380350e2c904703b79eb6a177c6bcca8","infoHashBuffer":{"type":"Buffer","data":[195,60,102,231,56,3,80,226,201,4,112,59,121,235,106,23,124,107,204,168]},"announce":[],"urlList":[]}}