{"title":"Swordfish (A Senha: Swordfish (BR)","uid":6845729,"size":3153362944,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c42e094ac28caa49d034f67b9df0f029264cc77a&amp;dn=Swordfish+%28A+Senha%3A+Swordfish+%28BR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"luccyano1978","files":1,"time":1322335892,"description":"Swordfish (A Senha: Swordfish (BR), Swordfish (PT)) ÃƒÂ© um filme de suspense norte-americano, dirigido por Dominic Sena (60 Segundos) com John Travolta, Hugh Jackman, Don Cheadle e Halle Berry no elenco.\n\n\nSinopse\n\nO mais perigoso espiÃƒÂ£o do planeta tem por missÃƒÂ£o coagir um hacker que recentemente saiu da prisÃƒÂ£o a auxiliar no roubo de US$ 9,5 bilhÃƒÂµes de dÃƒÂ³lares em fundos governamentais. HÃƒÂ¡ um mundo oculto por baixo daquilo que chamamos de ciberespaÃƒÂ§o, que ÃƒÂ© protegido por firewalls, senhas e os mais avanÃƒÂ§ados sistemas de seguranÃƒÂ§a. Neste mundo estÃƒÂ£o escondidos os maiores segredos, as informaÃƒÂ§ÃƒÂµes mais incriminadoras e, obviamente, muito dinheiro. Este ÃƒÂ© o mundo de Gabriel Shear (John Travolta), espiÃƒÂ£o carismÃƒÂ¡tico e perigoso que deseja financiar aÃƒÂ§ÃƒÂµes antiterroristas, pois esta ÃƒÂ© sua forma de ser patriota e assegurar o american way of life. Mas para isso precisa entrar nesse mundo e conseguir pÃƒÂ´r as mÃƒÂ£os em fundos ilegais, que se originaram quando o DEA em 1986 fechou uma empresa de fachada. LÃƒÂ¡ havia 400 milhÃƒÂµes de dÃƒÂ³lares que &quot;ficaram perdidos&quot; e, em quinze anos, se transformaram em 9,5 bilhÃƒÂµes de dÃƒÂ³lares. Para pÃƒÂ´r a mÃƒÂ£o nesse dinheiro precisarÃƒÂ¡ de Stanley Jobson (Hugh Jackman), um super-hacker que tem conhecimento e talento para quebrar os sistemas de seguranÃƒÂ§a mais fechados do mundo. Stanley ÃƒÂ© um dos melhores hackers do planeta, no entanto foi legalmente proibido de se aproximar a menos de 45 metros de uma loja de eletrÃƒÂ´nicos depois de ter se metido em confusÃƒÂ£o com operaÃƒÂ§ÃƒÂµes altamente tecnolÃƒÂ³gicas do FBI de vigilÃƒÂ¢ncia cibernÃƒÂ©tica. No momento Stanley estÃƒÂ¡ morando em um trailer quebrado, nÃƒÂ£o tem dinheiro, estÃƒÂ¡ sozinho e sem a maior alegria da sua vida: Holly (Camryn Grimes), sua filha, pois perdeu a guarda no processo de divÃƒÂ³rcio para sua mulher, que agora estÃƒÂ¡ casada com um rico produtor de filmes pornogrÃƒÂ¡ficos, alÃƒÂ©m de ser uma de suas &quot;atrizes&quot;. Ginger (Halle Berry), uma cÃƒÂºmplice de Gabriel, conversa com Stanley e, como sabem que serÃƒÂ¡ difÃƒÂ­cil atraÃƒÂ­-lo, Ginger oferece 100 mil dÃƒÂ³lares para Jobson apenas &quot;bater um papo&quot; com Gabriel, sendo que se nÃƒÂ£o gostar poderÃƒÂ¡ ir embora com o dinheiro, que proporcionarÃƒÂ¡ a Stanley recomeÃƒÂ§ar sua vida e ter Holly novamente. Mas quando Stanley entra no mundo deles percebe que se fizer o serviÃƒÂ§o ganharÃƒÂ¡ 10 milhÃƒÂµes de dÃƒÂ³lares, mas ÃƒÂ© uma peÃƒÂ§a tÃƒÂ£o bÃƒÂ¡sica neste roubo high tech que nÃƒÂ£o tem a opÃƒÂ§ÃƒÂ£o de dizer nÃƒÂ£o.\n\n\n","torrent":{"xt":"urn:btih:c42e094ac28caa49d034f67b9df0f029264cc77a","amp;dn":"Swordfish+%28A+Senha%3A+Swordfish+%28BR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c42e094ac28caa49d034f67b9df0f029264cc77a","infoHashBuffer":{"type":"Buffer","data":[196,46,9,74,194,140,170,73,208,52,246,123,157,240,240,41,38,76,199,122]},"announce":[],"urlList":[]}}