{"title":"Democracy Now - 02 nov 2011","uid":6790642,"size":451791329,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c494ecf24a382c32af9e86d7de7fd8f73c6af306&amp;dn=Democracy+Now+-+02+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1320250755,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 02, 2011\n\n-  U.K. Court Rules WikiLeaks Founder Julian Assange Can Be Extradited to Sweden\n-  Greek Cabinet Backs Prime Minister's Call For Popular Referendum On $179 Billion Bailout\n-  Public Outcry Forces Bank of America to Drop Plan Debit Card Fee\n-  Occupy Protesters Call For City-Wide General Strike Today in Oakland\n-  New York City Occupy Supporters Join Anti-Police Brutality Activists in Stop &amp; Frisk Protest\n-  London: St. Paul's Cathedral Drops Plans to Evict Encamped Protesters\n-  Israeli Leaders Rallying Support to Attack Iran\n-  Following UNESCO Vote, Israel Punishes Palestine With More Settlements, Tax Revenue Freeze\n-  Human Rights Watch Condemns Turkey For Imprisoning Pro-Kurdish Intellectuals\n-  Office of French Satirical Newspaper Burned Down Day After Mocking Islamic Faith\n-  Japan: Operator of Crippled Nuclear Plant Particles May Be Result of Recent Nuclear Fission\n-  Georgia Militia Members Arrested for Plotting to Attack Government Officials\n\n\nSpecial reports\n\n- Occupy Oakland Prepares for General Strike as War Veterans Organize Day of Action at Occupy Camps\n\nProtesters in Oakland, California, are launching a citywide general strike today that will include an attempt to shut down the nation's fifth-busiest shipping port. The strike is expected to draw thousands of people to downtown Oakland, many responding to police attacks last week on nonviolent protesters with Occupy Oakland, including two-time Iraq War veteran Scott Olsen. During the strike, protesters intend to picket banks, businesses, schools, libraries, and any employers who try to reprimand striking workers. &quot;What this general strike is all about is this: this is a call to working people, not only throughout the United States, but throughout the world, to retract their labor. The only time that working people can gain the attention of the bosses or the ruling class is when we withhold our labor,&quot; says Clarence Thomas of the International Longshore and Warehouse Union Local 10. &quot;This is a fight-back moment.&quot; We also speak with Boots Riley of the hip-hop group The Coup. &quot;This general strike puts some teeth to the slogan that 'We are the 99 percent.' It's not only that we are the 99 percent and that they are the one percent; it's that the one percent gets all of their wealth by exploiting the 99 percent,&quot; Boots Riley says. &quot;And we want to show people that they can take it back if they want to.&quot; Meanwhile, in New York City, members of Iraq Veterans Against the War are planning to march in their military fatigues from Vietnam Veterans Plaza to Zuccotti Park, the heart of the Occupy Wall Street movement. &quot;It's clear that veterans are part of the 99 percent. Veterans, when they leave the military, are much more likely to face unemployment and homelessness,&quot; says Jose Vasquez of Iraq Veterans Against the War. &quot;Many people are forced to reenlist because they're facing a tough economic situation.&quot; Vasquez says they are encouraging veterans across the country to join their local Occupy protests.\n\n\n- WikiLeaks Founder Julian Assange Loses Appeal To Stop His Extradition to Sweden\n\nLondon's High Court has ruled Julian Assange, WikiLeaks founder and editor-in-chief, should be extradited from the United Kingdom to Sweden to face questioning over alleged sex crimes. Swedish authorities want to question Assange over accusations of rape and sexual assault made by two women. Assange's lawyers have argued the Swedish demand is legally flawed and that the sex was consensual. They are also concerned that the U.S. government will pressure Sweden to extradite him to the United States where an ongoing investigation is underway about the source(s) who leaked classified U.S. diplomatic cables and Department of Defense files to WikiLeaks. They are now considering an appeal to the Supreme Court of the United Kingdom and the European Court of Human Rights. For more, we speak with Helena Kennedy, an attorney on Assange's legal team We also air a statement made by Julian Assange made this morning in London.\n\n\n- Exclusive: Gaza-Bound &quot;Freedom Waves&quot; Flotilla Sets Sail From an Eastern Mediterranean Port\n\nAt the end of our live broadcast today, Democracy Now! received breaking news from a source aboard &quot;The Tahrir,&quot; a ship involved in the &quot;Freedom Waves to Gaza&quot; flotilla. Without any public notice, the ship left from an undisclosed port in the eastern Mediterranean Sea earlier today which the participants say is bound for the Gaza Strip. The &quot;Freedom Waves to Gaza&quot; flotilla marks the latest attempt by international activists to break the Israeli naval blockade of Gaza. Earlier this year, Greece blocked the departure of several ships from another flotilla heading to the region. In 2010, Israeli forces killed nine activists including a U.S. citizen on an aid boat called the &quot;Mavi Marmara,&quot; which was part of the first such international flotilla. Additional information on the &quot;Freedom Waves&quot; flotilla will be posted on our website, www.democracynow.org, once received.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c494ecf24a382c32af9e86d7de7fd8f73c6af306","amp;dn":"Democracy+Now+-+02+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c494ecf24a382c32af9e86d7de7fd8f73c6af306","infoHashBuffer":{"type":"Buffer","data":[196,148,236,242,74,56,44,50,175,158,134,215,222,127,216,247,60,106,243,6]},"announce":[],"urlList":[]}}