{"title":"Chicago - City of the Century (American Experience)","uid":6697297,"size":5298575426,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c553432323c211c2f328058817106beb16671fed&amp;dn=Chicago+-+City+of+the+Century+%28American+Experience%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rambam1776","files":-1,"time":1316842758,"description":"Chicago - City of the Century - Typical Episode Notes\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 2044kbps \nDuration.............: 1:26:50\nResolution...........: 848*478 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 1,463,779,308 \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0511739/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0511739/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.pbs.org/wgbh/amex/chicago/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wgbh/amex/chicago/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/KaKPbAadc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/KaKPbAadc&lt;/a&gt;\n\n\nOn May 1, 1893, as 200,000 onlookers roared their approval, President Grover Cleveland stepped from his carriage to open Chicago's Columbian Exposition. Cleveland delivered a short speech, after which fountains sprayed jets of water 100 feet high, thousands of flags unfurled and warships sounded explosive salutes. Once the cacophony subsided, the fair to celebrate the 400th anniversary of Columbus' arrival in the New World was officially open. In the following months, some 27 million people visited the fair, and the exhibition focused the world's attention on the city. That summer marked Chicago's moment of greatest power, the time at which the world's first skyscraper city had reached the pinnacle of its ascendancy as a center of culture, commerce and industry.\n\nCity of the Century tells how in just 60 years Chicago grew from a remote, swampy frontier town into one of the most explosively alive cities in the world. It's the story of the wealthy and the indigent, the heralded and the forgotten, the shop assistants and the millionaire retail barons who together created Chicago. It describes how through innovation, ingenuity, determination and sheer ruthlessness, the captains of industry created empires in a marshy wasteland. And it explores the hardships endured by the millions of working men and women -- most of them immigrants from Ireland and Northern Europe -- whose labor helped a capitalist class reinvent the way America did business.\n\nThe film opens with the discovery of Chicago's site by a missionary and an explorer in 1673, and follows the city's unparalleled growth -- no other city had ever grown so fast -- from the construction of the railroads that turned Chicago into the hub of a nationwide railway network to the dramatic post-fire reconstruction that gave the city the most distinctive skyline in the world.\n\nThe engine that fueled Chicago's rapid rise and made it a center of economic activity was the desire of its citizens to make money. The drive and determination of Chicagoans prompted one British visitor to characterize the city as &quot;the very embodiment of the world-conquering spirit of the age&quot; and spurred other commentators to view Chicago as the quintessential American city. By the late 19th century Chicago was literally throbbing with commercial activity. It was the largest grain port in the world and the home of the meat packing industry. Marshall Field had helped turn downtown into one of the finest shopping centers in America and Aaron Montgomery Ward had made the city the nation's mail-order capital.\n\nBut even as City of the Century revels in Chicago's triumphs, it delves into the heart of Chicago's many painful struggles. Nowhere else in the world did tremendous wealth and devastating poverty exist so closely side by side. While the city boasted some of the era's most forward-thinking social reformers, it was renowned for its plundering capitalists and corrupt local officials. In 1871 it was the victim of one of the most devastating fires in history, an inferno that killed 300 people and made 100,000 others homeless. In 1886, it was the site of the Haymarket incident, the tragic terrorist act that unleashed the first redhunt in American history.\n\nProduced and directed by veteran filmmaker Austin Hoyt (MacArthur, Reagan), City of the Century captures the rawness and energy, the optimism and heartbreak that makes the rise of Chicago a story of epic proportions.\n","torrent":{"xt":"urn:btih:c553432323c211c2f328058817106beb16671fed","amp;dn":"Chicago+-+City+of+the+Century+%28American+Experience%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c553432323c211c2f328058817106beb16671fed","infoHashBuffer":{"type":"Buffer","data":[197,83,67,35,35,194,17,194,243,40,5,136,23,16,107,235,22,103,31,237]},"announce":[],"urlList":[]}}