{"title":"Developing Flex 4 Components Using ActionScript &amp; MXML to Ex","uid":6715118,"size":4353221,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6afb2cbe67e99a1d62ce0abfb39e6543480f5d2&amp;dn=Developing+Flex+4+Components+Using+ActionScript+%26amp%3B+MXML+to+Ex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gware","files":1,"time":1317541726,"description":"Developing Flex 4 Components: Using ActionScript &amp; MXML to Extend Flex and AIR Applications\n\nMike Jones | Addison-Wesley | 2011-01-07 | 336 pages | English | PDF\n\nThe first book to completely demystify leading-edge component development with the Adobe Flex 3 platform - How to build components for Flex and AIR applications using ActionScript 3.0 and Adobe\\\\\\'s powerful MXML user interface markup language - Covers expert techniques most books ignore, including component metadata, error handling, documentation, and creating Flex components in Flash using the Flex Component Kit - By Mike Jones, world-renowned Flex development consultant and speaker Summary Adobe Flex 3 offers a powerful new framework that web developers can use to quickly produce richer, more immersive, higher-value solutions. To help developers build the most powerful next-generation web applications, Adobe structured the Flex framework around components, and allowed developers to extend Flex\\\\\\'s capabilities with their own components. However, few Flex developers know how to create these custom components. Developing Flex Components is the first book to completely demystify that process. Renowned Flex developer and speaker Mike Jones begins by presenting a quick overview of Flex and Flex Builder aimed at ActionScript 3.0 Flash developers. Jones explains the anatomy of a Flex component, including both visual and non-visual components, and introduces the components that come with the Flex framework. Next, one step at a time, he walks through building new Flex components that leverage the platform\\\\\\'s powerful capabilities and can be incorporated into both Flex and AIR applications. Jones covers topics that are rarely addressed in Flex books, including component metadata, events and error handling, data binding, skinning, styling, and creating Flex components in Flash using the Flex Component Kit. He also presents a full chapter on writing and maintaining component documentation, as well as an appendix of additional resources for Flex component developers.\n\nThis Ebook is brought to you by http://tutorialsfreephotoshop.com","torrent":{"xt":"urn:btih:c6afb2cbe67e99a1d62ce0abfb39e6543480f5d2","amp;dn":"Developing+Flex+4+Components+Using+ActionScript+%26amp%3B+MXML+to+Ex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6afb2cbe67e99a1d62ce0abfb39e6543480f5d2","infoHashBuffer":{"type":"Buffer","data":[198,175,178,203,230,126,153,161,214,44,224,171,251,57,230,84,52,128,245,210]},"announce":[],"urlList":[]}}