{"title":"Ron Thal - The Adventures of Bumblefoot [1995][MP3]-trother","uid":6746778,"size":46784356,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c6e9f7a2f773294e9da672da214d324647b5c9ed&amp;dn=Ron+Thal+-+The+Adventures+of+Bumblefoot+%5B1995%5D%5BMP3%5D-trother&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"trother","files":-1,"time":1318721038,"description":"            @@                       @@     @@\n           @@@                      @@@    @@@\n          @@@@@@  @@@@@    @@@@@   @@@@@@ @@@        @@@@@    @@@@@\n          @@@@@  @@@@@@@  @@@ @@@  @@@@@  @@@       @@@ @@@  @@@@@@@\n           @@@   @@@  !@ @@@   @@@  @@@   @@@@@@   @@@   @@@ @@@  !@\n           @@@   @@@     @@@   @@@  @@@   @@@@@@@  @@@   @@@ @@@\n           @!@   @!@     @!@   @!@  @!@   @!@  @!@ @!@@ @!@  @!@\n           !!@   !!@     !!@   !!@  !!@   !!@  !!@ !!@@      !!@\n            :!:   :!:     :!: :!:    :!:  :!:  :!:  :!:! :!   :!:\n             ::    ::      ::::       ::   ::  :::   ::::      ::\n                                               :::\n             ~ Ron Thal - The Adventure of Bumblefoot [1995] ~   \n                                           :::\n                                          :::\n\n\n                         1. Bumblefoot\n                     \n                         2. Orf \n\n                         3. Scrapie \n\n                         4. Blue Tongue \n\n                         5. Limberneck \n\n                         6. Q Fever \n\n                         7. Strawberry Footrot \n\n                         8. Ick\n\n                         9. Malignant Carbuncle\n\n                        10. Rinderpest \n\n                        11. Strangles \n\n                        12. Fistulous Withers\n\n\nReview:\n\nOne of the Craziest Adventures You'll Ever Take, May 19, 2009\nBy Stephen &quot;Stephen&quot; (NC, USA)\n\nI'm just another of many Ron Thal fans who have been as such long before his G'n'R gig... LONG before! His music has an incredible replay value that I haven't found in too many other musicians or bands. The progression of his music through the years has gone from very experimental to great, straight-forward rock compositions with a hint of his quirky side. Having said all of that, this is the album that started it all! This is the quintessential Ron Thal CD if you're looking for his most experimental work... but don't let the word, &quot;experimental&quot; fool you if you're more into straight-forward material! This CD has a way of appealing to a broad range of listeners.\n\nIf you're into instrumental music and you dig shred, you're going to love this CD. I think part of why this CD has such a high replay value for me is because it grows with me as I grow in my quest as both a musician and a listener. I'll go for a year or so not listening to it and then I'll pop it in one day and hear it seemingly for the first time again as my musical ear picks out something new each time. Likewise, you don't get the same formula over and over ala Yngwie Malmsteen. Sure, there's some material on this CD that really rips it up but his material is fun and doesn't have an air of egotism about it whatsoever! That all plays into part of why I love Ron in general, though. I've attended one of his guitar clinics and have likewise spoken with him a couple of times via email... he's the nicest guy you'll ever meet and though he knows he's a great guitarist, he's incredibly modest. His modesty and pure passion for music is what comes out on this CD.\n\nIf you love instrumental music with an emphasis on guitar and all you know about Ron is that he's the current guitarist for Guns 'n Roses, you've got one heck of a journey ahead of you via checking out his personal music catalogue... and what better of a way to start than to pick up his first release! Unfortunately, it's extremely difficult to find this CD for a reasonable price and though I would pay somewhere between $30.00 and $50.00 for the original, about the only way you can find it is to download it (either by paying for it or otherwise).\n\nThere's not much else to say other than pick this album up whenever you get a chance. It's really fun music that will never be duplicated. Just for the heck of it, check out what all he says about this album on the discography section of his site:\n &lt;a href=&quot;\nhttp://www.bumblefoot.com/discography/oldies/adventures.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bumblefoot.com/discography/oldies/adventures.htm&lt;/a&gt;\n\nThough I love this CD, my absolute favorite material of his comes on later CD's as he matures both as a guitarist and a musican overall, so if you can't get a hold of this CD, definitely try to find Hermit, 9.11, or Hands. Those albums include my absolute favorite guitar solos of his.\n\n-Stephen ","torrent":{"xt":"urn:btih:c6e9f7a2f773294e9da672da214d324647b5c9ed","amp;dn":"Ron+Thal+-+The+Adventures+of+Bumblefoot+%5B1995%5D%5BMP3%5D-trother","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6e9f7a2f773294e9da672da214d324647b5c9ed","infoHashBuffer":{"type":"Buffer","data":[198,233,247,162,247,115,41,78,157,166,114,218,33,77,50,70,71,181,201,237]},"announce":[],"urlList":[]}}