{"title":"Sperm Chromatin, 1st Edition {BBS}","uid":6714858,"size":14518029,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6eec65534f970d2816669f267a45444c682e98c&amp;dn=Sperm+Chromatin%2C+1st+Edition+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1317502893,"description":"Sperm DNA damage is common and has been associated with reduced rates of conception, impaired embryonic development and increased risk of miscarriage. Although the exact causes of sperm DNA damage are unknown, it is clear that infertile men possess substantially higher levels of sperm DNA damage than do fertile men. Written by leading, internationally renowned clinicians and basic scientists with expertise in sperm DNA, Sperm Chromatin: Biological and Clinical Applications in Male Infertility and Assisted Reproduction provides readers with a thoughtful and comprehensive review of the biological and clinical significance of sperm DNA damage. The work covers the fundamental principles of sperm chromatin architecture and function, the proposed modes of DNA damage and repair, the tests of sperm DNA damage, the clinical aspects of DNA damage and the impact of DNA damage on reproductive outcome. Unlike any other title on the topic, Sperm Chromatin: Biological and Clinical Applications in Male Infertility and Assisted Reproduction is an invaluable addition to the literature and will serve as an indispensable resource for basic scientists with an interest in sperm biology and for urologists, gynecologists, reproductive endocrinologists, and embryologists working in the field of infertility.\nProduct Details\n\n    * Hardcover: 534 pages\n    * Publisher: Springer; 1st Edition. edition (August 4, 2011)\n    * Language: English\n    * ISBN-10: 1441917810\n    * ISBN-13: 978-1441917812","torrent":{"xt":"urn:btih:c6eec65534f970d2816669f267a45444c682e98c","amp;dn":"Sperm+Chromatin%2C+1st+Edition+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6eec65534f970d2816669f267a45444c682e98c","infoHashBuffer":{"type":"Buffer","data":[198,238,198,85,52,249,112,210,129,102,105,242,103,164,84,68,198,130,233,140]},"announce":[],"urlList":[]}}