{"title":"Audiobook: The Anti-Christ (anti-Christian) - Friedrich Nietzsch","uid":6729090,"size":114251408,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c7a406b4558f7195eed61ac4a23ef803f925e2ca&amp;dn=Audiobook%3A+The+Anti-Christ+%28anti-Christian%29+-+Friedrich+Nietzsch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bdwilson","files":-1,"time":1318061393,"description":"Here is the great masterpiece of Friedrich Nietzsches, The Anti-Christ, wherein he attacks Christianity as a blight on humanity. This classic is essential reading for anyone wishing to understand Nietzsche and his place within the history of philosophy. \n\nWe should not deck out and embellish Christianity: it has waged a war to the death against this higher type of man, it has put all the deepest instincts of this type under its ban, it has developed its concept of evil, of the Evil One himself, out of these instincts-the strong man as the typical reprobate, the outcast among men. Christianity has taken the part of all the weak, the low, the botched; it has made an ideal out of antagonism to all the self-preservative instincts of sound life; it has corrupted even the faculties of those natures that are intellectually most vigorous, by representing the highest intellectual values as sinful, as misleading, as full of temptation. The most lamentable example: the corruption of Pascal, who believed that his intellect had been destroyed by original sin, whereas it was actually destroyed by Christianity!&quot; -Friedrich Nietzsche \n\n\nThis audiobook is a Librivox recording and is in the public domain.  ","torrent":{"xt":"urn:btih:c7a406b4558f7195eed61ac4a23ef803f925e2ca","amp;dn":"Audiobook%3A+The+Anti-Christ+%28anti-Christian%29+-+Friedrich+Nietzsch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7a406b4558f7195eed61ac4a23ef803f925e2ca","infoHashBuffer":{"type":"Buffer","data":[199,164,6,180,85,143,113,149,238,214,26,196,162,62,248,3,249,37,226,202]},"announce":[],"urlList":[]}}