{"title":"learner.org Physics for the 21st Century -Unit 10- DARK MATTER v","uid":6713883,"size":60380952,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c81b4228fb5d48ddb88e5e44e78d50d32868227b&amp;dn=learner.org+Physics+for+the+21st+Century+-Unit+10-+DARK+MATTER+v&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"krrazyps","files":1,"time":1317469070,"description":"This torrent contains the Unit 10 of the 11-unit series from Learner.org\n\nABOUT Unit 10. Dark Matter\n\nSince Swiss astrophysicist Fritz Zwicky first inferred its existence in 1933, dark matter has remained one of the greatest unsolved mysteries in cosmology. Invisible to telescopes, dark matter was detected through its effects on visible matter. Astronomical measurements have shown that dark matter is 3/4ths of all matter, but at present no one has yet directly observed a dark matter particle. See how astrophysicists are seeking evidence for dark matter at the center of the Milky Way galaxy (Doug Finkbeiner of Harvard) and how the LUX (Large Underground Xenon) detector almost a mile underground will look for dark matter particles (Rick Gaitskell of Brown)\n\n\nABOUT Learner.org - Physics of the 21st Century :\n\nDark matter, string theory, particle accelerators, and other big topics in modern physics come together in this 11-part multimedia course for high school physics teachers, undergraduate students, and all adults who are fascinated by physics and cosmology. The course covers a broad scale, from sub-atomic particle physics, through atomic and molecular physics, to cosmology. The 11 video programs feature 22 case studies of researchers from leading research labs and universities who are breaking new ground in their fields. An extensive companion Web site provides background information and concepts found in a printable online textbook, interactive simulations, a course facilitator's guide, and multiple other resources. \n","torrent":{"xt":"urn:btih:c81b4228fb5d48ddb88e5e44e78d50d32868227b","amp;dn":"learner.org+Physics+for+the+21st+Century+-Unit+10-+DARK+MATTER+v","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c81b4228fb5d48ddb88e5e44e78d50d32868227b","infoHashBuffer":{"type":"Buffer","data":[200,27,66,40,251,93,72,221,184,142,94,68,231,141,80,211,40,104,34,123]},"announce":[],"urlList":[]}}