{"title":"Deivathirumagal (2011) (Tamil) Ayn 1 CD RIP uploading at 1 Mbps ","uid":6721309,"size":760097760,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c93f56596e5e0598ee1fb5fb9d5d32f7191b1492&amp;dn=Deivathirumagal+%282011%29+%28Tamil%29+Ayn+1+CD+RIP+uploading+at+1+Mbps+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nrsadri","files":1,"time":1317804172,"description":"Krishna (Vikram) is a mentally affected man with the mentality of a five-year old, who lives a peaceful life in the hill station Ooty. He is cared for by Victor (Krishna Kumar), the owner of a chocolate factory where Krishna works. One day he excitedly announces to the village that he will become a father. That night, his daughter is born, but his wife Banumathy dies during childbirth. Unable to grasp the concept of death, he simply accepts that his wife has &quot;gone to God&quot; and starts life as a father. He names his daughter Nila, and raises her with love and care. She soon grows into a happy young girl (Sarah). With the help of Victor and his other mentally challenged friends, Krishna enrolls Nila in school.\nNila adjusts herself to school life, and befriends the correspondent Shwetha Rajendran (Amala Paul), who develops a maternal bond with the girl. But when she learns that Nila is Krishna's daughter, she refuses to let her stay with him. Soon a scuffle starts between Krishna and Shwetha's fiancÃƒÂ© Karthik (Karthik Kumar). It is broken up by the entry of Shwetha's father Rajendran (Sachin Khedekar) who reveals that his other daughter was Banumathy, who became estranged from him by choosing to marry Krishna. He offers to take Krishna and Nila with him and claims that they are part of his family. Victor agrees and sends them with Rajendran.\nAt a distance from Chennai, Rajendran tricks Krishna into exiting the car, and abandons him. Distraught, Krishna wanders around the city asking passerby where Nila is. He eventually arrives at a court, where he meets lawyer Vinod (Santhanam) who assumes that he is rich, and promises him that his boss will defend him. He introduces him to his boss/colleague Anuradha Ragunathan aka Anu (Anushka Shetty), who is hesitant to take up the case as she believes Krishna to be a lunatic. But soon, Victor arrives and explains Krishna's predicament, and, moved to tears, Anu agrees to help him.\nShe files a case against Rajendran, but loses hope when she learns that Rajendran's lawyer is Bashyam (Nassar), a feared senior lawyer who has never lost a case. The rest of the film deals with Krishna and Anu's attempt to get Nila back.\n\nScreenShots\n &lt;a href=&quot;\nhttp://bayimg.com/PAkigaAdF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PAkigaAdF&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/paKiHAADF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/paKiHAADF&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/PakIiAADF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PakIiAADF&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/pAkIJAADF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/pAkIJAADF&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/PAKikAaDF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PAKikAaDF&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/PAkILaADF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PAkILaADF&lt;/a&gt;","torrent":{"xt":"urn:btih:c93f56596e5e0598ee1fb5fb9d5d32f7191b1492","amp;dn":"Deivathirumagal+%282011%29+%28Tamil%29+Ayn+1+CD+RIP+uploading+at+1+Mbps+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c93f56596e5e0598ee1fb5fb9d5d32f7191b1492","infoHashBuffer":{"type":"Buffer","data":[201,63,86,89,110,94,5,152,238,31,181,251,157,93,50,247,25,27,20,146]},"announce":[],"urlList":[]}}