{"title":"Oliver Reed - Candice Bergen - The Hunting Party (1971)","uid":6691562,"size":6388303872,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cb5358f8e1197a042570bd97b8271ffe2b593287&amp;dn=Oliver+Reed+-+Candice+Bergen+-+The+Hunting+Party+%281971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"oddeven","files":12,"time":1316605712,"description":"Sorry, the photo server appears to be out today...\n\nMuch like another Candice Bergen flick I've recently watched (Soldier Blue, from 1970), it appears that a lot of blood and guts were removed from this film shortly after it was released. From descriptions I've found I don't think any scenes have been cut from this edition. IMdB says it should be 1.85:1, but this is presented in 4:3 (the box says 1.85:1). The American MGM edition is listed on Amazon as being 1.33:1, but it also says fullscreen and widescreen, so maybe it is a dual sided disc.  I can't say for sure whether this is truly cropped.\n\nIn any case, we have Oliver Reed playing a bandit with a heart, and a conflicted one at that. He also seems dubbed. We see him in contrast to Gene Hackman, a very rich man that seems to be lacking any warmth whatsoever, and he is the husband of Candice Bergen.  The opening scene shows us just how much he seems to care for his wife. When she is kidnapped, basically to give reading lessons... we don't really know more...Hackman organizes a hunting party to &quot;take justice into his own hands&quot; along with his Cheneyesque sycophantic buddies. He's got the advantage in some dastardly effective new rifles.  The bad boys are in for a lot of trouble.\n\nThere are plenty of extra familiar faces in this film.  Those guys that seemed to tag along for just about any Western.  Even some of the scenery, from Spain, looked well used. One shot looked right out of &quot;The Singer not the Song&quot;, from ten years earlier.\n\nThough director Don Medford seemed to keep himself quite busy, he made very few feature films, mostly sticking to television.\n\nUncompressed NTSC DVD9 VIDEO_TS files. No extras.","torrent":{"xt":"urn:btih:cb5358f8e1197a042570bd97b8271ffe2b593287","amp;dn":"Oliver+Reed+-+Candice+Bergen+-+The+Hunting+Party+%281971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb5358f8e1197a042570bd97b8271ffe2b593287","infoHashBuffer":{"type":"Buffer","data":[203,83,88,248,225,25,122,4,37,112,189,151,184,39,31,254,43,89,50,135]},"announce":[],"urlList":[]}}