{"title":"AIO Photodex Proshow Producer 4.52.xx","uid":6724469,"size":1915136441,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cb96e2751bef8c949cb47577b07632d6752cb798&amp;dn=AIO+Photodex+Proshow+Producer+4.52.xx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ztorrenter","files":4,"time":1317898613,"description":"Title: AIO Photodex Proshow Producer\nBrought to you by Zidoune\nVersion: 4.52.3053\nCompressed Size: 1.78 GB\nISO Size after decompressing: 2.67 GB\nRequirements: Windows: All\nLanguages: English\nScreenshot: http://img718.imageshack.us/img718/3262/snapel.png\n------------------------------------------------------------------------------------------------\nInstructions:\n------------------------------------------------------------------------------------------------\n1. Extract \n2. Mount the ISO in a virtual drive or burn to DVD\n3. Install the program\n4. Use the Keygen or the serial to register (read the instruction first on how to use the keygen)\n5. Install any of the style packs\n6. Enjoy it !!!!!\n----------------------------------------100% Clean ---------------------------------------\n\n\n------------------------------------------------------------------------------------------------\nDirect download for free too :-) ( only2 files )\n------------------------------------------------------------------------------------------------\n\n\n------------------------------------------------------------------------------------------------\nDescription:\n------------------------------------------------------------------------------------------------\nProShow Producer - Professional-grade presentation masterpieces\n\nThe all-new ProShow Producer allows you to create advanced, professional-grade presentation masterpieces\nthat not only emotionalize and inspire audiences but also bring them to the point of sale.\n\nWith an award-winning feature set, including copy protection, show templates, unlimited photo/video layering,\n built-in media authoring and branding, as well as all-new creative features like masking, vignetting and motion \nkeyframing, the only limit to your success is your imagination.\n\nProShow Producer features:\n\nLayers:\n- Drag and drop to easily add content to a show.\n- Supports 100+ file types.\n- Transparency support for PSD, PNG, TIFF and GIF files.\n- Turn any layer into a fully-customized mask to conceal or reveal aspects of underlying layers.\n- Add a gradient or solid color as a slide layer to a layer to get incredible results.\n- Spice up a presentation using interactive slide actions to launch PDFs, spreadsheets, webpages and more.\n- Set transition effects for individual layers.\nEditing:\n- Optimize your workflow using built-in image correction tools like sharpen, colorize, saturate and more.\n- Create enhanced borders for your photos and videos with ProShow Producer's all-new vignette effect.\n- Create Hollywood-style greenscreen effects with the all-new Chroma Key Transparency tool.\n- Specify opacity for any layer on a slide.\n- Add depth to your composition by adjusting the color and opacity of a shadow on any layer in a slide.\n- Crop and rotate your photos and videos with precision.\n- Use the red-eye removal tool to correct any photo in your show in seconds.\nEffects:\n- Use adjustment effects to produce spectacular effects. Make a video move through color shifts or \n  create a sequence of photo fades.\n- Add multiple keyframes to each adjustment effect.\n\nProfessional slideshows your way.\nTurn your photos, videos and music into totally custom, professional video slideshows for clients, friends and family. \nWith Producer there are no limits; use unlimited photos, videos and effects to turn your creative ideas into reality.\n\n\nSlick, polished shows in minutes.\nSave time and speed-up your workflow with Producer's built-in wizard. Create a show in just minutes with dozens \nof professional themes perfect for weddings, engagements, family photos, nature and outdoor shots, \ntravel photography and more.\n\nWhen you're ready to take total control, ProShow Producer offers up some seriously powerful tools and effects \nto customize every aspect of your slideshow.\n\nAdd ready-made styles &amp; transitions.\nTurn your photos and videos into exciting layouts and polished animations with hundreds of effects available \nin ProShow Producer. Just click to preview and apply to any scene in your show. Simulate everything from page \nturns and camera flashes to blurs and fades.\n\n...Or, build your own custom effects.\nTake the reins and create your own custom effects with Producer's keyframing, masking and adjustment layers.\nand effects. Create your own slide styles, transitions and show templates. Build a library of your own, custom \neffects for a streamlined workflow and consistent slideshows.\n","torrent":{"xt":"urn:btih:cb96e2751bef8c949cb47577b07632d6752cb798","amp;dn":"AIO+Photodex+Proshow+Producer+4.52.xx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb96e2751bef8c949cb47577b07632d6752cb798","infoHashBuffer":{"type":"Buffer","data":[203,150,226,117,27,239,140,148,156,180,117,119,176,118,50,214,117,44,183,152]},"announce":[],"urlList":[]}}