{"title":"ExploitedCollegeGirls - Mimi ** July 05, 2012 **","uid":7417314,"size":908754623,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:cce9ab0b9d96bbadf420e56fb367778787e6f710&amp;dn=ExploitedCollegeGirls+-+Mimi+%2A%2A+July+05%2C+2012+%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xavier461","files":1,"time":1341559803,"description":"Screenshots\n &lt;a href=&quot;\nhttp://imagetwitch.com/?p=1267&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagetwitch.com/?p=1267&lt;/a&gt;\n\n\n\nSize: 908754623 bytes (866.66 MiB), duration: 01:03:58, avg.bitrate: 1894 kb/s\nAudio: wmav2, 44100 Hz, stereo, 96 kb/s\nVideo: wmv3, yuv420p, 768x432, 1784 kb/s, 29.97 fps\n\n\nSchool: Miami University\nYear: Sophomore\nAge: 19\nHeight: 5'5\nFigure:34C-26-32\nEye Color: Hazel\nTags: Puerto Rican, great tits, Sybian, orgasms, best sex she's ever had\nABOUT\n\n\nCan I interest you in a feisty Puerto Rican girl today? Well, right along this way then. Tell you what, we get a lot of latinas sending in their applications. But there was just something about Mimi that made me say yes immediately. I'm glad I did. The chick is great, not only does she have a killer body with one of the greatest set of natural tits I've ever seen, she's also a boat load of fun. Just listen to her truly shocking pre-college sex story (I can't divulge too much here, you'll know why when you watch the video) and you know what I mean. Not condoning what she's saying here but you get an idea of her personality. She's...ummm...out there, for sure.\nOnce you recover from what she's telling us about her pre college days, we learn a little more about her during the interview segment. But Mimi is hot and ready to get going, and the topic is masturbation - so we don't want to waste too much time talking. Jay has a surprise for her - the Sybian. It's a high powered machine made solely to make a girl cum. It works almost every time and in Mimi's case it works several times. She's not sure at all about the thing at first but just a few seconds of the toy rotating and vibrating in her pussy and Mimi is cumming. You'll love watching her surprised facial expressions when she cums again and again. She makes herself cum one more time, this time with the vibrating cock attachment on her clit. She is working on another orgasm when Jay walks up to her with a hard-on and without saying a word, Mimi starts sucking him off while she keeps riding the Sybian. You wanna see some enthusiastic cocksucking skills? Watch Mimi do her thing. She gags herself until tears stream down her face. &quot;If I don't have tears in my eyes, I'm not doin' it right&quot;, she says. What a girl!\nIt's straight-on enthusiastic fucking from here on out. Mimi turns up the volume to 11 and at times I'm thinking she's trying to be a pornstar, what with all the screaming and moaning. But then you see her pussy juices soak Jay's cock and you know this girl is cumming for real. Personally I love watching her facial expressions and her tits bounce when she gets fucked hard. Jay gets pretty creative and even Mimi is surpised at some of the things he does to her to get her off. After a truly energetic fuck session, Jay unloads a huge wad of cum into her mouth, over her face, and all over her tits and hair. &quot;That's the best sex I've ever had!&quot;, she confesses in the end, as she wipes off her semen covered face. Judging by her facial expressions, her enthusiasm, and her many orgasms, I think she's telling the truth. ","torrent":{"xt":"urn:btih:cce9ab0b9d96bbadf420e56fb367778787e6f710","amp;dn":"ExploitedCollegeGirls+-+Mimi+%2A%2A+July+05%2C+2012+%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cce9ab0b9d96bbadf420e56fb367778787e6f710","infoHashBuffer":{"type":"Buffer","data":[204,233,171,11,157,150,187,173,244,32,229,111,179,103,119,135,135,230,247,16]},"announce":[],"urlList":[]}}