{"title":"Thin Lizzy   (The Collector's Edition - MP3 @ 320kbps)","uid":6766185,"size":1115803317,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:cd12c8b889a97ac68b1fae8616bb2f9141316248&amp;dn=Thin+Lizzy+++%28The+Collector%5C%27s+Edition+-+MP3+%40+320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":186,"time":1319395006,"description":"Thin Lizzy are an Irish hard rock band who formed in Dublin, Ireland in 1969. The band was originally led by bassist, songwriter and singer Phil Lynott. They are best known for their songs &quot;Whiskey in the Jar&quot;, &quot;Jailbreak&quot;, &quot;The Boys Are Back in Town&quot; and &quot;Bad Reputation&quot;, all major international hits still played regularly on hard rock and classic rock radio stations.\n\n\nThough others had earlier used similar techniques, Thin Lizzy is widely recognised as one of the first hard rock bands to employ double lead guitar harmony (the twin guitar clash) - a technique pioneered by Wishbone Ash in the UK, whilst independently in the USA by Lynyrd Skynyrd and The Allman Brothers Band. This style was later refined and popularised by bands of the emerging New Wave of British Heavy Metal, Judas Priest and Iron Maiden especially. The latter group in particular has praised Thin Lizzy extensively and even covered the song &quot;Massacre&quot; from Lizzy's popular Live and Dangerous album. Examples of this dual guitar harmony technique include &quot;The Boys Are Back in Town&quot; and &quot;Cowboy Song&quot; from Jailbreak. Brian Robertson's unconventional use of the wah-pedal as an extension of the instrument during soloing rather than as a purely rhythmic effect, as described in the Total Accuracy video &quot;Still in Love with the Blues&quot; (featuring Brian Robertson &amp; Stuart Bull), is a distinctive and influential sound.\n\n\nplease see the details for the albums included, enjoy.","torrent":{"xt":"urn:btih:cd12c8b889a97ac68b1fae8616bb2f9141316248","amp;dn":"Thin+Lizzy+++%28The+Collector%5C%27s+Edition+-+MP3+%40+320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd12c8b889a97ac68b1fae8616bb2f9141316248","infoHashBuffer":{"type":"Buffer","data":[205,18,200,184,137,169,122,198,139,31,174,134,22,187,47,145,65,49,98,72]},"announce":[],"urlList":[]}}