{"title":"Handbook of Neurotoxicology(2 Vols){BBS}","uid":6853311,"size":16809576,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd5d3008657b15e7388961cec86fdaa834d0e7b6&amp;dn=Handbook+of+Neurotoxicology%282+Vols%29%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bigbluesea","files":-1,"time":1322604232,"description":"Neurotoxins-whether natural products that can provide valuable therapeutic agents and research reagents or human-generated pollutants-have recently attracted great scientific interest. In the Handbook of Neurotoxicology, Volumes I and II, many leading researchers and clinicians-all acknowledged experts-review in depth the status of research in key areas of current neurotoxicologic interest and examine the latest methodologies for in vivo assessment of a wide spectrum of agents exhibiting neurotoxicologic properties. This second volume of the Handbook focuses on the biologic effects of human-made toxins on the developing organism, and of drugs of abuse. Here are discussed the interpretation of neurotoxicity data, the art of risk assessment, and the manifestation of CNS insult during development. The drugs of abuse surveyed include cocaine, marijuana, the cannabinoids, and amphetamines. Also provided are state-of-the-art methods for the evaluation of neurotoxicant effects by both imaging and neurobehavioral assessment. Volume I concentrates on the biological effects of both human-made neurotoxins (pesticides, mercury, lead, zinc, and polytypic by-products of combustion and manufacture) and those of natural origin (microbial and animal toxins). Up-to-date and timely, the Handbook of Neurotoxicology, Volumes I and II, not only affords today's biomedical and clinical investigators a full panoply of knowledge in all the critical areas of current neurotoxicologic interest, but also illuminates the latest methodologies for assessing the effects of a broad spectrum of significant neurotoxicological agents.\nProduct Details\n\n    * Hardcover: 684 pages\n    * Publisher: Humana Press; 1st edition (December 15, 2001)\n    * Language: English\n    * ISBN-10: 0896037967\n    * ISBN-13: 978-0896037960","torrent":{"xt":"urn:btih:cd5d3008657b15e7388961cec86fdaa834d0e7b6","amp;dn":"Handbook+of+Neurotoxicology%282+Vols%29%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd5d3008657b15e7388961cec86fdaa834d0e7b6","infoHashBuffer":{"type":"Buffer","data":[205,93,48,8,101,123,21,231,56,137,97,206,200,111,218,168,52,208,231,182]},"announce":[],"urlList":[]}}