{"title":"La storia in giallo 154 - Cristoforo Colombo [Mp3 Ita] [TNTvilla","uid":6715980,"size":75311774,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cf61fd5f5742ec64b2204875194292de6019b02f&amp;dn=La+storia+in+giallo+154+-+Cristoforo+Colombo+%5BMp3+Ita%5D+%5BTNTvilla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"darayava","files":1,"time":1317566670,"description":"La storia in giallo 154 - Cristoforo Colombo [Mp3 Ita] [TNTvillage]\n\nLA STORIA IN GIALLO\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra\n\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalitÃƒÂ  borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\nLa storia in giallo - in onda il 04/03/2006\n\nCRISTOFORO COLOMBO\n\n\nÃƒË† l'estate del 1492. L'ammiraglio Cristoforo Colombo, convinto di poter raggiungere l'oriente navigando ad Occidente, si reca alla corte di Isabella di Castiglia per ottenere il finanziamento della sua impresa. ÃƒË† l'ennesimo tentativo, dopo tanti altri andati falliti. Ma questa volta, Colombo ha trovato la persona giusta. Nell'agosto di quello stesso anno, salpa con tre caravelle, la Nina, la Pinta e la Santa Maria. Giunge cosÃƒÂ¬ il 12 ottobre del 1492. Dopo settimane di navigazione, l'ammiraglio genovese tocca terra. ÃƒË† convinto di aver raggiunto l'Asia, non capisce che quello che ha scoperto ÃƒÂ¨ un nuovo continente. Si scontra con una realtÃƒÂ  primitiva che non aveva preventivato, imbattendosi anche in tribÃƒÂ¹ che praticano l'antropofagia. Quando torna in Spagna, l'accoglienza che gli viene tributata ÃƒÂ¨ trionfale e Colombo prepara altre spedizioni. Costretto a sedare nel sangue una serie di rivolte, ben presto vede la sua stella eclissarsi e quando muore, nel maggio del 1506, ÃƒÂ¨ ormai un uomo solo.\nAntonella Ferrera intervista lo storico Franco Cardini, professore di Storia Medievale all'Universita' di Firenze.\nLa voce di Cristoforo Colombo ÃƒÂ¨ quella di Massimo Rossi.\n\nFile Details\n========================================\nName..........: 2006 - Cristoforo Colombo.mp3\nFilesize......: 71Mb\n\nAudio Bitrate.: 192Kbps\nAudio Freq....: 44KHz\nAudio Channels: Mono\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:cf61fd5f5742ec64b2204875194292de6019b02f","amp;dn":"La+storia+in+giallo+154+-+Cristoforo+Colombo+%5BMp3+Ita%5D+%5BTNTvilla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf61fd5f5742ec64b2204875194292de6019b02f","infoHashBuffer":{"type":"Buffer","data":[207,97,253,95,87,66,236,100,178,32,72,117,25,66,146,222,96,25,176,47]},"announce":[],"urlList":[]}}