{"title":"Health.Care.In.Ontario.Canada.A.Rational.Look.At.How.To.Fix.The.","uid":6702552,"size":153413,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cfe343a09f1aca5c83b109df90997c8f24af15fe&amp;dn=Health.Care.In.Ontario.Canada.A.Rational.Look.At.How.To.Fix.The.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"m2brier","files":3,"time":1317036752,"description":"  This is an proposal specifically written in order to reorganize and reallocate resources possessed by the Province of Ontario Canada so health care is delivered equitably and efficiently.  Implementation strategies include giving pharmacists the right to use their full skill set, via certain types of prescription renewals without a doctor, converting the vast number of money wasting walk in clinics back to traditional health care providers/general practitioners.  education program and mass distribution of thermometers to save untold millions of dollars(a day in the winter) as patients can be informed of when it is or is not worth while to attend a clinic(with safety and patient care as the number one priority.  base wage increases for all doctors, per service fee allocations for pharmacists providing consiulation services, etc.\n\n  there are many good ideas in here all that will save our great province money in order so every Ontarian can have a real doctor-a family doctor.  savings are easy since cost differential between effective family doctor model and inefficient walk in clinic model is 4 times, at least twice the service(since the doctor actually knows who you are, etc. \n\n\nread the entire proposal, i'd like to float this white paper all the way to Queens Park.\n\nI am hoping Dalton Mc Guinty will have the vision to see some if not all of the reforms passed, as possibly hundreds of millions of dollars could be saved, then re-allocated to primary health care so we all have a family doctor.\n\nkind regards ","torrent":{"xt":"urn:btih:cfe343a09f1aca5c83b109df90997c8f24af15fe","amp;dn":"Health.Care.In.Ontario.Canada.A.Rational.Look.At.How.To.Fix.The.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfe343a09f1aca5c83b109df90997c8f24af15fe","infoHashBuffer":{"type":"Buffer","data":[207,227,67,160,159,26,202,92,131,177,9,223,144,153,124,143,36,175,21,254]},"announce":[],"urlList":[]}}