{"title":"Hidden Treasures  (BBC 2003 - Complete)","uid":6698382,"size":2936888099,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d07292a77b9caa3b6080da50d6f4c30ad1e341fc&amp;dn=Hidden+Treasures++%28BBC+2003+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"neil1966hardy","files":15,"time":1316823833,"description":"\nBBC Hidden Treasure\n\n\n\nInformation\n\nBBC 2003\nMiranda Krestovnikoff explores few of the best treasures UK metal-detectorists have found in recent years .\n\n\n\n1. Lost Goddess\n\nThe Near-Baldock Hoard - Some hoards include a variety of precious objects arranged in a deliberate way: they form a 'structured deposit'. The Near-Baldock Hoard - found by metal-detectorist Alan Meek in a field in North Hertfordshire - is such a site, and comprised, from top to bottom: a 15cm silver figurine of a woman (badly corroded); two silver arms from a female figure, and a collection of gold jewellery (a pair of disc brooches, a pair of discs linked by a chain, and a gold clasp set with a red carnelian gemstone, engraved with a standing lion resting its paw on a bull's head or ox skull); seven gold votive plaques; and 12 silver-alloy votive plaques, which were brittle and fragmentary.\n\n\n\n2. Caesar?s Gold\n\nThe Winchester Treasure - Archaeologists have found many examples of elaborate personal ornaments worn by the Late Iron Age elite (100 BC-AD 50). But few finds can compare with two sets of gold jewellery recovered by metal-detectorist Kevan Halls in a field near Winchester in Hampshire. Each comprised a bracelet, a necklace torc (or neck-ring), and two brooches linked by a chain (though only one chain was actually recovered).\n\nThe objects were found in ploughsoil and, since archaeologists failed to find any other evidence, how they got there remains a mystery. Were they buried for safety, as an offering to the gods, or to accompany the dead on their journey to the underworld?\n\n\n\n3. Pagan Silver\n\nThe Leicestershire hoards - Amateur archaeologist Ken Wallace recently discovered that a field near his Leicestershire home contained over 3,000 coins of the Iron Age (700 BC-AD 50) - the largest number ever recorded from a single site in Britain.\n\nOther finds included a Roman cavalryman's gilded parade-helmet, and enormous quantities of pig bone, spread across the ground like a pavement. The coin pits were enclosed by a boundary ditch with an elaborate entrance. The site must have been a sanctuary dedicated to an unknown Celtic god.\n\n\n\n4. Cup of Gold\n\nThe Ringlemere Cup - Cups were common grave-goods in the Bronze Age (2200-700 BC). Usually made of pottery, they could sometimes be metal, and very occasionally gold. There are several examples of gold cups from continental Europe, but until recently the only one from Britain was that found in a cairn (a pile of stones over a burial) at Rillaton in Cornwall in the nineteenth century.\n\nThen Cliff Bradshaw found another with his metal-detector on the site of a huge barrow (a mound of earth over a burial) at Ringlemere in Kent. About the size of a coffee mug, it has thin corrugated sides, punched dots beneath the rim, a rounded base, and a delicate little handle attached by rivets secured with lozenge-shaped washers. All this detail was immediately apparent to the finder: gold does not corrode but comes out of the ground as untarnished and beautiful as the day it was buried.\n\n\n\n5. Suffolk Mystery\n\nAnglo-Saxon bedburial among other finds carried out by Dave Cummings and John Newman . Has this Suffolk site been a mint , a settlement or semetary ?\n\n\n\n6. Riches of Rome\n\nThe Wheathampstead burials - Two of the richest burials from Roman Britain (AD 43-410) were uncovered by St Albans archaeologists, after metal-detectorist Dave Phillips showed them some spectacular finds. They recovered a total of 153 separate items, including 13 bronze vessels, 14 Samian vessels (fine tableware with a red glossy surface), nine glass vessels, three iron blades, two silver brooches (decorated with sea serpents) with their connecting chain, a bronze lamp-holder, various bronze fittings from a wooden casket, various fragments of ivory, and a bag full of huntsmen's arrows.\n\nWhat sort of people were buried with so many top-of-the-range artefacts?\n\n\n\n7. Saxons , Vikings and Monsters\n\nThe East Lincolnshire sword - Leading Lincolnshire archaeologist Kevin Leahy recently identified five separate, beautifully decorated pieces of gold, found by a local metal-detectorist, as fittings from a single Anglo-Saxon sword handle of the seventh century AD. There was a pommel cap, two plates from the pommel and the crosspiece respectively, and two ferrules from the hilt itself.\n\nEach bore decoration in gold filigree, the applied wire fused with the metal beneath to form an invisible bond. Garnets had been inset in 'cabochon' style - which means they had not been cut, but were left as pebbles and polished. The bottoms of the cells in which the garnets had been placed were formed from corrugated gold foil, which reflected the light, making them glitter.\n\n8. Find of the series\n\n\n\nTechnical Specs\n\nVideo Source: DVBc &gt; MPEG2 &gt; Divx\nVideo Codec: Divx 6\nVideo Bitrate: ~1550\nVideo Resolution: 704x432 (1.63:1)\nVideo Aspect Ratio: 4:3\nAudio Codec: MP3\nAudio BitRate: 128 kb/s (64/ch) CBR 48000 Hz\nRunTime Per Part: 30m\nNumber Of Parts: 8\nPart Size: 350mb\n\nEnjoy!!","torrent":{"xt":"urn:btih:d07292a77b9caa3b6080da50d6f4c30ad1e341fc","amp;dn":"Hidden+Treasures++%28BBC+2003+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d07292a77b9caa3b6080da50d6f4c30ad1e341fc","infoHashBuffer":{"type":"Buffer","data":[208,114,146,167,123,156,170,59,96,128,218,80,214,244,195,10,209,227,65,252]},"announce":[],"urlList":[]}}