{"title":"The Secret Circle S01E03 Nl subs DutchReleaseTeam","uid":6720084,"size":368280937,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d0aceda642a54ebbdee86bc9b60dcad72388d19d&amp;dn=The+Secret+Circle+S01E03+Nl+subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Koedje","files":-1,"time":1317756878,"description":"Plot:\n\nCassie Blake was a happy, normal teenage girl, until her mother Amelia dies in what appears to be a tragic accidental fire. Orphaned and deeply saddened, Cassie moves in with her warm and loving grandmother Jane in the beautiful small town of Chance Harbor, Washington - the town her mother left so many years before - where the residents seem to know more about Cassie than she does about herself. When her new friends explain that they are all descended from powerful witches, and they've been waiting for Cassie to join them and complete a new generation of the Secret Circle, Cassie refuses to believe them - until Adam shows her how to unlock her incredible magical powers.\n\n\nVertaling : elthijsie, Winchestergirl &amp; Chillywitch\n\n\nSeizoen 1 Aflevering 3: Loner\n\n\nA cute jock named Luke asks Cassie to the school dance, and after watching Adam spend time with Diana at the boathouse, she accepts his offer. Meanwhile, Melissa sees the dance as an opportunity to get closer to Nick. Faye, on the other hand, has no plans to go and remains focused on finding a way to control her powers. Dawn discovers someone from their past, an intense man named Zachary, is in town asking questions about the Cassie and the Circle, so she asks Charles to keep an eye on him. \n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.be\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:d0aceda642a54ebbdee86bc9b60dcad72388d19d","amp;dn":"The+Secret+Circle+S01E03+Nl+subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0aceda642a54ebbdee86bc9b60dcad72388d19d","infoHashBuffer":{"type":"Buffer","data":[208,172,237,166,66,165,78,187,222,232,107,201,182,13,202,215,35,136,209,157]},"announce":[],"urlList":[]}}