{"title":"Dad's Army  (BBC 1968 - Season 1 - Complete)","uid":6723125,"size":1887328814,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d1467d18d10401defe4e308b6883c696599c18fc&amp;dn=Dad%5C%27s+Army++%28BBC+1968+-+Season+1+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"neil1966hardy","files":7,"time":1317854048,"description":"Dad's Army is a British sitcom about the Home Guard during the Second World War. It was written by Jimmy Perry and David Croft and broadcast on BBC television between 1968 and 1977. The series ran for 9 series and 80 episodes in total, plus a radio series, a feature film and a stage show. The series regularly gained audiences of 18 million viewers and is still repeated world wide.\n\nThe Home Guard consisted of local volunteers otherwise ineligible for military service, usually owing to age, and as such the series starred several veterans of British film, television and stage, including Arthur Lowe, John Le Mesurier, Arnold Ridley and John Laurie. Relative youngsters in the regular cast were Ian Lavender, Clive Dunn (who was made-up to play the elderly Jones), Frank Williams, James Beck (who died suddenly during production of the programme's sixth series, despite being one of the youngest cast members) and Colin Bean.\n\nIn 2004, Dad's Army was voted into fourth place in a BBC poll to find Britain's Best Sitcom. Previously, in a list of the 100 Greatest British Television Programmes drawn up by the British Film Institute in 2000, voted for by industry professionals, it was placed thirteenth. The series has had a profound influence on popular culture in the United Kingdom, with the series' catchphrases and characters well known. It is also credited with having highlighted a hitherto forgotten aspect of defence during the Second World War. The Radio Times magazine listed Captain Mainwaring's &quot;You stupid boy!&quot; among the 25 greatest put-downs on TV\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:d1467d18d10401defe4e308b6883c696599c18fc","amp;dn":"Dad%5C%27s+Army++%28BBC+1968+-+Season+1+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1467d18d10401defe4e308b6883c696599c18fc","infoHashBuffer":{"type":"Buffer","data":[209,70,125,24,209,4,1,222,254,78,48,139,104,131,198,150,89,156,24,252]},"announce":[],"urlList":[]}}