{"title":"Drive Genius 3.1.2 DVD [MULTi]","uid":6726709,"size":810931960,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:d3f9eb9c71a15db76ed46d2648dc605e81c1257b&amp;dn=Drive+Genius+3.1.2+DVD+%5BMULTi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"webchella","files":2,"time":1317983771,"description":"Drive Genius 3.1.2 DVD [MULTi]\n\n--------\nEnglish:\n--------\nCategory: MAC Software \nLanguage: Multi\nSerial INCLUDES \n\nDescription: \n------------- \nDrive Genius is an OS X utility designed to provide unsurpassed storage management. With an easy to use interface, Drive Genius is equipped with powerful tools such as a disk optimizer, a comprehensive repair facility for analyzing, repairing and rebuilding volumes, plus excellent testing capabilities with the surface exploration of the medium , benchmarking performance and data integrity checking. It can be used to initialize drives, create and delete partitions and securely erase, and the Department of Defense standard. Drive Genius can also hide partitions and duplicate volumes or drives swiftly. \n\nLast but not least, Drive Genius features advanced tools for resizing and moving of volumes without reformatting, and sports a sector editing tool to modify data in any sector of the disk - powerful features that meet even the seasoned Mac experts \nWhat's New \nVersion 3.1.2: \nHelp \nThe application is provided through the standard help viewer for Mac OS X. \n\nDistribution system will automatically create a new volume on an existing volume is reduced\n\n\n--------\nEspaÃƒÂ±ol:\n--------\nCategoria: Sofware MAC\nIdioma: Multilenguaje incluido EspaÃƒÂ±ol\nInclulle Serial\n\nDescripcion:\n-------------\nDrive Genius es una utilidad de OS X diseÃƒÂ±ado para proporcionar gestiÃƒÂ³n de almacenamiento sin igual. Con un fÃƒÂ¡cil de usar interfaz, Drive Genius estÃƒÂ¡ equipado con potentes herramientas como un optimizador de disco, un taller de reparaciÃƒÂ³n integral para el anÃƒÂ¡lisis, reparaciÃƒÂ³n y reconstrucciÃƒÂ³n de volÃƒÂºmenes, ademÃƒÂ¡s de una excelente capacidad de las pruebas de exploraciÃƒÂ³n con la superficie del medio, la evaluaciÃƒÂ³n comparativa de rendimiento y comprobaciÃƒÂ³n de integridad de datos. Se puede utilizar para inicializar discos, crear y borrar particiones, y borra de forma segura, como por el Departamento de la norma de Defensa. Drive Genius tambiÃƒÂ©n puede ocultar particiones y duplicar los volÃƒÂºmenes o unidades rÃƒÂ¡pidamente.\n\nPor ÃƒÂºltimo, pero no menos importante, Drive Genius cuenta con herramientas avanzadas para cambiar el tamaÃƒÂ±o y el movimiento de volÃƒÂºmenes sin modificar el formato y el deporte una herramienta de ediciÃƒÂ³n del sector para modificar los datos en cualquier sector del disco - potentes funciones que satisfarÃƒÂ¡ incluso a los experimentados expertos en Mac.\nÃ‚Â¿QuÃƒÂ© hay de nuevo\nVersiÃƒÂ³n 3.1.2:\nAyuda \nLa aplicaciÃƒÂ³n estÃƒÂ¡ prevista a travÃƒÂ©s del visor de ayuda estÃƒÂ¡ndar de Mac OS X.\n\nReparto de forma automÃƒÂ¡tica del sistema para crear un nuevo volumen en un volumen existente es reducido\n","torrent":{"xt":"urn:btih:d3f9eb9c71a15db76ed46d2648dc605e81c1257b","amp;dn":"Drive+Genius+3.1.2+DVD+%5BMULTi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3f9eb9c71a15db76ed46d2648dc605e81c1257b","infoHashBuffer":{"type":"Buffer","data":[211,249,235,156,113,161,93,183,110,212,109,38,72,220,96,94,129,193,37,123]},"announce":[],"urlList":[]}}