{"title":"Circus Empire","uid":6725003,"size":1223432954,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d4445ad541662d6b617a1fa1b20bbae130df1ad0&amp;dn=Circus+Empire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marco699","files":-1,"time":1317907827,"description":"Roll up! Roll up! The Circus is in town. Come see the greatest show around! Gasp and gape at the flying trapeze and the acrobats. Laugh at the clowns and marvel at the brave lion tamer? \n\nCircus Empire is the first 3D circus simulation game ever!\nDesign your very own circus shows in full 3D, with like life animation and great visuals. Never before could you design and watch amazing circus performances this realistically on your computer.\nHire performers, train them and watch as they perform to the delight of the crowd. The performers have their own personalities and specialties. Take good care of them, treat them well and fill them with inspiration to perform the greatest shows for you.\nTravel from the US to Europe, and on to Asia. Follow the campaign story and meet with interesting characters. There are loads of pleasant surprises awaiting you. This is a truly unique gaming experience that you wont find anywhere else! Start the journey today and enjoy the ride of a lifetime running the greatest circus in the world! \n\nFeatures\nCustomize Your Own Circus Show\nCircus Empire is the first game ever that lets you customize your very own circus show in larger than life 3D graphics.\n\nLots of Talented Performers\nMore than 70 different performers: f rom trapeze artists, clowns, and tightrope walkers to bears, lions and dolphins. You name it, Circus Empire has it!\n\nExciting Performances in Action\nSee all the popular stars of the greatest show around in realistic 3D action! You will be amazed by how much fun and satisfaction there is in running a circus.\n\nA Great Variety of Performances\nFrom hand balancing acts to motorcycling inside the globe of death, there are h undreds of performance moves which allow your circus shows to be customized in a virtually unlimited number of ways.\n\nA Story driven Campaign \nTravel around the world, from the US to Europe and Asia . The story driven campaign unfolds as you start your journey to bring joy and excitement to tens of thousands of people on different continents.\n\nIn depth Management Simulation\nUnderneath the great visuals, there is a deep simulation. The various aspects of running a circus, like hiring, training, scheduling, personnel and financial management, are all simulated in great detail. \n\nSystem Requirements:\nOS: Windows 2000/XP/VISTA/7\nCPU: 600MHz or faster Processor\nRAM: 128 MB\n\n: Burn to CD or mount image\n: Install\n: Play \n: Buy it if you like it. ","torrent":{"xt":"urn:btih:d4445ad541662d6b617a1fa1b20bbae130df1ad0","amp;dn":"Circus+Empire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4445ad541662d6b617a1fa1b20bbae130df1ad0","infoHashBuffer":{"type":"Buffer","data":[212,68,90,213,65,102,45,107,97,122,31,161,178,11,186,225,48,223,26,208]},"announce":[],"urlList":[]}}