{"title":"Aion en Client Version 2.1.0.9 full","uid":6732654,"size":12630494870,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d46583b01c6728327fea7fa2c7b42f750a5043f0&amp;dn=Aion+en+Client+Version+2.1.0.9+full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stengray","files":1,"time":1318218076,"description":"I got increadibly sick and tired of trying to find an english Aion client version 2.1.0.9 for play on private servers that did not have a modified bin32 for some silly private server that I decided to upload my own.\n\nThis file contains: \n-Aion client folder zipped\n-Version: English 2.1.0.9\n-Original 2.1.0.9 bin32 file (with 2 extra files - see below)\n\nThis is NOT an installation file! It is simply the zipped Aion client folder from a fully operational Aion client 2.1.0.9.The bin32 folder does contain 2 additional files for private servers, they are d3dx9_38.dll and IpFixModule.dll. You may remove these files, however, they do not effect your ability to play on NCSOFT servers. However, if you wish to play on NCSOFT servers I recommend downloading the NCSOFT Launcher and installing the game properly.\n\n**Disclaimers:\n1.) Using the Aion Game Client to connect to a private server is strictly forbidden in the NCSOFT EULA and my possibly be illegal. Furthermore, I am simply providing this client for those seeking this specific version and am no way responsible for your actions with the client! How you use this client is at your own personal responsibility!\n\n2.) This is the first torrent I have shared. I will try to seed as much as possible. If you download this file, please help seed. If you have any problems with the torrent file itself, please post it so I can attempt to fix it.\n\n3.) Please do not post a bunch of flames about viruses. This file has been scanned 3 times through 3 different types of virus software scanners. There are NO viruses in this file!\t","torrent":{"xt":"urn:btih:d46583b01c6728327fea7fa2c7b42f750a5043f0","amp;dn":"Aion+en+Client+Version+2.1.0.9+full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d46583b01c6728327fea7fa2c7b42f750a5043f0","infoHashBuffer":{"type":"Buffer","data":[212,101,131,176,28,103,40,50,127,234,127,162,199,180,47,117,10,80,67,240]},"announce":[],"urlList":[]}}