{"title":"RockSmith-XBOX360-NTSC-By-Mrpiano","uid":6774344,"size":8738846768,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:d472d63cb5ec7ac52123c6f26f9bca6a73a94415&amp;dn=RockSmith-XBOX360-NTSC-By-Mrpiano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"noneshere","files":-1,"time":1319687374,"description":"Introducing the next stage in the evolution of the music game. Rocksmith, the first and only game where you plug into any real guitar. Nothing plastic. Nothing fake. Just an authentic guitar experience. By plugging into your console, you\\'ll develop real skills and styles while playing absolutely real music. Featuring gameplay that automatically adjusts to your personal ability and innovative game design that makes reading music visually intuitive, Rocksmith will engage experienced musicians as well as those who have never picked up a guitar in their life. Nothing compares to playing a real guitar. Except playing Rocksmith.\n\n    When we say any guitar we mean any guitar.\n        Whether it\\'s the guitar sitting in your attic, your cherished faithful steed, or the guitar you have yet to buy, Rocksmith lets you plug any guitar into your Xbox 360 or PlayStationÃ‚Â®3 system. As long as your guitar has a jack, you can play. No jack on your guitar? Head down to your local music store, get an inexpensive pickup, and problem solved. \n    Difficulty settings that adapt to your ability.\n        You love a challenge, but hate being overwhelmed. Rocksmith understands this, and knows exactly how far to push to keep you entertained and addicted. With dozens of difficulty levels, you will automatically progress from single notes to complex chords without getting in over your head. \n    Lots of music. Lots of styles.\n        One of the most satisfying moments for any guitar player is hearing yourself play your favorite song for the first time. Rocksmith has amassed an amazing library of songs from different music genres allowing players to experience that moment first hand. \n    Play songs instead of just learning them.\n        You want to play new songs, but you don\\'t want to labor through tablature or cringe through poorly produced videos. No problem. Rocksmith will not only present you with new songs, but will also challenge you to step away from the notes on screen and play songs by memory. Imagine that. A video game that\\'ll get you stage-ready. ","torrent":{"xt":"urn:btih:d472d63cb5ec7ac52123c6f26f9bca6a73a94415","amp;dn":"RockSmith-XBOX360-NTSC-By-Mrpiano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d472d63cb5ec7ac52123c6f26f9bca6a73a94415","infoHashBuffer":{"type":"Buffer","data":[212,114,214,60,181,236,122,197,33,35,198,242,111,155,202,106,115,169,68,21]},"announce":[],"urlList":[]}}