{"title":"The Ruts  -  Something That I Said?","uid":6774058,"size":161983608,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d5f65ed904ba32a6a820417783cd5a83442cf86b&amp;dn=The+Ruts++-++Something+That+I+Said%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neil1966hardy","files":24,"time":1319673580,"description":"They didn't reach stadium-level superstardom like the Clash and the Police, but few contemporaries could hold a candle to the punky reggae of the Ruts. Nearly equal parts righteous dread and six-string fury, the London quartet was one of the most important bands to emerge during punk's second wave, and this collection -- one of a series that also included well-chosen retrospectives of acts like the Members and the Records -- expertly compiles the finest moments of the Ruts' too-short career. Like many British bands who incorporated reggae rhythms into their pogo stomp, the group began life leaning heavily toward the hard and fast, as documented by their initial single, 1978's &quot;In a Rut.&quot; But very early on, they began to toy with Jamaican sounds and themes -- just listen to the brief, dub-style guitar lick in the middle of &quot;Babylon's Burning,&quot; the title of which draws a link to Rastafarian unrest at home and abroad during the late '70s. Thanks to singer Malcolm Owen's magnificent bellow, the Ruts would always have one foot firmly in the punk camp, but bassist John Jennings was the band's secret weapon; his rumble came to dominate on roots reggae epics like &quot;Jah Wars,&quot; a chilling account of fascist violence. Those songs and several others are drawn from the group's lone album, The Crack, with later singles like the raucous &quot;Staring at the Rude Boys&quot; appended to give a complete picture of the Ruts' brief but brilliant time together. Their final hit, &quot;West One,&quot; was released just weeks after Owen, struggling with a heroin addiction, overdosed and drowned in his bath. It serves here as an optimistic closer and a last reminder of how much essential music the group managed to create in just two years. Those who crave a little more should purchase Something That I Said in tandem with Rhythm Collision, the smashing 1982 dub album that paired the remaining Ruts with Mad Professor. (AMG)\n\n\n\n01. In A Rut\n02. H Eyes\n03. Babylon's Burning\n04. Dope For Guns\n05. S.U.S.\n06. Something That I Said\n07. You're Just A...\n08. It Was Cold\n09. Savage Circle\n10. Jah War\n11. Criminal Mind\n12. Backbiter\n13. Out Of Order\n14. Human Punk\n15. Staring At The Rude Boys\n16. Love In Vain\n17. West On (Shine On Me)\n\n\nLabel: Virgin\nReleased: 1995\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\nEnjoy,Seed and Share\n\n","torrent":{"xt":"urn:btih:d5f65ed904ba32a6a820417783cd5a83442cf86b","amp;dn":"The+Ruts++-++Something+That+I+Said%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5f65ed904ba32a6a820417783cd5a83442cf86b","infoHashBuffer":{"type":"Buffer","data":[213,246,94,217,4,186,50,166,168,32,65,119,131,205,90,131,68,44,248,107]},"announce":[],"urlList":[]}}