{"title":"Weather Watcher Live 7.0.90 with PATCH","uid":6716008,"size":5229993,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d61bb66ac5403c87fee84a2038c537685602b37b&amp;dn=Weather+Watcher+Live+7.0.90+with+PATCH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chami1988","files":-1,"time":1317568444,"description":"The Weather Watcher Live application was designed to be your personal, real-time Windows desktop weather station. View real-time weather conditions in your neighborhood from WeatherBug weather stations, or as reported by NWS.\n\n\nAutomatically retrieve the current conditions, hourly forecast, daily forecast, severe weather alerts from NWS (US only), and weather maps for thousands of cities world-wide. The current conditions can be quickly viewed by holding your mouse pointer over the Weather Watcher Live system tray icon. \n\nWeather Watcher Live will allow you to automatically retrieve your weather data at a set interval, display the current temperature in a customized tray icon, display the current condition image in a tray icon, designate which weather information is displayed in the Weather Watcher Live system tray tooltip, convert the weather data using almost any conversion, display a weather map as your desktop wallpaper, log the weather data in any format, export the weather data in any format, customize the look of the Weather Watcher Live interface and icons via skins, and much more. \n\nHere are some key features of Weather Watcher Live: \n\nWeather as reported by WeatherBug and NWS \n\nForecasts available for thousands of cities world-wide \n\nCurrent weather conditions \n\n60-hour forecast \n\n7-day day/night forecast \n\nSevere weather alerts from NWS (US only) \n\n700+ weather maps \n\nEasy access to weather news, cameras and photos \n\n18+ weather unit conversion choices \n\nLocally export and log weather data \n\nSkinned interface/forecasts \n\nCustomizable system tray icon/tooltip \n\nDual tray icons for temperature and condition image \n\nProxy server support \n","torrent":{"xt":"urn:btih:d61bb66ac5403c87fee84a2038c537685602b37b","amp;dn":"Weather+Watcher+Live+7.0.90+with+PATCH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d61bb66ac5403c87fee84a2038c537685602b37b","infoHashBuffer":{"type":"Buffer","data":[214,27,182,106,197,64,60,135,254,232,74,32,56,197,55,104,86,2,179,123]},"announce":[],"urlList":[]}}