{"title":"Puzzle Quest Anthology","uid":6714704,"size":656941056,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d65dc889ff18ab8e07321d8c53766989467e43aa&amp;dn=Puzzle+Quest+Anthology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marco699","files":-1,"time":1317497177,"description":"Year: 2007-2010 | PC Game | Eng Rus | Developer: Infinite Interactive | Publisher: D3Publisher | 626.51 MB\nGenre: Logic (Puzzle), RPG\n\nThe brave hero travels through the fabulous state, performs tasks, fight monsters and save the beautiful princess. As customary in every self-respecting role-playing game, the hero eventually acquires new skills, becoming an experienced magician and a mighty warrior, gets a huge treasure and powerful artifacts. It would seem that the usual role-playing game ... Yes, there it was!\n\nPuzzle Quest: Challenge of the Warlords\nAll fights and battles are taken as quite a different game - beloved by many casual fun with a square field and the colored balloons, which are necessary \\&quot;kick\\&quot; from the field in a certain sequence. But many of the familiar rules of the game enhanced with new, unprecedented opportunities. For the plain colored balls hidden army and magic, players come to the aid of spells and artifacts, the hero gains experience and new abilities ...\n\nThe result was a unique blend of puzzle and role-playing game complete. Crossing two dissimilar genres gave a stunning result: the game was recognized as one of the best casual entertainment in recent years by most gaming publications and has earned numerous awards. In a world of fun at the office Puzzle Quest is no competition.\n\nFeatures:\nThe perfect combination of puzzle, RPG and turn based strategy!;\nAn epic story based on the universe Warlords!;\nFascinating battle!;\nA lot of opponents, each with its own twist!;\nFour types of magic!.\n\nPuzzle Quest: Galactrix\n\nContinued excellent game that combines elements of RPG and logic puzzle. In place of fantasy sketches come a science fiction story. The plot, in fact, explode in the direction of an unknown alien race, eager to destroy humanity. The player also will serve as the fighting against the invaders combat pilot, skillfully maneuvering between factions and alliances. This means that the focus on diplomacy, trade and construction of ships have many times more. Plus, the battle Puzzle Quest: Galactrix will now develop on a hexagonal grid.\n\nFeatures:\nCreate a strong pilot, who gets the skills and ships as the battle;\nLook for new items to make the ship and the pilot\\'s all-powerful;\nTrade in goods across the galaxy to increase the wealth;\nEach enemy requires different tactics;\nPresent regime, \\&quot;the galaxy\\&quot;.\n\nPuzzle Quest 2\n\nPuzzle Quest 2 will take us to the fantasy world, where there is always a powerful evil that has overcome the main character. This time the evil was placed in the village of Verloren - and its need to save. Vacant position of the protagonist can take one of the four available characters - the magician, the Inquisitor, a barbarian and assassins. Each of them has its own set of skills and unique abilities that can be pumped by spending experience earned in battle. A battle then take the form of cute puzzles where you need to quickly and cleverly combine the same elements pazzlovye appearing on the screen, to build a chain of them and literally force your mind to destroy the enemy.\n\nFeatures:\nThe gameplay, as well as in the first game based on the match-3 puzzle game with role-playing elements. In the story, the player must protect a village from Verloren zlovogo demon Gorgon. In olitiche from moving on a schematic map of the global, as in the first game, Puzzle Quest 2 is now an isometric view and the gameplay is based on a study of caves near the village;\nThe game is available four character classes: Sorcerer, Templar, Barbarian, and Assassin.\n\n\n\n\n\nRecommended system requirements:\nOperating system: Windows XP / Vista / Seven\nProcessor: Intel Core &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;26146617081e&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt; Ghz / AMD Athlon 64 X2 2.0 Ghz\nMemory: 1 GB\nVideo: 256 Mb (GeForce  7 / Radeon X800)\nSound Card: Sound device compatible with DirectX  9.0\nFree hard drive space: 1 GB\n\nFeatures RePack\\'ov:\nNeedless no cut / no recoded;\nIn Puzzle Quest: Galactrix Puzzle Quest 2 and localization of the added \\&quot;ENPY Studio\\&quot;;\nGame Version: v1.0 / v1.02 / v1.00, respectively;\nInstallation time: 2 / 2 / 3 minutes, respectively;\nRePack by aka.ehe\n\nINSTAL:\n\nMOUNT iso \n\n\nCLICK ON LAUNCH FOR - Puzzle Quest: Challenge of the Warlords\n\nCLICK ON LAUNCH 2 FOR - Puzzle Quest: Galactrix\n\nCLICK ON LAUNCH 3 FOR - Puzzle Quest2","torrent":{"xt":"urn:btih:d65dc889ff18ab8e07321d8c53766989467e43aa","amp;dn":"Puzzle+Quest+Anthology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d65dc889ff18ab8e07321d8c53766989467e43aa","infoHashBuffer":{"type":"Buffer","data":[214,93,200,137,255,24,171,142,7,50,29,140,83,118,105,137,70,126,67,170]},"announce":[],"urlList":[]}}