{"title":"Michael Crichton - MIcro Unabr 32kbs mp3 rkl","uid":6834288,"size":199325889,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d698718ef1132772d0147343d72059a9aa5044d7&amp;dn=Michael+Crichton+-+MIcro+Unabr+32kbs+mp3+rkl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"audiobookman","files":4,"time":1321970194,"description":"Micro: A Novel\n\nUNABRIDGED\nby Michael Crichton\nNarrated by John Bedford Lloyd\n\nLENGTH\n13 hrs and 53 mins\nAUDIBLE RELEASE DATE\n11-22-11\n\n\n\nIn Jurassic Park, he created a terrifying new world. Now, in Micro, Michael Crichton reveals a universe too small to see and too dangerous to ignore.\n\nIn a locked Honolulu office building, three men are found dead with no sign of struggle except for the ultrafine, razor-sharp cuts covering their bodies. The only clue left behind is a tiny bladed robot, nearly invisible to the human eye.\n\nIn the lush forests of Oahu, groundbreaking technology has ushered in a revolutionary era of biological prospecting. Trillions of microorganisms, tens of thousands of bacteria species, are being discovered; they are feeding a search for priceless drugs and applications on a scale beyond anything previously imagined.\n\nIn Cambridge, Massachusetts, seven graduate students at the forefront of their fields are recruited by a pioneering microbiology start-up. Nanigen MicroTechnologies dispatches the group to a mysterious lab in Hawaii, where they are promised access to tools that will open a whole new scientific frontier.\n\nBut once in the Oahu rain forest, the scientists are thrust into a hostile wilderness that reveals profound and surprising dangers at every turn. Armed only with their knowledge of the natural world, they find themselves prey to a technology of radical and unbridled power. To survive, they must harness the inherent forces of nature itself.\n\nAn instant classic, Micro pits nature against technology in vintage Crichton fashion. Completed by visionary science writer Richard Preston, this boundary-pushing thriller melds scientific fact with pulse-pounding fiction to create yet another masterpiece of sophisticated, cutting-edge entertainment. \n\n32kbs mp3, if you dont like this bitrate move on.....\nive had zero complaints on the last 20 or so torrents posted at this bitrate about the quality other than on here by ONE member, as ive said time and again its identical to the bitrate audible uses so you wont gain anything by upping the bitrate.\n\nThe files are encoded as two large files, feel free to chop them up or convert them to m4b for ipods. This book is brand new and only released a few hours ago.\nenjoy\naudiobookman","torrent":{"xt":"urn:btih:d698718ef1132772d0147343d72059a9aa5044d7","amp;dn":"Michael+Crichton+-+MIcro+Unabr+32kbs+mp3+rkl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d698718ef1132772d0147343d72059a9aa5044d7","infoHashBuffer":{"type":"Buffer","data":[214,152,113,142,241,19,39,114,208,20,115,67,215,32,89,169,170,80,68,215]},"announce":[],"urlList":[]}}