{"title":"FIFA 12 [English] [USA]","uid":6696787,"size":7164989743,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:d6ae2ac548bb0ee476edec34d54f28537b62cd7b&amp;dn=FIFA+12+%5BEnglish%5D+%5BUSA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FatFreddy33","files":75,"time":1316812558,"description":"Note* : I know this game isn't out yet, but this isn't fake, you would know if you've seen my torrents. https://thepiratebay.se/user/the-szk .\n\nAlso, I'm not asking you to download it, you can wait till it comes out, and then come back and realise this was real and download it anyways, it's all up to you.\n\nAnd No this Isn't the Demo, it's the FULL game.\n\nThis is also the US version, the PAL [Europe] version will be uploaded soon.\n\nPlatform : XBOX 360\nLanguage : English\nFormat   : ISO\nSize     : 6.67 GB\n\nDescription of the Game :\nA &quot;trinity&quot; of major gameplay changes have been implemented in FIFA 12; these are the Impact Engine, Tactical Defending, and Precision Dribbling.\n\nIn development for several years, the Impact Engine improves collision variety, accuracy, and momentum preservation. A new advanced procedural animation system is used along with collision physics to produce different results depending on the players and physical forces involved. This affects all players, so even those off the ball may have collisions. The Impact Engine has been cited as a game changer, making FIFA 12 less structured and synthetic than its predecessors, and has been described by producer David Rutter as the biggest technological change to the series since the transition to the current generation of consoles. The Impact Engine also directly affects injuries sustained by players during a match.\n\nRelease info :\nThis game is XGD2. It was released by the group &quot;ZRY&quot;. =)","torrent":{"xt":"urn:btih:d6ae2ac548bb0ee476edec34d54f28537b62cd7b","amp;dn":"FIFA+12+%5BEnglish%5D+%5BUSA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6ae2ac548bb0ee476edec34d54f28537b62cd7b","infoHashBuffer":{"type":"Buffer","data":[214,174,42,197,72,187,14,228,118,237,236,52,213,79,40,83,123,98,205,123]},"announce":[],"urlList":[]}}