{"title":"Burnout Paradise - The Ultimate Box (RELOADED) ","uid":6731441,"size":3203982901,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d71671125150459d2f5679ce15c1f959acaf6d01&amp;dn=Burnout+Paradise+-+The+Ultimate+Box+%28RELOADED%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LOS---","files":-1,"time":1318172071,"description":"Welcome to Paradise City - a heavenly place for autos and crazy gonschikov.Ogromny city with hundreds of streets and dozens of highways, the capital city of gleaming skyscrapers, filled with unsuspecting motorists - that's where the competition will be the new Burnout! Only those who are ready to destroy opponents for fun, worthy to participate vnih. Get ready to vent all their rage and spread the metropolis to pieces. Prove that the total destruction - your element! The racing Burnout is measured not speed and ability to enter into the turns, and how skillfully you arrange a car accident. Accidents have become even more beautiful! Instead of individual races Burnout Paradise offers an entire city, which can move freely in all directions. Pick and choose where, when and with whom to fight! New machines, tricks and unimaginable accident involving dozens of vehicles attached!\n\nGame Features:\n- Full freedom of action! Otnynepered Here is a city of skyscrapers, bridges, beautiful poberezhemi mountainous terrain nearby. Freedom of movement does not bounded! You are looking for a venue for regular races ilibestselno skate the streets for fun\n- Wonders navirazhah! In Paradise City you will find a wide range of exciting mini-igr.Samaya long ride on the counter without a frontal collision, samyyprodolzhitelny skid, dashing between the two parking close stoyaschimimashinami - here bored!\n- Hundreds of cars! Each uchastnikdvizheniya can become part of the grand accident! Arrange samyemasshtabnye and spectacular accident in the history of the series, use svoyufantaziyu, and victory will be on your side!\n- Mad rivals! Besides you on the roads Paradise City romp yet thirty chetyreavtomanyaka. Each of them has unique methods and tehnikoyezdy. Be careful: the rivals will try to do away with you pripervoy as possible!\n\nSystem Requirements:\n- Operating system: Microsoft Ã‚Â® Windows XP SP2 / Windows Vista\n- Processor: Intel Pentium 4 3.2 GHz or equivalent AMD Athlon 64 3200 +\n- Memory: 1 GB (Windows XP) / 2GB (Windows Vista)\n- Graphics Card: 3D-graphics adapter with 256 MB memory, compatible with DirectX 9.0 and supports Pixel Shader 3.0 (Nvidia GeForce 6600 / ATI Radeon X1300 GTO or better)\n- Sound: Sound card compatible with DirectX 9.0c\n- Free hard drive space: 8 GB\n- Additional software: DirectX 9.0c","torrent":{"xt":"urn:btih:d71671125150459d2f5679ce15c1f959acaf6d01","amp;dn":"Burnout+Paradise+-+The+Ultimate+Box+%28RELOADED%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d71671125150459d2f5679ce15c1f959acaf6d01","infoHashBuffer":{"type":"Buffer","data":[215,22,113,18,81,80,69,157,47,86,121,206,21,193,249,89,172,175,109,1]},"announce":[],"urlList":[]}}