{"title":"Marvels The Avengers Trailer HD 1080p","uid":6737005,"size":146729509,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:d7ca6d6f729ecaab696481e2b8684ef48a6a2c3e&amp;dn=Marvels+The+Avengers+Trailer+HD+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1318365278,"description":"Marvel's The Avengers \n\nTrailer HD 1080p\n\n\nIn theaters: May 4th, 2012\n\n\n\nCast:\n\nRobert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Tom Hiddleston, Stellan SkarsgÃƒÂ¥rd, Samuel L. Jackson\n\n\nSynopsis:\n\nMarvel Studios presents in association with Paramount Pictures &quot;Marvel's The Avengers&quot;--the Super Hero team up of a lifetime, featuring iconic Marvel Super Heroes Iron Man, The Incredible Hulk, Thor, Captain America, Hawkeye and Black Widow. \n\nWhen an unexpected enemy emerges that threatens global safety and security, Nick Fury, Director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. \n\nSpanning the globe, a daring recruitment effort begins. Starring Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner and Samuel L. Jackson, and directed by Joss Whedon, &quot;Marvel's The Avengers&quot; is based on the ever-popular Marvel comic book series &quot;The Avengers,&quot; first published in 1963 and a comics institution ever since. \n\nPrepare yourself for an exciting event movie, packed with action and spectacular special effects, when &quot;Marvel's The Avengers&quot; assemble in summer 2012. In &quot;Marvel's The Avengers,&quot; superheroes team up to pull the world back from the brink of disaster when an unexpected enemy threatens global security.\n\n--- Uploaded by Herobo Trailers ---\n","torrent":{"xt":"urn:btih:d7ca6d6f729ecaab696481e2b8684ef48a6a2c3e","amp;dn":"Marvels+The+Avengers+Trailer+HD+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7ca6d6f729ecaab696481e2b8684ef48a6a2c3e","infoHashBuffer":{"type":"Buffer","data":[215,202,109,111,114,158,202,171,105,100,129,226,184,104,78,244,138,106,44,62]},"announce":[],"urlList":[]}}