{"title":"Losing My Religion","uid":6764341,"size":913969,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8cb2117b56cd7abd614a9a0feaa2d230901004e&amp;dn=Losing+My+Religion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rosie1966","files":2,"time":1319315508,"description":"A former religion reporter for the Los Angeles Times, Lobdell recounts in this plainly written memoir how he became a Protestant evangelical, nearly accepted Catholicism and, in the end, rejected faith altogether. Central to the arc of this memoir is the unfolding sexual abuse scandal in the Roman Catholic Church, which Lobdell covered in depth during his time as a religion reporter, beginning in 2000. Despairing of the role of priests and bishops in that scandal, he refashions his identity as a crusading reporter out to cleanse the church of corrupt leaders. But after finding that his investigative stories about faith healer Benny Hinn and televangelists Jan and Paul Crouch appear to make no difference on the reach of these ministries or the lives of their followers, he gives up on the beat and on religion generally. Lobdell subjects his faith to the rigors of rationalism. If Christians are no more ethical than atheists, why belong to a church? It's a curious utilitarian argument that sounds more like a rearview explanation than a revealing account of loss of faith. Still, the memoir's strength lies in the wrenching emotional toll exacted by the Catholic abuse scandal. If nothing else, it suggests reporters may have been victimized by the scandal, too.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:d8cb2117b56cd7abd614a9a0feaa2d230901004e","amp;dn":"Losing+My+Religion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8cb2117b56cd7abd614a9a0feaa2d230901004e","infoHashBuffer":{"type":"Buffer","data":[216,203,33,23,181,108,215,171,214,20,169,160,254,170,45,35,9,1,0,78]},"announce":[],"urlList":[]}}