{"title":"The Golden Age of the European Polyphony","uid":6715988,"size":1595558498,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d8d4d0341862ef082de3b239ca04e1a1cb422830&amp;dn=The+Golden+Age+of+the+European+Polyphony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"darbyzz","files":175,"time":1317567302,"description":"11 CDs ripped at 320kbps\n\nAll PDFs available on CD-ROM are included here.\n &lt;a href=&quot;\nhttp://www.cdbiblio.com/eingang/register/zzauberei/zaubereiissues_golden.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cdbiblio.com/eingang/register/zzauberei/zaubereiissues_golden.htm&lt;/a&gt;\n\nThis ambitious project was initiated by Jean Salkin, founder of Belgium\\\\\\'s National Sound Recording Library, and fulfilled by conductor Guy Janssens and his Renaissance vocal group Laudantes Consort. The result of Salkin\\\\\\'s dream--\\\\\\&quot;to publish a series of 12 digital recordings representing the Golden Age of European vocal polyphony\\\\\\&quot;--is realized in this extraordinary boxed set, which effectively offers listeners a highlights tour of European vocal music and its most renowned composers from the Middle Ages to the end of the Renaissance. Janssens\\\\\\' group spent six years on the project--from 1994 to 2000--and the recordings, 11 altogether, with an additional CD-ROM containing extensive notes, texts, sound clips, and other information, are remarkably consistent in sound quality and ensemble uniformity. Ten of the discs are devoted to single composers (Machaut, Dunstable, and Dufay share the first CD), and while complete works are the norm, there are occasional excerpts from larger pieces such as Masses and service music.\n\nIt would take too much space just to list the most interesting and memorable selections and performances, but here are a few: Machaut\\\\\\'s Messe Nostre-Dame; Dunstable\\\\\\'s Magnificat; Dufay\\\\\\'s Missa Se la face ay pale; motets by Josquin Desprez; all the Tallis pieces (Latin and English motets, as well as the Lamentations of Jeremiah); Lassus\\\\\\' secular songs; Byrd\\\\\\'s Ave verum corpus. But perhaps the most compelling reason to own this set is the last disc, which contains 27 songs and madrigals from the 16th and 17th centuries. Included are first-rate performances of such favorites as Passereau\\\\\\'s \\\\\\&quot;Il est bel et bon\\\\\\&quot;, Josquin\\\\\\'s \\\\\\&quot;Mille regrets\\\\\\&quot;, Lassus\\\\\\' \\\\\\&quot;Bonjour mon coeur\\\\\\&quot;, Dowland\\\\\\'s \\\\\\&quot;Come again\\\\\\&quot;, Gibbons\\\\\\' \\\\\\&quot;The silver swan\\\\\\&quot;, and Morley\\\\\\'s \\\\\\&quot;Now is the month of Maying\\\\\\&quot;. But we also hear many lesser-known yet equally fine and entertaining songs, such as Certon\\\\\\'s lively \\\\\\&quot;La, la, la, je ne l\\\\\\'ose dire\\\\\\&quot; and others by such composers as Jannequin, Bartlet, Le Jeune, Senfl, Arcadelt, and Hassler.\n\nOne of the benefits of the collection is that it offers a convenient means of comparison of sacred and secular styles and regional differences while also revealing changes over time. It\\\\\\'s also interesting to hear side by side the starkly contrasting styles of contemporaries such as Lassus, with his astonishing harmonic mannerisms, and the more structurally formal, elegantly melodic Palestrina, or Tallis, in his most masterfully concise and beautifully expressive Latin and English motets.\n\nThe singing is consistently excellent, an achievement that\\\\\\'s especially commendable given the sheer quantity and variety of repertoire and the years it took to complete the project. The performances show a concern for mastery of the works (not always the case in long-term efforts such as this!), which includes not only the notes but stylistic understanding and intrepretive point of view. Of course, there are individual moments and performances that a given listener could quibble about--I found the Victoria O magnum mysterium a bit rushed, soprano intonation a bit under pitch here and there, and the sound on the Palestrina disc not quite as warm and well-balanced as elsewhere--but it would be difficult if not impossible to find a better-performed or more richly rewarding collection of similar repertoire, or one more intelligently chosen and programmed.\n\nMy only complaint is having to sit at a computer to read the liner notes (beautifully presented and informative as they are), a cost-saving measure that nevertheless for some listeners may prove more irritating and inconvenient than it\\\\\\'s worth. That said, early music fans will find this an enjoyable, even essential collection, and listeners new to this repertoire can expect an easily accessible, compelling introduction. Outstanding! [2/28/2006]\n\n--David Vernier, ClassicsToday.com\n\n\n\nAlso, see this helpful review in Gramophone: &lt;a href=&quot;\nhttp://www.gramophone.net/Issue/Page/August%202002/79/857177/THE+GOLDEN+AGE+OF+EUROPEAN+POLYPHONY,+13501650+0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gramophone.net/Issue/Page/August%202002/79/857177/THE+GOLDEN+AGE+OF+EUROPEAN+POLYPHONY,+13501650+0&lt;/a&gt;","torrent":{"xt":"urn:btih:d8d4d0341862ef082de3b239ca04e1a1cb422830","amp;dn":"The+Golden+Age+of+the+European+Polyphony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8d4d0341862ef082de3b239ca04e1a1cb422830","infoHashBuffer":{"type":"Buffer","data":[216,212,208,52,24,98,239,8,45,227,178,57,202,4,225,161,203,66,40,48]},"announce":[],"urlList":[]}}