{"title":"War by Deception - 2011","uid":6703843,"size":517720076,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d9fa890c69cd4bb9646f56c4a9f5f8b07c83c989&amp;dn=War+by+Deception+-+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"c4ll7","files":1,"time":1317085261,"description":"The best film on 911 or the Iraq War.\nThe US decided to blame a hijacking on al qaeda but then used a missile for no reason instead, then see the attached video called a plane hit the pentagon baby steps.\nIt's easy to pick apart loose change with its missiles, pods, and complete absence of who or how anyone got bombs in the buildings, it's easy to pick on Alex &quot;illuminuts&quot; Jones, and easy to pick on David &quot;lizard-aliens&quot; Icke, etc but it's not easy to pick apart work and film grounded in verifiable reality which is what I have done.\n\n\n\n&quot;War by Deception, the definitive 9/11 documentary\n\n'In all affairs, it's a healthy thing, now and then, to hang a question mark on the things you have long taken for granted'\n\nAnyone looking at the events of 9/11 with an open mind understands full well that the government conspiracy can not be true. This is documented in almost all the 9/11 films, which invariably focus only on the problems with the official story. Until seeing War by Deception, it was obvious I had been missing the forest for the trees. This three hour epic brings matters full circle; capturing in three concise hours what likely took years of research by Mr. Dawson. If a three hour movie is a turn off for you, it is very likely that you don't have the desire to understand the full spectrum of this issue to begin with. Not only does it demolish the official conspiracy, it ties together the fraud of the Iraq war, as well as the key Anthrax link that most miss, linking it to the same group of (mostly) dual citizen criminals whose success in hijacking the American government and using it as an engine for their own ends is unlike anything ever witnessed in history. This film should be mandatory viewing for every American, and frankly, anyone who is deeply troubled by what has transpired in the years since 9/11. Ryan Dawson is a true patriot and hero of the highest order, and War By Deception is the definitive documentary on the 9/11 fraud.&quot;","torrent":{"xt":"urn:btih:d9fa890c69cd4bb9646f56c4a9f5f8b07c83c989","amp;dn":"War+by+Deception+-+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9fa890c69cd4bb9646f56c4a9f5f8b07c83c989","infoHashBuffer":{"type":"Buffer","data":[217,250,137,12,105,205,75,185,100,111,86,196,169,245,248,176,124,131,201,137]},"announce":[],"urlList":[]}}