{"title":"The Martian Chronicles: A Radio Play by Ray Bradbury","uid":6713030,"size":160963898,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:dbe595dc7e8c42c79e0f8f7b0dae8c536de54166&amp;dn=The+Martian+Chronicles%3A+A+Radio+Play+by+Ray+Bradbury&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"neil1966hardy","files":3,"time":1317431735,"description":"The Martian Chronicles: A Radio Play by Ray Bradbury\nDramatized by The Colonial Radio Players\nLength: 5 hrs 34 minutes\n\nPublisher's Summary\nThe people of Earth are preparing for war - a war that could potentially destroy the planet. Explorers are sent to Mars to find a new place for humans to colonize. Bradbury's Mars is a place of hope, dreams, and metaphor - of crystal pillars and fossil seas - where a fine dust settles on the great empty cities of a silently destroyed civilization. It is here the invaders have come to despoil and commercialize, to grow and to learn - first a trickle, then a torrent, rushing from a world with no future toward a promise of tomorrow.\n\nThe Earthman conquers Mars... and then is conquered by it, lulled by dangerous lies of comfort and familiarity, and enchanted by the lingering glamour of an ancient, mysterious native race.\n\nThe Martian Chronicles is presented here as a full-cast audio production with an original music score and thousands of sound effects by the award winning Colonial Radio Theatre on the Air. It marks their fourth collaboration with one of the most celebrated fiction writers of our time: Ray Bradbury.\n\nIf you love Bradbury this is the audio book for you. This production is a professional production that surpasses anything from the golden age of radio. Sound effects, voices and script are right on! The best!\n\nI know there are alot of copies of The Martian Chronicles floating around here but I have't found one with a dramatization yet, so that's why I'm posting mine. This production is very good.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:dbe595dc7e8c42c79e0f8f7b0dae8c536de54166","amp;dn":"The+Martian+Chronicles%3A+A+Radio+Play+by+Ray+Bradbury","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbe595dc7e8c42c79e0f8f7b0dae8c536de54166","infoHashBuffer":{"type":"Buffer","data":[219,229,149,220,126,140,66,199,158,15,143,123,13,174,140,83,109,229,65,102]},"announce":[],"urlList":[]}}