{"title":"The Woman in Black - Susan Hill","uid":6739980,"size":1111407,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbf671c482d5ccdbaeb2a64b8bef2b2e85aee9e0&amp;dn=The+Woman+in+Black+-+Susan+Hill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neil1966hardy","files":2,"time":1318461069,"description":"Loaded as rtf, suggest use of Calibre to convert to chosen format.\n\n\n\n\nProud and solitary, Eel Marsh House surveys the windswept reaches of the salt marshes beyond Nine Lives Causeway. Arthur Kipps, a junior solicitor, is summoned to attend the funeral of Mrs Alice Drablow, the house's sole inhabitant, unaware of the tragic secrets which lie hidden behind the shuttered windows.\n\nIt is not until he glimpses a wasted young woman, dressed all in black, at the funeral, that a creeping sense of unease begins to take hold, a feeling deepened by the reluctance of the locals to talk of the woman in black - and her terrible purpose.\n\nThis story, by the celebrated English author Susan Hill, is a tribute to M R James. This is brought to the attention of the reader not only through the fact that it is a ghost story but through other allusions such as the fact that the characters spend Christmas Eve telling each other ghost stories and also through the title of Chapter 10 - Whistle and I'll Come to You.\n\n\nAbout the Author\nSusan Hill was born in Scarborough and educated at King's College, London. Her novels include Gentlemen and Ladies, I'm the King of the Castle (Somerset Maugham Award), Strange Meeting, The Bird of Night (Whitbread Award), A Bit of Singing and Dancing, In the Springtime of the Year, Air and Angels, The Mist in the Mirror and Mrs de Winter.\n\nThe Woman in Black has been adapted for the stage and has been running to great acclaim in the West End since 1988. Her children's books include Can It Be True? (Smarties Prize), The Glass Angels and King of Kings.\n\nSusan Hill is married to the celebrated Shakespeare scholar Stanley Wells and references to Shakespeare are a common theme throughout her books. Note the 'poetry' at the end of Chapter 1 of The Women in Black which is a direct quotation from Hamlet.\n\n\n\nEnjoy and Seed!! ","torrent":{"xt":"urn:btih:dbf671c482d5ccdbaeb2a64b8bef2b2e85aee9e0","amp;dn":"The+Woman+in+Black+-+Susan+Hill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbf671c482d5ccdbaeb2a64b8bef2b2e85aee9e0","infoHashBuffer":{"type":"Buffer","data":[219,246,113,196,130,213,204,219,174,178,166,75,139,239,43,46,133,174,233,224]},"announce":[],"urlList":[]}}