{"title":"Angel Heart [1987] Alan Parker","uid":6716996,"size":912412168,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dc6d7526e734bddb1ce8d485e068855fef6a45f9&amp;dn=Angel+Heart+%5B1987%5D+Alan+Parker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1317596067,"description":" &lt;a href=&quot;http://bayimg.com/HaKaFAAdf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/HaKaFAAdf&lt;/a&gt;\n\nAngel Heart (1987) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0092563/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0092563/&lt;/a&gt;\n\n  Mickey Rourke  ...  Harry Angel  \n  Robert De Niro  ...  Louis Cyphre  \n  Lisa Bonet  ...  Epiphany Proudfoot  \n  Charlotte Rampling  ...  Margaret Krusemark  \n\nAngel Heart is a 1987 North American/British mystery-thriller film written and directed by Alan Parker, and starring Mickey Rourke, Robert De Niro, and Lisa Bonet. The film is adapted from the novel Falling Angel by William Hjortsberg, and is generally faithful to the novel with the exceptions being the introduction of a child of Epiphany Proudfoot conceived at a voodoo ceremony by &quot;a devil&quot;, and that the novel never leaves New York City, whereas much of the action of the film occurs in New Orleans.\n\nA highly atmospheric film, Angel Heart combines elements of film noir, hard-boiled detective stories and horror.\n\nAngel Heart gained attention and controversy even before its release. Bonet was previously known for her role on the family-oriented sitcom The Cosby Show, and several seconds of her extended, graphic and blood-drenched sex scene with Rourke had to be trimmed in order to secure the film an 'R' rating on initial release, though later an uncut X rated version was released.\n\nSome blamed the controversial sex scene for Bonet's departure from The Cosby Show, which resulted in her starring on the Cosby-produced program spin-off, A Different World which premiered in 1987.\n\nRotten Tomatoes counted 21 reviews with 76 percent of them being &quot;fresh&quot; or favorable; Average Rating: 7.2/10. Angel Heart broke even at the box office with its budget of $17 million.After being released on home video it became something of a cult film, appreciated for its unsettling tone, bleak cinematography (by Michael Seresin), its sad and eerie score (by Trevor Jones), and its blend of genres.\n\nRoger Ebert gave the film three and a half stars. He said: &quot; Angel Heart is a thriller and a horror movie, but most of all it's an exuberant exercise in style, in which Parker and his actors have fun taking it to the limit&quot;.\n\nWinesap's death was filmed but never included in the theatrical film, nor was it included in the deleted scenes on the DVD release. The only evidence of its existence is a fleeting shot during the love scene as well as an on-set photograph from a 1987 issue of Fangoria magazine which shows director Alan Parker crouching over the prosthetic mannequin of Florek's character. From the photograph, it can be inferred that Winesap was decapitated by an industrial fan in an unknown building by an unknown party; because Winesap was alive in New York during Angel's stay in New Orleans, it is likely that Cyphre had him killed remotely. The shot during the love scene shows an unknown man grasping Winesap by the lapels of his jacket and is followed by a shot of an industrial fan in an unnamed location. It is also likely that some of the footage of veiled people cleaning blood off of walls were also from this scene.\n\n \n","torrent":{"xt":"urn:btih:dc6d7526e734bddb1ce8d485e068855fef6a45f9","amp;dn":"Angel+Heart+%5B1987%5D+Alan+Parker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc6d7526e734bddb1ce8d485e068855fef6a45f9","infoHashBuffer":{"type":"Buffer","data":[220,109,117,38,231,52,189,219,28,232,212,133,224,104,133,95,239,106,69,249]},"announce":[],"urlList":[]}}