{"title":"The Whole Building Handbook {BBS}","uid":6710685,"size":91388753,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dcb57e9ac6bc1bcb52a4a1c65fd787a971d02cf7&amp;dn=The+Whole+Building+Handbook+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317342706,"description":"The Whole Building Handbook is a compendium of all the issues and strategies that architects need to understand to design and construct sustainable buildings for a sustainable society. The authors move beyond the current definition of sustainability in architecture, which tends to focus on energy-efficiency, to include guidance for architecture that promotes social cohesion, personal health, renewable energy sources, water and waste recycling systems, permaculture, energy conservation - and crucially, buildings in relation to their place. The authors offer a holistic approach to sustainable architecture and authoritative technical advice, on: * How to design and construct healthy buildings, through choosing suitable materials, healthy service systems, and designing a healthy and comfortable indoor climate, including solutions for avoiding problems with moisture, radon and noise as well as how to facilitate cleaning and maintenance. * How to design and construct buildings that use resources efficiently, where heating and cooling needs and electricity use is minimized and water-saving technologies and garbage recycling technologies are used. * How to 'close' organic waste, sewage, heat and energy cycles. For example, how to design a sewage system that recycles nutrients. * Includes a section on adaptation of buildings to local conditions, looking at how a site must be studied with respect to nature, climate and community structure as well as human activities. The result is a comprehensive, thoroughly illustrated and carefully structured textbook and reference.\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 704 pages\n    * Publisher: Routledge (December 20, 2009)\n    * Language: English\n    * ISBN-10: 1844075230\n    * ISBN-13: 978-1844075232","torrent":{"xt":"urn:btih:dcb57e9ac6bc1bcb52a4a1c65fd787a971d02cf7","amp;dn":"The+Whole+Building+Handbook+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcb57e9ac6bc1bcb52a4a1c65fd787a971d02cf7","infoHashBuffer":{"type":"Buffer","data":[220,181,126,154,198,188,27,203,82,164,161,198,95,215,135,169,113,208,44,247]},"announce":[],"urlList":[]}}