{"title":"Matthew Sweet - Modern Art (Bonus Track Version) (2011)","uid":6706163,"size":88367539,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dd1f9400fd49b3a1d3cbb399135b4ecc347ceb33&amp;dn=Matthew+Sweet+-+Modern+Art+%28Bonus+Track+Version%29+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wndrngpoet","files":13,"time":1317172545,"description":"Matthew Sweet - Modern Art (2011)\n\nJust downloaded this from Amazon this evening! Brand new material from Matthew Sweet!!! Enjoy, seed and comment!\n\n-Wndrngpoet\n\nFrom Amazon:\n\nThroughout a career that stretches back to the mid-'80s, Matthew Sweet has never followed trends, though his landmark 1991 album Girlfriend was responsible for starting one; in fact, many critics note that most power pop records made during the '90s owe a tremendous debt to Sweet. Two decades after the release of that iconic album, Sweet has once again swung for the fences and connected with the boldly experimental, yet deeply personal Modern Art. \n\nDefiantly unorthodox, but often playfully so, Modern Art features 12 new compositions of Sweet's trademark wistful, yearning pop that recall some of Sweet s touchstones: the Beatles, Beach Boys and Big Star. ''She Walks the Night'' is reminiscent of earlyperiod Byrds, while ''Ladyfingers'' stomps along with the authority of T. Rex. Other standout tracks include the swirling, psychedelic ''Oh, Oldendaze!,'' the ruggedly assertive ''Late Nights With the Power Pop,'' the acerbically witty ''Evil By Design, Goodbye Nature'' and the sweetly soulful ''Modern Art.'' \n\nLongtime musical cohort Ric Menck (Velvet Crush) does all the drumming on the album (except for ''Ivory Tower,'' which is built on a random drum pattern supplied by Sweet's friend, actor/musician Fred Armisen). Dennis Taylor s deft and urgent guitar lines serve as a running commentary to Sweet s introspective singing. Finished by mastering engineer Glenn Schick, Modern Art promises to be another trend-setting release by Sweet.","torrent":{"xt":"urn:btih:dd1f9400fd49b3a1d3cbb399135b4ecc347ceb33","amp;dn":"Matthew+Sweet+-+Modern+Art+%28Bonus+Track+Version%29+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd1f9400fd49b3a1d3cbb399135b4ecc347ceb33","infoHashBuffer":{"type":"Buffer","data":[221,31,148,0,253,73,179,161,211,203,179,153,19,91,78,204,52,124,235,51]},"announce":[],"urlList":[]}}