{"title":"Redbook Magazine Collection PDF MEGAPACK [CARG]","uid":7412963,"size":1899584919,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:deeca714200ffa8df3d325d842f828f623bd1c09&amp;dn=Redbook+Magazine+Collection+PDF+MEGAPACK+%5BCARG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hard2Find2","files":-1,"time":1341428353,"description":"CARG Release Redbook Magazine Collection PDF MEGAPACK \n\n\nBe sure to check out the other CARG PDF release's. To show your support for the time and effort in building this collection, Please seed at full speed during and after download so that others can also enjoy.\n\n\nThis collection contains 30 Redbook Magazine Pdf files.  \n\n\nRedbook is an American women's magazine published by the Hearst Corporation. It is one of the &quot;Seven Sisters&quot;, a group of women's service magazines.\n\nThe magazine was first published in May 1903 as The Red Book Illustrated by Stumer, Rosenthal and Eckstein, a firm of Chicago retail merchants. The name was changed to The Red Book Magazine shortly thereafter. Its first editor, from 1903 to 1906, was Trumbull White, who wrote that the name was appropriate because, &quot;Red is the color of cheerfulness, of brightness, of gayety.&quot; In its early years, the magazine published short fiction by well-known authors, including many women writers, along with photographs of popular actresses and other women of note. Within two years the magazine was a success, climbing to a circulation of 300,000.\n\n\nRedbook's articles are primarily targeted towards married women. The magazine features stories about women dealing with modern hardships, aspiring for intellectual growth, and encouraging other women to work together for humanitarian causes. The magazine profiles successful women, such as Christa Miller, to provide inspirational testimonies and advice on life.","torrent":{"xt":"urn:btih:deeca714200ffa8df3d325d842f828f623bd1c09","amp;dn":"Redbook+Magazine+Collection+PDF+MEGAPACK+%5BCARG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"deeca714200ffa8df3d325d842f828f623bd1c09","infoHashBuffer":{"type":"Buffer","data":[222,236,167,20,32,15,250,141,243,211,37,216,66,248,40,246,35,189,28,9]},"announce":[],"urlList":[]}}