{"title":"NEED FOR SPEED HOT Pursuit ps2 - no key needed","uid":6703724,"size":272904840,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:df57fc2f03991c8e5b1a127cf2af73bbae5acb63&amp;dn=NEED+FOR+SPEED+HOT+Pursuit+ps2+-+no+key+needed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"avrumi","files":-1,"time":1317080065,"description":"NEED FOR SPEED HOT Pursuit ps2 - just install and your done\n\n\n\nNeed for Speed: Hot Pursuit 2\n\nWindows\nGenre(s)\tRacing\nMode(s)\tSingle-player, multiplayer (2 players)\n\t\nSystem requirements\nWindows: Pentium III 450Mhz, 128MB RAM, Windows 98 or better, 16MB DirectX 8.1 compatible 3D card, and 1.2GB of hard-disk space.\n\nContents [hide]\n1 Gameplay\n1.1 Race types\n2 Soundtrack\n3 Development\n4 Reception\n5 Sequel\n6 References\n7 External links\n\n\nHot Pursuit 2 draws primarily from the gameplay and style of Need for Speed III: Hot Pursuit; its emphasis was on evading the police and over-the-top tracks featuring lengthy shortcuts.\nAs with the game\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s predecessor, the player also has the option to play as a police officer trying to arrest speeders. To do so the player rams the speeding vehicle multiple times to disable it. The player must turn on their lights and sirens while in pursuit, and they automatically turn off after arresting the suspect. Police can call for a road block, spike strips, and request help from a helicopter to assist in chasing the target vehicle. At the end, the player is awarded for the cars busted. In the PlayStation 2 version this mode is called You\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'re the Cop mode while in the PC, Gamecube and Xbox versions it\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s Be the Cop mode.\nRaces take place in four environments which differ in atmosphere, with a handful of tracks per environment. The different tracks in an environment are formed by different roads being connected or separated by road blocks. A fictional tropical island, reminiscent of Hawaii, is the most varied environment; the track traverses a city, volcano, waterfall, beach, forest, and two villages. The coastal forest environment, reminiscent of the Washington coast, sometimes has foggy weather, but this does not effectively limit visibility during races. The Mediterranean coast and so-called Alpine environments are more homogeneous, with little variation except the occasional short cut. Compared to the original Hot Pursuit, which features weather and day/night variation independent of track, and widely varying environments from snowy mountains over cities to desert, Hot Pursuit 2 tracks have significantly less variation.\nHot Pursuit 2 is also the first in the series to lack an in-car view that was available in preceding Need for Speed titles. There is only a \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;driver\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s perspective\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; view available, without a visible dashboard. There is one race however on the PlayStation 2 version, with a Ferrari, in which the player drives with this in-car view.\nRace types\n\n\nThe player in pursuit of a speeder, having called for backup in the form of an additional police unit.\nAll types of modes can only have a certain class of cars to be used. Faster cars are used near the end of the \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Championship\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; and \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Ultimate Racer\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; modes. Delivery is a timed point-to-point dash, with the police in pursuit. This is similar to the delivery mission in Porsche Unleashed while the police pursuit makes it more challenging. Sprint is a point to point race where competitors try to get from one end to the other before their opponent. Time Trial gives players three laps on a level with the goal being to beat the required time to get the gold/silver/bronze medal. Lap Knockout eliminates the last racer in each lap until one player remains the victor. Knockout follows a similar principle, but eliminations are made to the last racer at the end of each race. Several other modes, such as Tournament, Single Race, and Championship/Ultimate Racer are also available.\nSoundtrack\n\nHot Pursuit 2 is the first Need for Speed game to feature licensed rock music under the EA Trax label (\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;EA GamesTM Trax\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; at the time of game launch) along with techno music composed by contract artists. The game\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s soundtrack consists of eight vocal rock songs and seven instrumental rock and electronic songs, all fast-paced with elements of grunge, hip-hop and rap. The vocal songs are also featured in a second, instrumental version. In the \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Be the Cop\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; and \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Hot Pursuit\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; game modes, the instrumental versions replace the vocal ones, which avoids obscuring the police radio messages by the song lyrics. In the PS2 version, there is the option to change whether or not certain songs are played in normal races, hot pursuit races, the game menus, or if they are not to be played at all. The Xbox version also allows for custom soundtracks, something which Hot Pursuit 2\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s successors lacked.\nNeed For Speed: Hot Pursuit 2 (In-Game Music)\nNo.\tTitle\tMusic\tLength\n1.\t\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;The People That We Love\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;  \tBush\t3:29\n2.\t\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Ordinary\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;  \tThe Buzzhorn\t3:09\n3.\t\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Wall of Shame\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;  \tCourse of Nature\t4:08\n4.\t\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Fever for the Flava[Note 1]\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;  \tHot Action Cop\t4:05\n5.\t\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Goin\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\' Down on It[Note 1]\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;  \tHot Action Cop\t4:52\n6.\t\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Build Your Cages\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;  \tPulse Ultra\t3:55\n7.\t\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;One Little Victory\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;  \tRush\t5:08\n8.\t\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Keep It Comin\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;  \tUncle Kracker\t3:23\n9.\t\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Bundle of Clang\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;  \tMatt Ragan\t3:04\n10.\t\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Cone of Silence\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;  \tMatt Ragan\t3:00\n11.\t\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Flam Dance\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;  \tMatt Ragan\t3:00\n^ a b Lyrics edited to replace explicit content with car-themed lyrics\nDevelopment\n\nDifferent versions of the game were produced for each game platform; the Xbox, GameCube and PC versions were developed in EA Seattle, a subsidiary of EA Canada, while the PS2 version was developed by EA Black Box[1] in Vancouver, B.C. Canada. Also, it did not feature a career mode allowing car personalization. Instead, there is a point system where cars are purchased from winning races. Points are determined by laps led and finishing position. In the \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Championship\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; and \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Hot Pursuit\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; trees, extra points are awarded if a medal is won, decided by the requirements. For example, a sprint (see section below) would give 5000 points if awarded the gold, 4000 for silver, and 2500 for bronze, etc. Points would give types of tracks to race on, cars, police cars, etc. If the tree is completed, extra bonus races are unlocked. These races include the hardest AI and the hardest courses. For the multiplayer mode of the PC version, players can host a game server for LAN or internet based playing. In addition to this, the GameSpy internet matchmaking system can be used to publish and locate such servers.\nReception\n\n[hide] Reception\nAggregate scores\nAggregator\tScore\nGameRankings\t88% (41 reviews)[4]\nMetacritic\t89/100 (31 reviews)[5]\nReview scores\nPublication\tScore\nGame Revolution\tA-[6]\nGameSpot\t8.5/10[7]\nGameSpy\t89/100[8]\nIGN\t9/10[9]\nHot Pursuit 2 was released to generally favorable reviews. The PS2 version scored an 88% on GameRankings[4], and 89 out of 100 at Metacritic[5]. The Xbox version scored slightly lower at GameRankings, with 81%[10] and 75 out of 100 at Metacritic[11]. The GameCube and PC versions scores at GameRankings and Metacritic were 74%[12] and 68 out of 100[13], and 73%[14] and 73 out of 100[13] respectively.\nIGN\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s David Smith praised the PS2 version, saying \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Hot Pursuit 2 has its finger right on the pulse of what makes an arcade racer fun.\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;[9] Amer Ajami of GameSpot stated that \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Need for Speed: Hot Pursuit II is easily one of the best games in the series.\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;[7] GameSpy praised the sensation of speed and tight controls, but went on to criticize repetitive mission objectives.[8]\nSequel\n\n\n\n\n- try it you will enjoy \n\n\n\n___________________________________________________________\n\n\ncomment and seed lake friends thanks  --- avrumi  \n\n\n___________________________________________________________\n\nmore at \n    &lt;a href=&quot;\nhttp://thepiratebay.se/user/avrumi/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/avrumi/&lt;/a&gt;","torrent":{"xt":"urn:btih:df57fc2f03991c8e5b1a127cf2af73bbae5acb63","amp;dn":"NEED+FOR+SPEED+HOT+Pursuit+ps2+-+no+key+needed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df57fc2f03991c8e5b1a127cf2af73bbae5acb63","infoHashBuffer":{"type":"Buffer","data":[223,87,252,47,3,153,28,142,91,26,18,124,242,175,115,187,174,90,203,99]},"announce":[],"urlList":[]}}