{"title":"RipTiger 3.3.1.1 [en-de-fr]","uid":6855201,"size":15402303,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dfc7a6991d27c02a1f23351e6b1958a957024da7&amp;dn=RipTiger+3.3.1.1+%5Ben-de-fr%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":-1,"time":1322672752,"description":"RipTiger is the world's #1 web video downloader. It's an award-winning solution that boasts extreme simplicity in web video downloading and management. RipTiger is an online video downloader that saves video to your computer as soon as you start watching. It captures video automatically and downloads it while you continue surfing the web. Fast video capturing from the web allows you to download dozens of videos simultaneously. You don't have to keep the video playing in your browser. RipTiger can download most online video even if you close your browser while watching (provided internet connection remains active for the duration of the download). All downloads are saved to your download folder so you can change file names, convert web video to other formats and enjoy your video. This state-of-the-art software records web video in the background in original quality, and you don't have to click or start each download process manually. Once you start watching the video on the web, RipTiger will pick it up and do the recording for you. \n\nMost of the popular streaming and file formats are supported:\n* Flash Video (HTTP and RTMP),\n* Windows Media (HTTP, MMS and RTSP)\n* Real Audio and Real Video (HTTP and RTSP)\n* MPEG\n* QuickTime\n* Streaming MP3 (Shoutcast)\n\nNo other software can download as many formats as RipTiger does.\nWith RipTiger's new Flash recording technology, no other software can capture everything RipTiger does. \n\nHighest Capturing Quality\n\nRipTiger downloads compressed and high definition video from the web, saving its exact high quality copy to your hard drive.\n\nAdvanced Features\n* Turbo Capturing - record video stream with up 10x speed\n* Capture videos without commercials\n* Automatic Capturing\n* Capture at the highest quality\n* Capture multiple and many more...\n\nOS: Windows XP/Vista/7","torrent":{"xt":"urn:btih:dfc7a6991d27c02a1f23351e6b1958a957024da7","amp;dn":"RipTiger+3.3.1.1+%5Ben-de-fr%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfc7a6991d27c02a1f23351e6b1958a957024da7","infoHashBuffer":{"type":"Buffer","data":[223,199,166,153,29,39,192,42,31,35,53,30,107,25,88,169,87,2,77,167]},"announce":[],"urlList":[]}}