{"title":"(Blues) Scott H. Biram - Graveyard Shift","uid":6730448,"size":109845465,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e1beedc5b4a3195c380b7ccf17805cf943ea9fd1&amp;dn=%28Blues%29+Scott+H.+Biram+-+Graveyard+Shift&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1318116482,"description":"Bitrate: 320K/s \nTime: 45:42 \nSize: 104.7 MB \nLabel: Bloodshot\nStyles: Alternative country-rock, Blues-rock\nYear: 2006 \nArt: Front \n\n[3:45] 1. Been Down Too Long\n[3:53] 2. No Way\n[2:31] 3. Graveyard Shift\n[3:28] 4. Lost Case Of Being Found\n[3:32] 5. Only Jesus\n[3:03] 6. Goin' Home\n[3:54] 7. 18 Wheeler Fever\n[3:05] 8. Plow You Under\n[2:54] 9. Work\n[4:35] 10. Long Fingernail\n[3:16] 11. Reefer Load\n[3:14] 12. Have No Fun\n[2:36] 13. Santa Fe\n[1:50] 14. Church Babies\n\n\nScott H. Biram has a sound as gritty as sandpaper. The one-man band owns his own style, which meshes the raw muddiness of blues, the rowdiness and down-to-earth simplicity of country, and the mutiny of punk. And with all this variety existing in nearly every song on Graveyard Shift, no two songs sound exactly alike. In fact, most of them are so starkly different from the next that it's hard to believe it's the same album. The title track is a raucous, messy punk-blues fusion and it yields to &quot;Lost Case of Being Found,&quot; a mellow alt-country toe-tapper. The rest of the album follows suit, rebelliously howling and meandering through heartsick ballads, highway songs, and salutes to inebriation. Graveyard Shift is all over the place, but it's never chaotic. It makes perfect sense. No matter how different each song might or might not be from the next, Biram's soulful presence and gritty vocals tie everything together. It's tempting to try to compare Biram to other artists, in order to help describe such a unique musician. In Biram's case, comparisons are simply too vague. Though while listening to Graveyard Shift, one will likely be reminded of certain artists as unique as Biram (though he is a one-man band, which is exceedingly rare). His eclectic eccentricity is reminiscent of Beck; many of his songs are punked-out neo-traditionalist country -- something he and Hank Williams III have in common; and the unprocessed blues riffs and unique rhythm that occupies much of his sound could stand up to a more intoxicated Lightnin' Hopkins. Biram's unique blend of his own attitude and a variety of musical styles make him accessible to all types of music aficionados. Biram's high-energy live performances are said to be the only way to truly experience his music, but Graveyard Shift will give you an idea of the unique brilliance you've been missing. \n","torrent":{"xt":"urn:btih:e1beedc5b4a3195c380b7ccf17805cf943ea9fd1","amp;dn":"%28Blues%29+Scott+H.+Biram+-+Graveyard+Shift","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1beedc5b4a3195c380b7ccf17805cf943ea9fd1","infoHashBuffer":{"type":"Buffer","data":[225,190,237,197,180,163,25,92,56,11,124,207,23,128,92,249,67,234,159,209]},"announce":[],"urlList":[]}}