{"title":"The Isaacs And Quabbalah [Reseed - Verifire].zip","uid":6701547,"size":35340830,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3d1dc7572ae55174da30971e55252a68be7aed5&amp;dn=The+Isaacs+And+Quabbalah+%5BReseed+-+Verifire%5D.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"verifire","files":-1,"time":1316991691,"description":"Hi there..\n\nI've uploaded this before, but the torrent got hindered in so many ways it's amazing. Just trust me. They don't want you to see this.\nI'd LOVE to speak only comfort and peace to my fellow Christians, but I feel that I have to shake the tree again..\n\n'Be not partakers in the unfruitful works of the evil, but rather expose them..' \nPaul the apostle.\n\n=====================\n\nQuote from original upload:\n\n'It is with immense sorrow and with a numb feeling of disbelief I write this, but it's inavoidable.\n\nI've discovered that this group, so loved by so many for their music and seemingly devotion to Jesus Christ, in fact bear evidence on being infiltrators of the true Church. Kabbalistic and clearly satanic. If not in words (yet), so absolutely in symbolism and appearance, hand signs, colors and all.\nThe implications of this discovery are too many to count or list, at least in this comment.'\n\n'I've stopped seeding all Torrents where they are involved.\nThe contents of this upload will clarify this.\n\nI strongly recommend, yes, urge you to download and read the documents and see the pictures etc, that supports this claim. I would love to be proved wrong, but the pictures etc. speak for themselves, I'm afraid..\n\nThe Documents are stored both in Open Office format and as MS-Word document.'\n\n===============\n\n..plus there are htm-documents to prove the site looked like it did.\nJust weeks after I made the upload, the site had changed completely.\n\nI had another look at their site just now, and it's still all pretty.. ..almost..\nBut not if you know what you see..\nBut the pages and pictures from this upload are gone..\nIf you want to know what I mean, and you see the value in knowing the truth of such things, you know what to do..\n\nQuote from Texe Marrs book 'Codex Magica'\n\n'..the overwhelming &quot;see no evil, hear no evil&quot; masses of people in society can be expected to quickly jump to  the attack and attempt to deny it all. Through sleight-of-hand, they will do their utmost to divert your attention. &quot;The pictures are taken out of context,&quot; they will protest. &quot;The images are not what they seem.&quot;\n&quot;Here, listen to us,&quot; they will implore, &quot;it's not what it looks like. Let us explain it all to you.&quot;\n&quot;Don't be hasty now in your judgment,&quot; they'll cry. &quot;You and I know that conspiracies don't really exist. Everything is okay, nothing is amiss. It is all just an accident, nothing to fret about.&quot;\n\nWell.. I must say that when I first saw the content of this upload, I don't remember thinking much about anyhing. I was heartbroken.\nI loved this band.\nI included them on compilations of Christian music.\nI sent their music to friends.\nthen I saw this. \nI quickly downloaded the full pages of their site, plus I collected the photos and such as documents.\nIn addition I threw in Texe Marrs' book.\nIt explains a lot of what you see going on around you today, no matter what you think of the author.\nAnd I also enclosed some rather amazing material about a man named Albert Pike and a vision he had in 1871..\nInteresting to say the least, considering the current world situation\nMail me if there's anything you want, or wonder about, and I'll try to help as best I can.\n\nLove,\nVerifire\n==============\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;592f3c2b303f302b3c34383035193e34383035773a3634&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n","torrent":{"xt":"urn:btih:e3d1dc7572ae55174da30971e55252a68be7aed5","amp;dn":"The+Isaacs+And+Quabbalah+%5BReseed+-+Verifire%5D.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3d1dc7572ae55174da30971e55252a68be7aed5","infoHashBuffer":{"type":"Buffer","data":[227,209,220,117,114,174,85,23,77,163,9,113,229,82,82,166,139,231,174,213]},"announce":[],"urlList":[]}}