{"title":"20111020-Stossel-[Reaction to Stupid in America]-Fox Business.CF","uid":6765021,"size":365276090,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e4d4c71684e7b17df87a37b75937102338a007b2&amp;dn=20111020-Stossel-%5BReaction+to+Stupid+in+America%5D-Fox+Business.CF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1319345931,"description":"----------\n\nSTOSSEL - [Reaction to Stupid in America] - Fox Business Network\n2011, October 13, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\nThis show is follow to the 20110917 FNC special, &quot;Stupid in America&quot;.\n\n[excerpted from John Stossel's blog:]\n\nNot everyone liked my education special &quot;Stupid in America&quot;. I got angry emails, accusing me of &quot;union bashing&quot; and &quot;teacher bashing&quot;.\n\nTonight on FBN, I'll revisit the subject. We'll show more of the exciting things happening in charter schools, where students told us &quot;learning is fun&quot; and reading is &quot;rockin' awesome&quot;.\n\nPolitically incorrect educator Ben Chavis is back. He raised test stores, but insists on strict discipline. He'll debate former union leader turned charter school director A.J. Duffy and Steve Brill, author of &quot;Class Warfare: Inside the Fight to Fix America's Schools&quot;\n\nJust 6 years ago, when I first did a &quot;Stupid in America&quot; show, unions were so outraged that I would dare challenge their rules that hundreds of them showed up outside my office to scream at me. Teachers union president Randi Weingarten stood on the street with a megaphone and screamed that because of my show, &quot;Teachers all across the country feel they've been kicked in the teeth. &quot;\n\nShe was upset that I called K-12 education a government monopoly. I don't think she'd ever even heard the system called a monopoly. When I interviewed her about it, she replied that people who say that &quot;... don't like children.&quot;\n\nAnd yet, now, just a few years later, lots of people call the current system a government monopoly, and millions of kids escape it via charter schools or vouchers. 18 school districts now have more than 20 percent of their kids enrolled in charter schools. Six have more than 30 percent and when Hurricane Katrina destroyed much of New Orleans, the city replaced most of its schools with non-union charters.","torrent":{"xt":"urn:btih:e4d4c71684e7b17df87a37b75937102338a007b2","amp;dn":"20111020-Stossel-%5BReaction+to+Stupid+in+America%5D-Fox+Business.CF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4d4c71684e7b17df87a37b75937102338a007b2","infoHashBuffer":{"type":"Buffer","data":[228,212,199,22,132,231,177,125,248,122,55,183,89,55,16,35,56,160,7,178]},"announce":[],"urlList":[]}}