{"title":"Universal USB Installer 1.8.7.1","uid":6838591,"size":1003671,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:e68ecad5804014fb50493d5ee3a56b36616bebd4&amp;dn=Universal+USB+Installer+1.8.7.1+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"windows10","files":1,"time":1322090056,"description":"Hello again everyone! This is my second upload for this website.\n\nThis file is called, &quot;Universal USB Installer 1.8.7.1&quot; This is an (exe) file, which means it is for Windows. Universal USB Installer is a Live Linux USB Creator that allows you to choose from a selection of Linux Distributions to put on your USB Flash Drive. The Universal USB Installer is easy to use. Simply choose a Live Linux Distribution, the ISO file, your Flash Drive and, Click Install. Other features include; Persistence (if available), and the ability to fat32 format the flash drive (recommended) to ensure a clean install. Upon completion, you should have a ready to run bootable USB Flash Drive with your select Linux version installed.\n\nYou can burn any kind of Linux in your USB Disk. If you want to download Ubuntu, go to this website: www.Ubuntu.com\nIf you don't want to burn the ISO file that you downloaded from the website to a USB Disk, you can also burn it on a DVD. \n\nBurning on a DVD Disk (Windows 7):\n\n1) Windows 7 already has a windows ISO burner for DVD'S. \nRight-click on your Ubuntu ISO image that you just downloaded from me and choose 'Open with &gt; Windows Disc Image Burner'.\n\n2) Select a disk burner (drive) and choose 'Burn'. If you check 'Verify disc after burning', it will confirm that the ISO image has been burned correctly.\n\nBurning on a DVD Disk (Windows XP, Server 2003, Vista)\nProgram: ISO Recorder\n\n1) Download and install ISO Recorder from this link: http://isorecorder.alexfeinman.com/isorecorder.htm\n\n2) Insert an unformatted DVD into your burner. (Note: You can only burn DVDs with this tool from Vista.)\n\n3) Open Windows Explorer, find your ISO file, right-click and choose 'Next'. (Continue what is next)\n\nBurning on a DVD Disk (Windows 95, 98, ME, 2000, XP, Server 2003, Vista):\n\n1) Download and install Infra Recorder, a free and open-source image-burning program. Link for download: http://infrarecorder.org/\n\n2) Insert a blank CD in the drive and select Do nothing or Cancel if an autorun dialog box pops up.\n\n3) Open Infra Recorder and click the 'Write Image' button in the main screen. Alternatively you can select the 'Actions' menu, then 'Burn image'.\n\n4) Select the Ubuntu CD image file you want to use, then click 'Open'. In the dialog box, click 'OK'.\n\nPlease seed and comment me if this file has any problems. Thanks!\n","torrent":{"xt":"urn:btih:e68ecad5804014fb50493d5ee3a56b36616bebd4","amp;dn":"Universal+USB+Installer+1.8.7.1+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e68ecad5804014fb50493d5ee3a56b36616bebd4","infoHashBuffer":{"type":"Buffer","data":[230,142,202,213,128,64,20,251,80,73,61,94,227,165,107,54,97,107,235,212]},"announce":[],"urlList":[]}}