{"title":"Encyclopedia of Microbiology","uid":6696413,"size":49316513,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7e4820b305ecbf503afcfc12b0a40ba1040e624&amp;dn=Encyclopedia+of+Microbiology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chami1988","files":1,"time":1316796569,"description":"Fa cts on Fi le | 2011 | ISBN: 0816073643 | 858 pages | PDF\n\nHumans have always struggled with how to balance the benefits bacteria offer with the threats that they produce. Much less obvious than the effects microorganisms have on plants and animals are the indirect ways in which they shape the planet.\n\nThese hidden activities have rarely been explained in science, though scientists realize that the behavior of microbes supports all life on Earth.\nIn more than 200 entries, Encyclopedia of Microbiology presents the myriad ways in which microorganisms influence the biosphere. Focusing on how all microorganisms relate to each other just as all higher organisms relate to all other animate and inanimate objects on Earth, this new resource explores all aspects of microbiology from mycology (the study of fungi) to the simplest biological entities of all, viruses, to prions, which are even more streamlined than viruses and just as dangerous. Biographical sections in many entries highlight the scientists who most influenced developments or discoveries in microbiology, including Louis Pasteur. Entries cover new techniques in microscopy, genetic engineering, gene therapy, and nanotechnology. A full-color insert, helpful appendixes, cross-references, and further resources round out this invaluable resource.\n\nEssays include:\n\nWhere Are Germs Found?\nThe Realities of Biological Weapons\nDoes Immigration Lead to Increased Incidence of Disease?\nWill Global Warming Influence Emerging Diseases?\nMicrobes Meeting the Need for New Energy Sources\nBioengineered Microbes in the Environment\nDoes Vaccination Endanger or Improve Our Health?\nDoes Air Travel Make Us Sick?","torrent":{"xt":"urn:btih:e7e4820b305ecbf503afcfc12b0a40ba1040e624","amp;dn":"Encyclopedia+of+Microbiology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7e4820b305ecbf503afcfc12b0a40ba1040e624","infoHashBuffer":{"type":"Buffer","data":[231,228,130,11,48,94,203,245,3,175,207,193,43,10,64,186,16,64,230,36]},"announce":[],"urlList":[]}}