{"title":"Multi crew expirience","uid":6709924,"size":86703560,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:eb7c3a42c086efc7887635a60e6dcb7ba39692d8&amp;dn=Multi+crew+expirience&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Smoky354","files":1,"time":1317314966,"description":"We are pleased to introduce, Multi Crew Experience, an add-on to award winning Microsoft Flight Simulator software. It is designed for both, FSX and FS 2004.\n\n\nBy combining different technologies, we aim to add that little bit of excitement to the overall flight simulation experience.\n\nWhether you are a flight simulator enthusiast, looking for more realism, real pilots temporarily grounded due to economic downturn, or simply want to enjoy what the product has to offer; we believe you will find a purpose to this outstanding application.\n\nAt the core of the product, is the use of speech recognition technology along with speech synthesis.\n\nThis is a product that will give you the opportunity for a Multi Crew Experience. You will never fly those heavies alone again. It will not only run on FSX, but also accommodate FS 2004. So, for die-hard FS9 lovers, this is one more reason to stick to the good old one. Of course we are talking from a performance perspective.\n\n \n\nWhy our implementation is the best.\n\nÃ‚Â· Works across a wide range of systems, XP, Vista, Windows 7, English or foreign editions, for both FSX and FS9.\n\nÃ‚Â· It does what it claims.\n\nÃ‚Â· It's feature rich, and provides the ultimate Multi Crew Experience.\n\nÃ‚Â· You can talk not just to your co-pilot, but to native ATC and Radar Contact controllers as well. And we mean real ATC interaction, not keyboard keys associated with specific sentences. Unlike the poor implementation of our competitors, we do know what's on the ATC menu at any given time for both Native and RC4 ATC. We are the only ones who managed this feat. Others can only send keyboard keys, hoping for the best.\n\nÃ‚Â· Supports all default FSX and FS9 aircraft, as well as many third party aircraft add-ons. And the list is growing.\n\n. It runs outside the simulator. There is no chance of spoiling a very long flight due to a bad voice command. \n\n. No matter what edition of FSX or FS9 you own, that is English or localized foreign version, you will be able to interact with the built-in FS ATC in English.\n\nÃ‚Â· We write as much code as we can, so that we don't have to blame third party plug-ins when things don't go as planned.\n\nÃ‚Â· You don't need a quad core machine to run it. It is very lean and mean with system resources.\n\n. It's based on real talk, and you'll hardly need to read the manual to get started. Very high flexibility with regards the way you speak the various commands. No need to memorise specific sentences to get things done.\n\nÃ‚Â· It comes with a professionally designed set-up that will get you up and running in minutes\n\nBut it not crack yet  is ther somone thet can crack it PLZ.","torrent":{"xt":"urn:btih:eb7c3a42c086efc7887635a60e6dcb7ba39692d8","amp;dn":"Multi+crew+expirience","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb7c3a42c086efc7887635a60e6dcb7ba39692d8","infoHashBuffer":{"type":"Buffer","data":[235,124,58,66,192,134,239,199,136,118,53,166,14,109,203,123,163,150,146,216]},"announce":[],"urlList":[]}}