{"title":"Coast To Coast AM 09.22.11 Demonic Aliens &amp; UFOs - C2CP2P","uid":6696289,"size":55584034,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ebb6360dc6b9c4e3553b1c42df6a74428b6558bb&amp;dn=Coast+To+Coast+AM+09.22.11+Demonic+Aliens+%26amp%3B+UFOs+-+C2CP2P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"1337bits","files":2,"time":1316790857,"description":"\n\nCoast To Coast AM 09.22.11 Demonic Aliens &amp; UFOs - C2CP2P\n\nDate:\t09-22-11\nHost:\tGeorge Noory\nGuests:\tTimothy Green Beckley, Robert Chapman\n\nUfologist and paranormal pioneer Timothy Green Beckley discussed his contention that UFOs/aliens are not extraterrestrial, but intelligently controlled phantoms from terrestrial/interdimensional sources, and are often associated with negative or demonic forces. These &quot;beings&quot; and their craft are able to change shape, as well as vanish right in front of our eyes, which suggests they are popping into or out of another dimension, he said. Beckley also pointed to the association of Hitler &amp; the Nazi movement to UFOs, and posited that the craft in the Roswell crash may have been a German flying saucer prototype.\n\nBlood rituals and sacrifices have been connected to UFOs, such as animal and human mutilations, he said, citing an incident in a Brazilian village, where people were struck by beams of light, and drained of blood. Further, John Keel reported on a case in which a bloodmobile was chased by a UFO that attempted to draw it up into the craft. In another case in Brazil, an entire town was said to be possessed after their encounter with UFOs, Beckley detailed.\n\nHe recounted the work of Spanish priest, Salvador Freixedo, who argues that UFOs/aliens are &quot;evil forces&quot; that consider humans breeding animals, and exploit us for our blood. He spoke about Alvin Moore who believed that a series of invisible islands or planets circle the Earth in a low altitude, and &quot;sky men&quot; from these realms exploit humanity. Beckley also shared various reports of demonic beings seen coming from UFOs, such as William Lamb's 1922 account of a giant creature with wings that passed right through a barbed wire fence.\n\nEconomic Overview\nFirst hour guest, editor and publisher of International Forecaster, Bob Chapman, talked about the economy and stock market fluctuations. The Federal Reserve's plan to drive down interest rates may help more people qualify for home mortgages, so more of the current inventory can be unloaded, but the downside is that the lower rates will create higher inflation, he commented.\n\n\n\n\nAudio\nFormat                           : MPEG Audio\nFormat version                   : Version 2\nFormat profile                   : Layer 3\nDuration                         : 2h 34mn\nBit rate mode                    : Constant\nBit rate                         : 48.0 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 16.0 KHz\nCompression mode                 : Lossy\nStream size                      : 53.0 MiB (100%)","torrent":{"xt":"urn:btih:ebb6360dc6b9c4e3553b1c42df6a74428b6558bb","amp;dn":"Coast+To+Coast+AM+09.22.11+Demonic+Aliens+%26amp%3B+UFOs+-+C2CP2P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebb6360dc6b9c4e3553b1c42df6a74428b6558bb","infoHashBuffer":{"type":"Buffer","data":[235,182,54,13,198,185,196,227,85,59,28,66,223,106,116,66,139,101,88,187]},"announce":[],"urlList":[]}}