{"title":"Frozen Planet S01E05 Winter 1080i HDTV","uid":6838600,"size":3230349056,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f02b8aa6e3ad8d78606ddab748e2539bca2714a1&amp;dn=Frozen+Planet+S01E05+Winter+1080i+HDTV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bornintheguz","files":2,"time":1322090286,"description":"There is no greater test for life than winter, as temperatures plummet to 70 below and winds reach 200kph. Darkness and ice extend across the polar regions and only a few remarkable survivors gamble on remaining.\n\nWe join a female polar bear trekking into the Arctic mountains to give birth as the first blizzards arrive. Out on the frozen ocean, the entire world's population of spectacled eider ducks brave the winter in a giant ice hole kept open by ferocious currents. Arctic forests transform into a wonderland of frost and snow - the scene of a desperate and bloody battle between wolf and bison, but also where a remarkable alliance between raven and wolverine is made. Beneath the snow lies a magical world of winter survivors. Here tiny voles dodge the clutches of the great grey owl, but cannot escape the ultimate under-show predator - the least weasel.\n\nMidwinter and a male polar bear wanders alone across the dark, empty icescape. Below the snow, polar bear cubs begin life in an icy den while fantastical auroras light the night skies above. In Antarctica, we join male emperor penguins in their darkest hour, battling to protect precious eggs from fierce polar storms. Weddell seals escape to a hidden world of jewel-coloured corals and alien-looking creatures but frozen devastation follows as sinister ice stalactites reach down with deadly effect.\n\nThe sun finally returns, and with it comes the female emperor penguins, sleek and fat, ready to deliver the first meal to their precious chick. Having survived winter, this ultimate ice family now have a head start in raising baby. The Adelies flood back and as the ice edge bustles with life, male emperor penguins can finally return to the sea.\n\n\nDivX Plus Codec Pack recommended. Torrent contains alternative ac3 audio for those having problems with original aac audio.","torrent":{"xt":"urn:btih:f02b8aa6e3ad8d78606ddab748e2539bca2714a1","amp;dn":"Frozen+Planet+S01E05+Winter+1080i+HDTV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f02b8aa6e3ad8d78606ddab748e2539bca2714a1","infoHashBuffer":{"type":"Buffer","data":[240,43,138,166,227,173,141,120,96,109,218,183,72,226,83,155,202,39,20,161]},"announce":[],"urlList":[]}}