{"title":"AntiRun 2.4 Pro Final[NepsterJay].rar","uid":7518496,"size":3208468,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f02e6c9472ebc4ee8f5adc22424f5514bee37884&amp;dn=AntiRun+2.4+Pro+Final%5BNepsterJay%5D.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NepsterJay","files":1,"time":1344546035,"description":"Antirun - a program to protect the system from the threats of contamination with USB-storage media: flash drives, memory cards, external hard disks, mp3-players, cameras and other media, connected via USB-port. The utility scans inserted into the computer automatically recognizes the device and the autorun file, displaying the name of the executable object and its icon. Allows you to open the drive to view the contents without opening the malicious file. The program is easy to use, has nice and intuitive interface and does not need to update antivirus signatures. \n\nFeatures: \n\n- Automatic check \nAntirun automatically scans the connected device and notifies users of any threats. \n\n- Removing the virus \nThe program automatically detects the executable file. Detected the virus is removed with one click. \n\n- System Protection \nDuring the installation program automatically configures the system to meet security requirements. \n\n- Appearance \nAll connected external devices are displayed in the dialog Antirun in tabs. This makes the device management easier and more convenient. \n\n- Removing the devices \nQuickly and safely remove the device can operate directly from the dialog menu or by opening Antirun retrieve by clicking on the icon in the tray Antirun.\n\n- Information on the amount of \nAt the bottom of the dialog box is displayed Antirun information on available and occupied volume on the disk. \n\n- Easily Copy \nCopy files and folders to an external device, you can simply drag and drop the objects you need for a dialogue Antirun. \n\n- Tray icon \nClick on the icon in the tray Antirun will safely remove the device menu. Double-click the dialog will show Antirun, a right click opens a context menu. \n\n- Automatic updates \nAntirun automatically notified of available updates, so you'll always have the most current version of the program. \n\n- Sophisticated Interface \nThe program interface is simple and intuitive. For a long time to understand not have even the novice user. \n\n- Office of the dialogue \nFor best results, keep in mind that double-clicking to open a dialogue Antirun drive, and click the right mouse button hides the dialog. \n\n- A minimum of resources \nAntirun uses minimum system resources and does not conflict with third-party antivirus programs. \n\nRelease: 13 Dec 2011\nOS: Windows XP / Vista / 7 \nLanguage: /b] English / Russian \nWebsite: http://antirun.net/","torrent":{"xt":"urn:btih:f02e6c9472ebc4ee8f5adc22424f5514bee37884","amp;dn":"AntiRun+2.4+Pro+Final%5BNepsterJay%5D.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f02e6c9472ebc4ee8f5adc22424f5514bee37884","infoHashBuffer":{"type":"Buffer","data":[240,46,108,148,114,235,196,238,143,90,220,34,66,79,85,20,190,227,120,132]},"announce":[],"urlList":[]}}