{"title":"BetterZip v. 2.1.1 pre[K]racked","uid":6722932,"size":7908054,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:f121c1bf92f55639d85ea20c79d503060854aa4a&amp;dn=BetterZip+v.+2.1.1+pre%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"polisdavid","files":-1,"time":1317846314,"description":"Official Web Site: &lt;a href=&quot; http://macitbetter.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://macitbetter.com/&lt;/a&gt;\n\nBetterZip lets you quickly inspect archives without first extracting their contents.\n\n* Extract Only Files You Really Need: If you only need a few files or\n  folders from a larger archive, you don't have to extract the whole thing.\n  Simply drag the files you need from the BetterZip window to any Finder\n  window or the desktop.\n\n* Open Archives Without Extracting: Not only can BetterZip open\n  archives without first extracting them but you can also search for a file\n  using the iTunes-like interface. BetterZip can open and extract archives \n  with the most common formats: ZIP, SIT, TAR, XAR, GZip, BZip2,\n  RAR, 7-Zip, CPIO, ARJ, LZH/LHA, JAR, WAR, CAB, ISO, CHM,\n  RPM, DEB, NSIS, BIN, HQX.\n\n* Create Archives: Simply drag files and folders from your hard drives, \n  disks, or network places into your new zip file. You no longer have to\n  copy all the files into a temporary folder first. The supported formats are\n  ZIP, TAR, GZip and BZip2 compressed TAR, XAR, 7-ZIP, and RAR\n  (using the external RAR commandline tool). Large archives can also be\n  split.\n\n* Protect Your Data: BetterZip can protect your data with a password and\n  create WinZip compatible AES-256 encrypted archives. 7-zip and rar\n  archives can also be protected.\n\n* Update Archives: Add new or updated files to existing archives.\n  Remove any file or folder from an archive, or even move files around\n  inside the archive as if it were a normal folder.\n\n* Make Archives Compatible: Strip Mac specific files and resource forks\n  from archives for best compatibility with systems like Windows or\n  Linux.\n\nWhat's New\n\nNew Features\n\n* Using the service 'Extract with BetterZip' you can now extract all\n  archives in a folder hierarchy.\n\n* If files are selected in the archive window, presets now only extract \n  those instead of all files. Hold down Shift to extract all anyway.\n\n* Enhanced 'replace existing files' dialog: it now allows to merge extracted\n  items into existing folders, keep both versions or replace the existing\n  version with the one from the archive.\n\nEnhancements\n\n* Enhanced accessibility.\n\n* Improved SIT file handling.\n\n* The favorites sidebar is now populated in the background and there is\n  no longer a delay when starting BetterZip.\n\n* Re-added 'Terminate after last window closed' option.\n\n* Enabled the additional parameters field for tar archives.\n\n* Holding down the option key now shows a save panel even for services\n  or direct extraction.\n\n* The location preset in the save panel is now by default next to original\n /archive.\n\nBug Fixes\n\n* Split size is now base 10 (1MB = 1,000,000 Bytes) like the rest of the\n  application.\n\n* Search field was invisible on Mac OS X 10.6 under certain conditions.\n\n* The English help was replaced by the French help.\n\n* Fixed the update mechanism. It will work again from now on.\n\n* Fixed a possible crash when creating previews.\n\n* Extracting all archives in a folder didn't work under certain conditions.\n\n* Some strings were not correctly translated in the French localization.\n\nSystem Requirements:\n\nIntel Mac OS version: Mac OS X 10.6 or later\n\n--- PLEASE SEED ---\n","torrent":{"xt":"urn:btih:f121c1bf92f55639d85ea20c79d503060854aa4a","amp;dn":"BetterZip+v.+2.1.1+pre%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f121c1bf92f55639d85ea20c79d503060854aa4a","infoHashBuffer":{"type":"Buffer","data":[241,33,193,191,146,245,86,57,216,94,162,12,121,213,3,6,8,84,170,74]},"announce":[],"urlList":[]}}