{"title":"Nine and One-Half Weeks [1986] Adrian Lyne","uid":6716334,"size":813144366,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f1cf2df04737e009256fa6d67d2a0887cb86bb63&amp;dn=Nine+and+One-Half+Weeks+%5B1986%5D+Adrian+Lyne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1317574755,"description":" &lt;a href=&quot;http://bayimg.com/aAkPCAaDE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/aAkPCAaDE&lt;/a&gt;\n\nNine 1/2 Weeks (1986) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0091635/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0091635/&lt;/a&gt;\n\n9Ã‚Â½ Weeks is a 1986 erotic drama film directed by Adrian Lyne and starring Mickey Rourke and Kim Basinger. It is based on the novel of the same name by Elizabeth McNeill.\n\n  Mickey Rourke  ...  John  \n  Kim Basinger  ...  Elizabeth  \n  Margaret Whitton  ...  Molly  \n  David Margulies  ...  Harvey  \n  Christine Baranski  ...  Thea  \n  Karen Young  ...  Sue  \n  William De Acutis  ...  Ted (as William DeAcutis)  \n  Dwight Weist  ...  Farnsworth  \n\nThe film was not a major success commercially in the United States, grossing only $7 million at the box office from a $17 million budget. In addition, it received mixed reviews. However, despite its only moderate success in North America, the film acquired a large fanbase on video and was a huge success internationally. The film is now well known for its erotic sadomasochistic content.\n\nThe film spawned two direct-to-video sequels, Another 9Ã‚Â½ Weeks (1997) and The First 9Ã‚Â½ Weeks (1998).\n\n9Ã‚Â½ Weeks has a mixed 62% rating on Rotten Tomatoes. Roger Ebert gave the film three and half stars, stating: &quot;A lot of the success of &quot;9Ã‚Â½ Weeks&quot; is because Rourke and Basinger make the characters and their relationship convincing&quot;. He further elaborated by saying that their relationship was believable, and unlike many other characters in other erotic films at that time, the characters in this movie are much more real and human.\n\nThe film was nominated for three categories in the 1986 Golden Raspberry Awards, Worst Actress (Kim Basinger), Worst Original Song (Jonathan Elias, John Taylor, Michael Des Barres), and Worst Screenplay (Patricia Louisianna Knop, Zalman King, Sarah Kernochan).\n\nThe main single released from the 9Ã‚Â½ Weeks: Original Motion Picture Soundtrack was &quot;I Do What I Do,&quot; performed by Duran Duran bassist John Taylor, giving his first solo singing performance during a hiatus in Duran Duran's career. The song reached #23 on the Billboard Hot 100 and #42 on the UK Singles Chart. Music for the score was composed by Taylor and Jonathan Elias. Original music for the movie was also written by Jack Nitzsche, but his compositions are not included on the soundtrack.\n\nThe soundtrack also included tracks from Luba, Bryan Ferry, Dalbello, Corey Hart, Joe Cocker, Devo, Eurythmics and Stewart Copeland. Winston Grennan's reggae &quot;Savior&quot; as well as Jean Michel Jarre's &quot;Arpegiator,&quot; played during the sex scene on the stairs in the rain, were not included on the record.\n\n","torrent":{"xt":"urn:btih:f1cf2df04737e009256fa6d67d2a0887cb86bb63","amp;dn":"Nine+and+One-Half+Weeks+%5B1986%5D+Adrian+Lyne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1cf2df04737e009256fa6d67d2a0887cb86bb63","infoHashBuffer":{"type":"Buffer","data":[241,207,45,240,71,55,224,9,37,111,166,214,125,42,8,135,203,134,187,99]},"announce":[],"urlList":[]}}