{"title":"SPEC OPS - The Line - GLOBE","uid":7398640,"size":3429896781,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f29961166ce6898fd1ff5986004ec6a814940769&amp;dn=SPEC+OPS+-+The+Line+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1340996324,"description":"Hi Pc gamers ...\n\nPlay the new Spec Ops game ...\n\n\nFILE INFO : the file have an executable to do an automatic extraction followed by starting the game , have too a created executable to run the game anytime from the front of the game folder not beeing necessary to go to the BinariesWin32 every time to run the game executable or creating a shortcut , the game folder have total portability around the computer . English only and no Multiplayer working .\n\n\n\n\n* Gameplay :\n \nThe Line is primarily a third-person shooter with emphasis on squad-based tactics. The player controls Captain Martin Walker, who is accompanied by a Delta Force team to rescue a U.S. Army Colonel Konrad, who remained behind in Dubai after contact with the city was lost. To accomplish this goal, players must traverse the city to neutralize enemy threats, braving natural disasters and hallucinations. As the player progresses, better weapons and equipment become available to accomplish goals more easily. Squad commands allow the player to direct their teammates to perform certain actions or move to certain areas.\n \nThe game focuses on the sandstorms of Dubai to provide dynamic terrain changing during gameplay, similar to Fracture and the Red Faction series. This is supported by an unpredictable engine that randomizes when and where sandstorms will arise, as well as how harsh they will be. Sandstorms may open or close paths to the players as well as turn advantages in a firefight.\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012\n","torrent":{"xt":"urn:btih:f29961166ce6898fd1ff5986004ec6a814940769","amp;dn":"SPEC+OPS+-+The+Line+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f29961166ce6898fd1ff5986004ec6a814940769","infoHashBuffer":{"type":"Buffer","data":[242,153,97,22,108,230,137,143,209,255,89,134,0,78,198,168,20,148,7,105]},"announce":[],"urlList":[]}}