{"title":"Rebecca Nelson - Pure Imagination (2011)","uid":6767301,"size":100680355,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f42f7683bf02f64ad56c1577c5543f3cb04807e2&amp;dn=Rebecca+Nelson+-+Pure+Imagination+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"piratetorrent1989","files":-1,"time":1319447336,"description":"Stunning 23 year old Rebecca Nelson has (literally) travelled across the world in pursuit of her dream to become an International Classical Crossover Artist. New Zealand born and bred, Rebecca journeyed to Ireland in mid 2009 and began making waves beyond her wildest expectations. Upon arrival in Ireland she immediately felt 'at home' but had to come up with a plan to further her musical career and to simply survive. She decided to follow in the footsteps of famous Irish 'buskers' and headed to Grafton Street. In a very short time frame she began to attract major crowds to her daily street performances and was inundated with requests to perform at various events around the country. The most exciting opportunity came in June 2010 when she was asked to go on tour around Ireland with The Priests as their Guest Soloist. Rebecca returned home to Christchurch New Zealand at the end of 2010 where she was asked to tour with Will Martin the youngest man in history to top the UK Classical Charts on this 2011 South Island Tour. After the devastating earthquake in February 2011 in her home town of Christchurch, Rebecca relocated to Nelson where once again she took to the streets. There she was approached by a reporter and within a couple of days featured on the front page of the Nelson Mail and the home page of stuff.co.nz. From this Rebecca was able to secure the backing she needed to release her 2011 Debut Album &quot;Pure Imagination&quot;. This is a young lady with the voice, stunning looks, personality and determination to go all the way in her chosen field of entertainment.\n\n256kbps m4a\n\n1. If I Loved You\n2. Dreamer\n3. Panis Angelicus\n4. Till There Was You\n5. Pure Imagination\n6. Lovely Lonely Man\n7. Better Be Home Soon\n8. Some Enchanted Evening\n9. Ave Maria\n10. No One But You\n11. Hushabye Mountain\n12. Somewhere Over the Rainbow","torrent":{"xt":"urn:btih:f42f7683bf02f64ad56c1577c5543f3cb04807e2","amp;dn":"Rebecca+Nelson+-+Pure+Imagination+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f42f7683bf02f64ad56c1577c5543f3cb04807e2","infoHashBuffer":{"type":"Buffer","data":[244,47,118,131,191,2,246,74,213,108,21,119,197,84,63,60,176,72,7,226]},"announce":[],"urlList":[]}}