{"title":"DC.Seekers.of.the.Lost.Treasure.3of4.The.Curse.of.the.Elgin.Marb","uid":6787791,"size":854951936,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f4976a6055f8710122ae016577cf871f0386886c&amp;dn=DC.Seekers.of.the.Lost.Treasure.3of4.The.Curse.of.the.Elgin.Marb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DocFreak08","files":-1,"time":1320163073,"description":"Award-winning series following the stories of the world's greatest archaeological adventurers. This mini-series profiles the perils, struggles and triumphs of four of history's treasure seekers. In glass cases and dusty corners of great international museums of North America and Europe, thousands of their priceless relics &amp; treasures are displayed. All are fascinating in their own right for what they tell us of lost tribes, lost cultures, even lost civilizations. But the real stories are rarely told--the blood-stirring adventures of the travelers who braved swamp fever, cannibals, sandstorms &amp; other perils to capture the treasures. Michael Rockefeller; Lord Elgin; Giovanni Belzoni; and Edward Thompson were all men of guile &amp; daring in the tradition of Indiana Jones. They travelled to the ends of the Earth in search of archeological riches of ancient and exotic cultures. Includes staged re-enactments, interviews, personal journal accounts, original film footage and unpublished photography.\n\nNarrated by Jeremy Irons\nSeries Producer : Anthony Geffen\n\nProduced by Atlantic Productions for the Discovery Channel\n\nDiscovery Communications Inc. (1995)\n\n\n\n\nEpisode 2 : The Curse of the Elgin Marbles\n\nIn 1803, more than 200 pieces of marble statues and friezes, considered to be among the highest expressions of classical civilization, were removed from the ancient Parthenon in Athens and taken to England. The feat was the work of Scottish Lord Thomas Elgin, British Ambassador to Constantinople, in his attempt to rescue the pieces from certain devastation by Turkish troops. Instead of accolades for his accomplishment, Elgin met with imprisonment, bankruptcy and the loss of his wife. Even the marble he had tried to preserve became a subject of intense controversy, prompting poet Lord Byron to allegedly write, &quot;What the Goths spared, the Scots destroyed.&quot;\n\n\n\nTechnical Specs\n----------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2076 kbps\nVideo Resolution: 608x368\nVideo Aspect Ratio: 1.652:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 50:05.880\nNumber Of Parts: 4\nPart Size: 815 MB\nRipped by: DocFreak08\t","torrent":{"xt":"urn:btih:f4976a6055f8710122ae016577cf871f0386886c","amp;dn":"DC.Seekers.of.the.Lost.Treasure.3of4.The.Curse.of.the.Elgin.Marb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4976a6055f8710122ae016577cf871f0386886c","infoHashBuffer":{"type":"Buffer","data":[244,151,106,96,85,248,113,1,34,174,1,101,119,207,135,31,3,134,136,108]},"announce":[],"urlList":[]}}