{"title":"Dog Pound 2010.divx","uid":6837759,"size":484294246,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f55fef491299e3688d88b023886733ecc6e20751&amp;dn=Dog+Pound+2010.divx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TUXtorrent","files":1,"time":1322064499,"description":"Dog Pound (2010)\n\n 91 min  -  Drama\n\nPlot\n \nThe movie chronicles the fictional experiences of several youths during their stay in a youth detention center. During which the several young men experience more feelings of rebellion and mistreatment then if they were left out of the detention center. It is more like a learning camp for the real rules of an actual jail. One of the boys 'Davis' is the pretty boy who is uncomfortable and afraid of the more dominant boys of the detention center and ends up befriending Butch, who has anger issues and is therefore made the not the be reckoned with attitude, alpha male and ends up putting all boys that abused his friend Davis, in the down played, vengeful state because he has made it clear that he is in charge now. Davis ends up getting raped while Butch is in the hole and when he finds out what has happened he is more then ever out of control of his emotions and ends up sending the whole detention center into a riot, of which the detention officers have to use physical violence and are forced to bring in a S.W.A.T team to handle the unarmed, blind with anger youths. But the main reason leading up to all of the young men there being angry and starting the riot, is that the most experienced officer in charge of them ends up accidentally killing one of Butch's other close friends 'Angel' because of a painting he made while doing one of the jobs assigned to the four boys makes a joke out of it. while Goodyear the detention officer is having family problems, and takes his anger out on the youth. Butch freaks out and is wrongfully put into the hole. Once he gets out is when the climax of the movies really reaches its point.\n","torrent":{"xt":"urn:btih:f55fef491299e3688d88b023886733ecc6e20751","amp;dn":"Dog+Pound+2010.divx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f55fef491299e3688d88b023886733ecc6e20751","infoHashBuffer":{"type":"Buffer","data":[245,95,239,73,18,153,227,104,141,136,176,35,136,103,51,236,198,226,7,81]},"announce":[],"urlList":[]}}