{"title":"TresPass (2011)(IPOD)","uid":6757727,"size":361557099,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:f63447c0de7bbc474d4f276fc445edf3ad4120f5&amp;dn=TresPass+%282011%29%28IPOD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bog23man","files":-1,"time":1319103377,"description":"As they're held for ransom, a husband and wife's predicament grows more dire amid the discovery of betrayal and deception\n\nUser Review\n\nI didn't know what to expect from this film as I didn't see any trailer or any promotional stuff . The beginning of the movie was slow but got interesting when came along. You could tell something was going to happen\n\nThe story starts easy, but as it moves on, peculiar things start to happen. This movie keeps you guessing in such a way, you are riveted to your seat, hoping for a quick resolution to the terror. Although the story is very simplistic and nothing original, the film still manages to grab the viewer. It has flawless lighting and camera work, great acting and a truly disturbing psychological intensity.\n\nThe violence is extremely brutal and unrelenting. The bloody realism may cause some viewers to turn their head. The film becomes more insane from this point on turning into a endless pursuit of cat and mouse. Some people may complain that the film contains certain plot holes. I felt that by director leaving certain things unexplained until the very end, it added to the intensity. Very suspenseful and horrifying\n\nTrespass truly is a Love-Hate Movie. It's a ground breaking, brave, stunning, brutal &amp; moving piece of work that is guaranteed to divide audiences everywhere , the audience reaction ranged from 'loved it' to 'hated it' to few people actually going outside of the cinema .For me it was a great work, and i absolutely loved it but I don't believe it's a movie that anybody will truly 'enjoy\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1674784/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1674784/&lt;/a&gt;","torrent":{"xt":"urn:btih:f63447c0de7bbc474d4f276fc445edf3ad4120f5","amp;dn":"TresPass+%282011%29%28IPOD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f63447c0de7bbc474d4f276fc445edf3ad4120f5","infoHashBuffer":{"type":"Buffer","data":[246,52,71,192,222,123,188,71,77,79,39,111,196,69,237,243,173,65,32,245]},"announce":[],"urlList":[]}}