{"title":"Kaipa - In the wake of evolution 2010","uid":6720410,"size":511987193,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f649388987fb7224b08e2165fc32a5a42bfd3dc5&amp;dn=Kaipa+-+In+the+wake+of+evolution+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"barber9","files":-1,"time":1317767297,"description":"I think most prog fans would travel great distances barefoot over stony ground to hear music like this and there are many, many bands I can think of who would doubtless give their eye teeth to create something as lavish and sumptuous as In The Wake of Evolution. The album opener (and title track) alone is worth the cost of purchase. It's jaw-dropping, eyes full of wonder, joyous listening. It gambols into life through a bouncing, trilling overture in 11/8, a time signature that declaims, Oh, this must be prog! This comes to an abrupt halt and Aleena begins the heartfelt and impassioned vocal, a melody I cannot get out of my head. Each verse has its own cadence that develops via the accumulation of doleful strings, weeping in descending arcs then a chopping and funky clavichord that lifts the melody out of the doldrums in a way that makes me want to applaud as the track ascends into its closing theme using melodies and harmonies that recall Fragile-era Yes with Jon Anderson and Chris Squire at their best. Structurally and musically this is extremely clever stuff, the leitmotif of the overture is twisted, tilted, deconstructed and remixed in four different ways, at least. The musicianship is stellar. Per Nilsson sends a resounding signal about the multitude of tones and playing styles he is going to employ over the course of these eight tracks. In the opening alone he uses at least four different amp set-ups to effect his sound, introducing a new tone at each reiteration and development of the theme. Interspersing the sung sections he zips through four solos varying hammering and sweeping arpeggios with Steve Hackett-like sustained wailing and Robert Fripp-esque sonic soundshapes. Jonas Reingold's bass pops and stabs, rolls, hops, skips and runs through the phases of the song underpinned by Morgan Agren's drumming that drives the whole piece to its emphatic and dramatic conclusion with a host of polyrhythms and syncopated figures. Awesome, awesome, awesome. (dprp.net)\n\n- - -\n\nKaipa - In the wake of evolution  2010\n(Kleve Inside Out)\n\n1. In the wake of evolution \n2. In the heart of her own magic field \n3. Electric power water notes \n4. Folkia's first decision \n5. The words are like leaves \n6. Arcs of sound \n7. Smoke from a secret source  \n8. The seven oceans of our mind\n\n\nMusicians\nHans Lundin, electric and acoustic keyboards, vocals\nPer Nilsson, electric and acoustic guitars\nMorgan Agren, drums\nJonas Reingold, electric basses\nPatrik LundstrÃƒÂ¶m, vocals\nAleena Gibson, vocals\nFredrik Lindqvist, recorders (track 2, 3, 4, 5 &amp; 8)\nElin Rubinsztein, violin (track 1, 4, 5 &amp; 7)\n\nGeneral information:\nAll songs written by Hans Lundin\nProduced by Hans Lundin 2008 - 2009\nRecorded by Hans Lundin at HGL Studio Uppsala Sweden\nGuitars recorded by Per Nilsson at Studio Kabyss Sandviken Sweden\nDrums recorded by Hans Lundin &amp; Morgan Agren \nat Annanstans VÃƒÂ¤rmdÃƒÂ¶ Sweden\nBasses recorded by Jonas Reingold at Reingold Studio Lund Sweden\nMixed by Hans Lundin at HGL Studio 2009\nFinal mixed and mastered by Martin IgelstrÃƒÂ¶m \nat MI Sound Design Uppsala Sweden 2010\n","torrent":{"xt":"urn:btih:f649388987fb7224b08e2165fc32a5a42bfd3dc5","amp;dn":"Kaipa+-+In+the+wake+of+evolution+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f649388987fb7224b08e2165fc32a5a42bfd3dc5","infoHashBuffer":{"type":"Buffer","data":[246,73,56,137,135,251,114,36,176,142,33,101,252,50,165,164,43,253,61,197]},"announce":[],"urlList":[]}}