{"title":"Encyclopedia of Language and Education(10 vols)2nd Ed{BBS}","uid":6768602,"size":27425068,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f77a0de4a926a95e2754e3a6b70079e571dcf693&amp;dn=Encyclopedia+of+Language+and+Education%2810+vols%292nd+Ed%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1319491518,"description":"In 1997, the Encyclopedia of Language and Education was published as an award-winning collection of eight volumes, under the general editorship of David Corson. This reference set signaled the maturity of language and education as an international and interdisciplinary field of significance and cohesion. Now in a second, fully revised edition, this 10 volume set of the Encyclopedia of Language and Education brings forth the newest developments in the field, including two new volumes of research and scholarly content essential to the field of language teaching and learning in the age of globalization. The publication of this work charts the deepening and broadening of the field of language and education since the publication of the first Encyclopedia\n\nIn the selection of topics and contributors, the Encyclopedia reflects the depth of disciplinary knowledge, breadth of interdisciplinary perspective, and diversity of sociogeographic experience in our field. Volumes on language socialization and language ecology have been added, reflecting these growing emphases in language education theory, research and practice, alongside the enduring emphases on language policy, literacies, discourse, language acquisition, bilingual education, knowledge about language, language testing, and research methods. Throughout all the volumes, there is a greater inclusion of scholarly contributions from non-English speaking and non-western parts of the world, providing truly global coverage of the issues in the field. Furthermore, we have sought to integrate these voices more fully into the whole, rather than as special cases or international perspectives in separate sections.\n\nThe Encyclopedia is a necessary reference set for every university and college library in the world that serves a faculty or school of education. The Encyclopedia aims to speak to a prospective readership that is multinational, and to do so as unambiguously as possible. Because each book-size volume deals with a discrete and important subject in language and education, these state-of-the-art volumes also offer highly authoritative course textbooks in the areas suggested by their titles.\n\nThe more than 250 scholars contributing to the Encyclopedia hail from all continents of our globe and from 41 countries; they represent a great diversity of linguistic, cultural, and disciplinary traditions. For all that, what is most impressive about the contributions gathered here is the unity of purpose and outlook they express with regard to the central role of language as both vehicle and mediator of educational processes and to the need for continued and deepening research into the limits and possibilities that implies.\n\nVolume 1: Language Policy and Political Issues in Education\nStephen May and Nancy H. Hornberger\n\nVolume 2: Literacy\nBrian Street and Nancy H. Hornberger\n\nVolume 3: Discourse and Education\nMarilyn Martin-Jones, Anne-Marie de Mejia, and Nancy H. Hornberger\n\nVolume 4: Second and Foreign Language Education\nNelleke Van Deusen-Scholl and Nancy H. Hornberger\n\nVolume 5: Bilingual Education\nJim Cummins and Nancy H. Hornberger\n\nVolume 6: Knowledge About Language\nJasone Cenoz and Nancy H. Hornberger\n\nVolume 7: Language Testing and Assessment\nElana Shohamy and Nancy H. Hornberger\n\nVolume 8: Language Socialization\nPatricia Duff and Nancy H. Hornberger\n\nVolume 9: Ecology of Language\nAngela Creese, Peter Martin, and Nancy H. Hornberger\n\nVolume 10: Research Methods in Language and Education\nKendall A. King and Nancy H. Hornberger\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 3881 pages\n    * Publisher: Springer; 2nd edition (December 7, 2007)\n    * Language: English\n    * ISBN-10: 0387328750\n    * ISBN-13: 978-0387328751","torrent":{"xt":"urn:btih:f77a0de4a926a95e2754e3a6b70079e571dcf693","amp;dn":"Encyclopedia+of+Language+and+Education%2810+vols%292nd+Ed%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f77a0de4a926a95e2754e3a6b70079e571dcf693","infoHashBuffer":{"type":"Buffer","data":[247,122,13,228,169,38,169,94,39,84,227,166,183,0,121,229,113,220,246,147]},"announce":[],"urlList":[]}}