{"title":"Futurama Season 1 MKV 89mb/ep","uid":6691240,"size":1216440590,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f89333fee276d25a950e8ae8c17f384a00abf115&amp;dn=Futurama+Season+1+MKV+89mb%2Fep&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"geofreygachie","files":13,"time":1316594274,"description":"Futurama is an American animated science fiction sitcom created by Matt Groening and developed by Groening and David X. Cohen for the Fox Broadcasting Company. The series follows the adventures of a late 20th-century New York City pizza delivery boy, Philip J. Fry, who, after being unwittingly cryogenically frozen for one thousand years, finds employment at Planet Express, an interplanetary delivery company in the retro-futuristic 31st century. The series was envisioned by Groening in the 1990s while working on The Simpsons, later bringing Cohen aboard to develop storylines and characters to pitch the show to Fox.\n\nIn the United States, the series aired on Fox from March 28, 1999 to August 10, 2003 before ceasing production. Futurama was then aired in reruns on Cartoon Network's Adult Swim from January 1, 2002 to December 31, 2007, until the network's contract expired. It was revived in 2007 as four straight-to-DVD films; the last of the four was released in early 2009. Comedy Central entered into an agreement with 20th Century Fox Television to syndicate the existing episodes and air the films as 16 new, half-hour episodes.[1][2]\n\nComedy Central began airing Futurama on January 2, 2008, with new episodes starting on March 23, 2008.[3] In June 2009, producing studio 20th Century Fox announced that Comedy Central had picked up the show for 26 new half-hour episodes, of which the first half began airing from June 24, 2010. The remaining thirteen episodes began airing on June 23, 2011.[4] In March 2011, it was announced that Futurama has been renewed for a seventh season, consisting of at least 26 episodes, scheduled to air in 2012 and 2013.[5][6]\n\nThroughout its run, Futurama has consistently received high critical acclaim, culminating in a Guinness World Record for &quot;Current Most Critically Acclaimed Animated Series&quot; in 2010.[7][8] Futurama has also been nominated for 17 Annie Awards and 10 Emmy Awards, winning seven and five, respectively. Futurama has also been nominated four times for a Writers Guild of America Award, winning two for the episodes &quot;Godfellas&quot; and &quot;The Prisoner of Benda&quot;, and nominated for a Nebula Award. The show also received an Environmental Media Award for &quot;The Problem With Popplers&quot;.\n\nFuturama-related merchandise has also been released, including: a tie-in comic book series and video game, calendars, clothes, and figurines","torrent":{"xt":"urn:btih:f89333fee276d25a950e8ae8c17f384a00abf115","amp;dn":"Futurama+Season+1+MKV+89mb%2Fep","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f89333fee276d25a950e8ae8c17f384a00abf115","infoHashBuffer":{"type":"Buffer","data":[248,147,51,254,226,118,210,90,149,14,138,232,193,127,56,74,0,171,241,21]},"announce":[],"urlList":[]}}