{"title":"Dance Central 2 TeamXLive RF","uid":6784375,"size":7838696341,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:f8ffeec2c93c01cacc260cda8a3124f3adf80049&amp;dn=Dance+Central+2+TeamXLive+RF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":".BONE.","files":9,"time":1320035016,"description":"XDG2 FORMAT XDG2 FORMAT\n(Note)\nif you have the lastes IMG Burn you dont need these steps all you do is make sure Trancate is check and you should be all set enjoy.\n\nTeamXLive Brings you Dragonball Z Ultimate Tenkaichi\nCHECK Includes\n* Region Free\n* WAVE 13\n* AP2.5\n* SSv2\n* DashBoard v2.0.13599.0\n* XGD2 + LT 2.0\n* LAYERBREAK: 1913760\n\n\nGet ready for the best-selling dance game on Kinect! With another killer soundtrack, the best routines and all-new multiplayer features, Dance Central 2 is sure to get your party started!\n\nIt's Party Time! Team up with your friends to dance collaboratively with all-new simultaneous multiplayer features. Players can drop in or out at any point during a song, so the party never has to stop!\nPump up the Volume! Dance Central 2 features an unparalleled soundtrack of more than 40 new dance hits and classics. The new, fully integrated in-game Music Store will allow players to expand their song library by importing their Dance Central song list for Dance Central 2 , bringing the number of songs available at launch to more than 100 tracks!*\nKick it with the Crews! Dance Central 2 features a variety of new characters and fan favorites paired up as dance crews, each with custom outfits, backup dancers and signature venues.\nAs Real as It Gets. Dance Central 2 provides detailed feedback for each player and, for the first time, enables voice commands within the practice process!","torrent":{"xt":"urn:btih:f8ffeec2c93c01cacc260cda8a3124f3adf80049","amp;dn":"Dance+Central+2+TeamXLive+RF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8ffeec2c93c01cacc260cda8a3124f3adf80049","infoHashBuffer":{"type":"Buffer","data":[248,255,238,194,201,60,1,202,204,38,12,218,138,49,36,243,173,248,0,73]},"announce":[],"urlList":[]}}