{"title":"The Lord Peter Wimsey Short Story Collection","uid":6692333,"size":381817145,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f94e1a5005caf4b21e779bbf9655ee56e46789a4&amp;dn=The+Lord+Peter+Wimsey+Short+Story+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"neil1966hardy","files":19,"time":1316640651,"description":"Lord Peter Wimsey Short Stories\nby Dorothy L Sayers\nread by Ian Carmichael\n44.1 kHz / 64kbps\n\nLet me say first that the image above is a mock-up. Just a bit of fun. If you know how the short stories were released you'll get it. For the rest of you an explanation follows -\nThe Wimsey shorts were released in 4 different collections (Lord Peter Views the Body, Hangman's Holiday, In the Teeth of the Evidence and finally Striding Folly) in their original book (as in paper) form. Later on a collection titled 'Lord Peter' was released which gathered all the short stories of Wimsey together in one volume.\nNow on to the audio books. The 4 original collections have been released as audiobooks. I've never come across an audiobook of the Lord Peter collection though. You might say well, there's no need for it as all the stories have appeared in the 4 original audiobooks but given the way some titles are repackaged over and over I'm still surprised.\nSo in essence you could say this torrent is an audiobook version of the 'Lord Peter' collection. As I like to put a graphic in my torrent descriptions I made the mock-up image of Lord Peter. That's as far as it goes though. I haven't used it for the tags.\n\nThere is actually a proper reason for this torrent. I personally wanted the short stories as one mp3 for each story. It's time to thank the guy we all know and love on Demonoid - Peterg23. My whole Wimsey collection comes from him and it's he's rips that I used to put this collection together. Here's a link to the torrent:\n\nHe's mp3s of the 4 short story collections come titled with the book title followed by the part number. I will add that if you're like me and prefer having the 4 audiobooks as one mp3 for each story like presented in this torrent then remember that 2 of the 4 audiobooks (Hangman's Holiday and In the Teeth of the Evidence) include some other non-Wimsey stories (Montague Egg is a character in some of them) and you'll need Peterg23's versions to get/keep those.\nLastly I'll add that no mp3s were harmed in the making of this collection. (there was no mp3 decoding during the editing.)\n\nHere's a list of the stories/mp3s in the torrent:\n\nLORD PETER VIEWS THE BODY\n&quot;The Abominable History of the Man with Copper Fingers&quot;\n&quot;The Fantastic Horror of the Cat in the Bag&quot;\n&quot;The Unprincipled Affair of the Practical Joker&quot;\n&quot;The Undignified Melodrama of the Bone of Contention&quot;\n&quot;The Vindictive Story of the Footsteps That Ran&quot;\n&quot;The Bibulous Business of a Matter of Taste&quot;\n&quot;The Piscatorial Farce of the Stolen Stomach&quot;\n&quot;The Unsolved Puzzle of the Man with No Face&quot;\n&quot;The Adventurous Exploit of the Cave of Ali Baba&quot;\n\nHANGMAN'S HOLIDAY\n&quot;The Image in the Mirror&quot;\n&quot;The Incredible Elopement of Lord Peter Wimsey&quot;\n&quot;The Queen's Square&quot;\n&quot;The Necklace of Pearls&quot;\n\nIN THE TEETH OF THE EVIDENCE\n&quot;In the Teeth of the Evidence&quot;\n&quot;Absolutely Elsewhere&quot;\n\nSTRIDING FOLLY\n&quot;Striding Folly&quot;\n&quot;The Haunted Policeman&quot;\n&quot;Talboys&quot;\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f94e1a5005caf4b21e779bbf9655ee56e46789a4","amp;dn":"The+Lord+Peter+Wimsey+Short+Story+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f94e1a5005caf4b21e779bbf9655ee56e46789a4","infoHashBuffer":{"type":"Buffer","data":[249,78,26,80,5,202,244,178,30,119,155,191,150,85,238,86,228,103,137,164]},"announce":[],"urlList":[]}}