{"title":"Carrier IQ dump","uid":6843702,"size":22281563,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f975b4013bb4418b69df6a1aa64879392e9b470e&amp;dn=Carrier+IQ+dump&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"saasaakoo","files":1,"time":1322287206,"description":"What is Carrier IQ?\nWritten by Trevor Eckhart\n\nCarrier IQ (CIQ) sells rootkit software included on many US handsets sold on Sprint, Verizon and more.  Devices supported include android phones, Blackberries, Nokias, Tablet devices and more.\n\nFrom carrieriq.com:\n\nCarrier IQ is the market leader in Mobile Service Intelligence solutions that have revolutionized the way mobile operators and device vendors gather and manage information from end users.\n\nRecognizing the phone as an integral part of a mobile service delivery, and using the device to measure key parameters of service quality and usage, the Carrier IQ solution gives you the unique ability to analyze in detail usage scenarios and fault conditions by type, location, application and network performance while providing you with a detailed insight into the mobile experience as delivered at the handset rather than simply the state of the network components carrying it.\n\nFrom &lt;a href=&quot; http://www.bgr.com/2011/09/01/htc-sensation-and-evo-3d-revealed-to-be-spying-on-users/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.bgr.com/2011/09/01/htc-sensation-and-evo-3d-revealed-to-be-spying-on-users/&lt;/a&gt;\n\nCarrier IQ is used to understand what problems customers are having with our network or devices so we can take action to improve service quality.\n\nIt collects enough information to understand the customer experience with devices on our network and how to devise solutions to use and connection problems. We do not and cannot look at the contents of messages, photos, videos, etc., using this tool\n\nGreat! Less dropped calls, better network experience.  It sounds good on the surface.  I was also able to obtain a stock copy of carrier IQ before it gets modified by third parties, and it has surveys users can fill out if they get a dropped call, browser ends unexpectedly, etc.  It makes its presence known by putting a checkmark in the status bar. This could potentially be pretty useful information from a network administration standpoint, and is made clear to users its running.  Unfortunately this is not always the real world case, it can be modified to be completely hidden.","torrent":{"xt":"urn:btih:f975b4013bb4418b69df6a1aa64879392e9b470e","amp;dn":"Carrier+IQ+dump","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f975b4013bb4418b69df6a1aa64879392e9b470e","infoHashBuffer":{"type":"Buffer","data":[249,117,180,1,59,180,65,139,105,223,106,26,166,72,121,57,46,155,71,14]},"announce":[],"urlList":[]}}