{"title":"Airworthiness:An Introduction to Aircraft Certification,2nd Ed{B","uid":6838399,"size":3150702,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9eb7311a25296aa54fd7337af21a41dc6515758&amp;dn=Airworthiness%3AAn+Introduction+to+Aircraft+Certification%2C2nd+Ed%7BB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1322084620,"description":"Understanding airworthiness is central to maintaining and operating aircraft safely. While no book can replace the published Federal Aviation Regulation and Joint Aviation Requirements documentation for airworthiness, this unique guide provides readers with a single reference to understanding and interpreting the airworthiness requirements of the International Civil Aviation Organisation, the US Federal Aviation Administration and the European Aviation Safety Agency.\n\nSetting these requirements in a real-world context, Airworthiness is an essential contribution to the safety management system of anyone involved in the design, maintenance and operation of aircraft for business or pleasure.\n\nKey topics covered include:\n\n    * Considerations of airworthiness standards for all classes, including large and small aircraft, rotor craft, gliders and unmanned aircraft\n    * Type certification of aircraft, engines, and propellers and the type certification process\n    * Parts and appliances approval\n    * Joint certifications and national certifications\n\nNew to this edition is coverage of:\n\n    * Certification for unmanned aircraft systems (UAS)\n    * The new EASA standards procedures and documentation\n    * 'Spaceworthiness' with relation to recent developments in commercial space travel\n\n\n    * The only airworthiness guide available-a unique single reference covering the requirements of the ICAO (International Civil Aviation Organisation), FAA (the US Federal Aviation Administration) and EASA (European Aviation Safety Agency)\n\n    * Demystifies the relevant European and US regulations and helps anyone involved in the manufacture, flying and maintenance of aircraft to understand this complex yet essential topic\n\n    * Now with companion website featuring links to pertinent sources for ease of reference and updates to the book as required, ensuring you have the most up-to-date information at your finger tips\n\n\n# Hardcover: 368 pages\n# Publisher: Butterworth-Heinemann; 2 edition (January 4, 2011)\n# Language: English\n# ISBN-10: 0080968023\n# ISBN-13: 978-0080968025","torrent":{"xt":"urn:btih:f9eb7311a25296aa54fd7337af21a41dc6515758","amp;dn":"Airworthiness%3AAn+Introduction+to+Aircraft+Certification%2C2nd+Ed%7BB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9eb7311a25296aa54fd7337af21a41dc6515758","infoHashBuffer":{"type":"Buffer","data":[249,235,115,17,162,82,150,170,84,253,115,55,175,33,164,29,198,81,87,88]},"announce":[],"urlList":[]}}