{"title":"Worms.Ultimate.Mayhem-SKIDROW+crackfix","uid":6709175,"size":1177375201,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fa252544e7f8a64c08947b1795cc553d85223e4a&amp;dn=Worms.Ultimate.Mayhem-SKIDROW%2Bcrackfix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DjAligator14","files":8,"time":1317288617,"description":"S  K  I  D  R  O  W\n .the leading force.\n\n proudly presents\n Worms: Ultimate Mayhem (c) Team17\n\n 28-09-2011........Release Date - Protection...............Steam\n Action...............Game Type - Disk(s)..................1 DVD\n\n RELEASE NOTES\n\n Worms: Ultimate Mayhem is the definitive 3D \\&quot;Worms\\&quot; game Load your\n weapons and experience a whole new dimension in destructive turn-based\n cartoon action Taking the game into 3D creates all-new strategic and\n gameplay possibilities. With over 70 single-player missions and\n challenges, online and local multi-player for up to 4 players, 5\n multi-player modes, Steam Achievements, unprecedented customization of\n both worms and weapons, and fully destructible environments, it\\'s\n bursting with anarchic mayhem. Battle and puzzle your way through all\n of the missions from both \\&quot;Worms 3D\\&quot; and \\&quot;Worms 4: Mayhem\\&quot; - it\\'s\n essentially two games in one. With the addition of HD visuals, gameplay\n enhancements and new extra content, it is the ultimate 3D \\&quot;Worms\\&quot;\n collection\n\n Features\n\n EXTENSIVE SINGLE-PLAYER CONTENT:\n A vast array of single-player content spanning the very best of the 3D\n \\&quot;Worms\\&quot; games, ranging from shooting challenges to speed runs, whilst a\n collection of crazy missions, interspersed with newly fully voiced\n narrative FMV sequences, make up the single-player campaign.\n Additionally, a huge number of challenges ask the player to master the\n individual skills of the game (such as piloting a Jetpack or steering a\n Parachute) in order to complete tasks such as target shooting or\n collecting targets, all against the clock.\n\n ONLINE AND LOCAL MULTI-PLAYER:\n Full online play for up to 4 players over a wealth of game modes such\n as \\&quot;Statue Defend\\&quot;, \\&quot;Homelands\\&quot; or just plain \\&quot;Deathmatch\\&quot;, plus the\n ability to create your own custom game settings to play against your\n friends Because of the turn-based nature of the game, it can be played\n multi-player offline on one screen.\n\n Fight on the randomly generated landscapes, even save and share them,\n which allows for a huge amount of multi-player map options\n\n GET COMPETITIVE:\n Play standard or ranked games in a bid to scale the Steam Leaderboards\n\n MASSIVE CUSTOMIZATION OPTIONS:\n\n Players are able to name their teams, choose which hats they want their\n worms to wear, whether they wear glasses, have moustaches, what they\n say, which flag represents them, and even what gravestone they leave\n behind when they die.\n\n WORMS WEAPONS AND UTILITIES:\n Many of the classic Worms weapons are present and correct, with the\n Holy Hand Grenade, Bazooka, Dynamite, Banana Bomb, Baseball Bat, Super\n Sheep and many more in your arsenal of destruction.\n\n There is also a sprinkling of even more crazy and surreal weapons too,\n such as Alien Abduction, Fatkins Strike, Flood, Inflatable Scouser,\n Old Woman, Starburst and Bovine Blitz with which to wage war on your\n enemies.\n\n CUSTOM BUILT WEAPONRY:\n Players are also able to construct their own weapons from a wide\n selection of components. These weapons are added to the players\n arsenals and remain secret until deployed, giving opponents a nasty\n shock.\n\n TALK TRASH:\n In-game voice-chat so you can cheer on team mates or indeed win the\n battle against opponents verbally\n\n FULLY DESTRUCTIBLE ENVIRONMENTS:\n Deform everything in real-time.\n\n NEW PICTURE-IN-PICTURE DISPLAY:\n This tracks every action a player makes when attacking, whilst at the\n same time allowing the player to retreat and not miss a single moment\n of the glorious action.\n\n NUMEROUS GAMEPLAY IMPROVEMENTS &amp; ENHANCEMENTS\n New camera enhancements make it easier to follow the action optimized\n AI means more intelligent enemies, and the addition of speech and\n lip-synching to the single-player missions makes for even more\n cinematic fun\n\n New visual improvements, with dynamic real time lighting and post\n process effects and shaders, make the mayhem look even more impressive.\n\n INSTALL NOTES\n\n 1. Unpack the release\n 2. Mount or burn image\n 3. Install\n 4. Copy all files from the SKIDROW folder to the game installation\n 5. Play the game\n 6. Support the companies, which software you actually enjoy\n\n GREETINGS\n\n To all friends of the family and honorable rival groups\n\n ascii art by the\n godlike &amp; terrific duo\n malodix  irokos\n titan artdivision","torrent":{"xt":"urn:btih:fa252544e7f8a64c08947b1795cc553d85223e4a","amp;dn":"Worms.Ultimate.Mayhem-SKIDROW%2Bcrackfix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa252544e7f8a64c08947b1795cc553d85223e4a","infoHashBuffer":{"type":"Buffer","data":[250,37,37,68,231,248,166,76,8,148,123,23,149,204,85,61,133,34,62,74]},"announce":[],"urlList":[]}}