{"title":"Marcus Miller - Live &amp; More 1998-trother","uid":6745782,"size":70264164,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fc4a84d23fb5840de8386700f8296271d926a241&amp;dn=Marcus+Miller+-+Live+%26amp%3B+More+1998-trother&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"trother","files":-1,"time":1318638535,"description":"            @@                       @@     @@\n           @@@                      @@@    @@@\n          @@@@@@  @@@@@    @@@@@   @@@@@@ @@@        @@@@@    @@@@@\n          @@@@@  @@@@@@@  @@@ @@@  @@@@@  @@@       @@@ @@@  @@@@@@@\n           @@@   @@@  !@ @@@   @@@  @@@   @@@@@@   @@@   @@@ @@@  !@\n           @@@   @@@     @@@   @@@  @@@   @@@@@@@  @@@   @@@ @@@\n           @!@   @!@     @!@   @!@  @!@   @!@  @!@ @!@@ @!@  @!@\n           !!@   !!@     !!@   !!@  !!@   !!@  !!@ !!@@      !!@\n            :!:   :!:     :!: :!:    :!:  :!:  :!:  :!:! :!   :!:\n             ::    ::      ::::       ::   ::  :::   ::::      ::\n                                               :::\n                    ~ Marcus Miller - Live &amp; More [1998] ~   \n                                           :::\n                                          :::\n\n\n                  1.  [ 2:25] Intro\n\n                  2.  [ 9:12] Panther\n\n                  3.  [10:57] Tutu\n\n                  4.  [12:41] Funny (All She Needs Is Love)\n\n                  5.  [ 3:55] Strange Fruit\n\n                  6.  [ 5:32] Summertime\n\n                  7.  [ 8:15] Maputo\n\n                  8.  [ 9:00] People Make the World Go Round\n\n                  9.  [ 4:52] Sophie [*]\n\n                  10. [ 5:44] Jazz in the House [*]\n\n                      *SPECIAL BONUS STUDIO TUNES\n\n\n\nLIVE &amp; MORE was nominated for a 1999 Grammy for Best Contemporary Jazz Album.\n\n\nBassist/composer/bandleader Marcus Miller is the kind of artist Ellington used to call &quot;beyond category,&quot; so original he created a new paradigm in which to work. His style is an amalgam of funk, jazz, rock, R&amp;B that embraces aspects of all these traditions without sticking to any of them. While some of his studio efforts have tended towards the slick, he really lets his hair down on this album, recorded live in 1996, mostly in Japan. Though heavyweights like Kenny Garrett and Hiram Bullock make their mark on the arrangements, it's Miller who carries much of the weight as few other bassists can. He moves deftly from jazzy, melodic statements to popping, slapping funk lines without batting an eyelash. In addition to tackling the tunes he wrote for his own albums, Miller revisits his illustrious past with a version of the title tune he composed for Miles Davis' TUTU, and he makes warhorses such as &quot;Summertime&quot; and &quot;Strange Fruit&quot; uniquely his own.\n\n\nLive tracks recorded at The Montreux Jazz Festival, Montreux, Switzerland; The Blue Note, Osaka, Japan; The Blue Note, Tokyo, Japan; The Blue Note, Fukyoka, Japan; Studio tracks recorded at Camel Island and West Lake Studios, Los Angeles, California. Includes liner notes by Marcus Miller.\n\n\nPersonnel: Marcus Miller (vocals, guitar, bass clarinet, soprano saxophone, keyboards, vocoder, tambourine); Lalah Hathaway (vocals, background vocals); David &quot;E-Man&quot; Ward (guitar, keyboards, vocoder, drums, percussion); David Delhomme (guitar, keyboards); Dean Brown , Drew Zingg, Hiram Bullock (guitar); Kenny Garrett (soprano saxophone); Everette Harp, Roger Byam (tenor saxophone); Michael &quot;Patches&quot; Stewart (trumpet, flugelhorn); Bernard Wright (keyboards, keyboard bass); Lenny White, Poogie Bell (drums).\n\n\nAudio Mixers: David J. Ward II; Paul Mitchell.\n\n\nRecording information: Blue Note Osaka (07/1996-10/1996); Blue Note Tokyo (07/1996-10/1996); Blue Notes Fukuoka (07/1996-10/1996); Catalina Bar And Grill, LA, CA (07/1996-10/1996); Montreux Ja (07/1996-10/1996).\n\n\nPhotographers: Yukito Hosono; Fredrick Nilsen.\n\n\nUnknown Contributor Role: Kenny Garrett.\n\n\nPersonnel: Marcus Miller (vocals, soprano saxophone, bass clarinet, keyboards, vocoder, guitar, bass, tambourine); Lalah Hathaway (vocals); Kenny Garrett (soprano &amp; alto saxophones); Everette Harp, Roger Byam (tenor saxophone); Michael &quot;Patches&quot; Stewart (trumpet, flugelhorn); David Ward (keyboards, guitar, drums, percussion, sound effects); Dave Delhomme (keyboards, guitar); Bernard Wright (keyboards); Hiram Bullock, Dean Brown, Drew Zingg (guitar); Poogie Bell, Lenny White (drums).","torrent":{"xt":"urn:btih:fc4a84d23fb5840de8386700f8296271d926a241","amp;dn":"Marcus+Miller+-+Live+%26amp%3B+More+1998-trother","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc4a84d23fb5840de8386700f8296271d926a241","infoHashBuffer":{"type":"Buffer","data":[252,74,132,210,63,181,132,13,232,56,103,0,248,41,98,113,217,38,162,65]},"announce":[],"urlList":[]}}