{"title":"Cher Warner Brothers WAVE LOSSLESS Final Update","uid":6703583,"size":1717543665,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fe4070f7ca8b5533965f69e2040964ce14f8c71e&amp;dn=Cher+Warner+Brothers+WAVE+LOSSLESS+Final+Update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Bisk8erboi","files":52,"time":1317072688,"description":"Stars\nI\\\\\\'d Rather Believe In You\nCherished\nTwo The Hard Way\nYou\\\\\\'re Not Right For Me/Wrong Number (Single)\nBaby I Love you/A Woman\\\\\\'s Story (Single)\nA Love Like Yours Don\\\\\\'t Come Knockin/Some Guys (Single)\n\nI have ripped every warner mint lp and all 45\\\\\\'s Baby I Love You, A Womans Story, A Love Like Yours (DonÃƒÂ­t Come Knockin Every Day), and the final Sonny &amp; Cher SIngles Youre Not Right For Me and Wrong Number.ÃƒÂ® All rips will be released as LOSSLESS WAVES. I will not edit the sound by amplifying it or filtering noise as the albums and 45s are mint anyway. People who play with tools fuck up the original sound by trying to remove surface noise off of a crappy record. I think Pirate may have some light surface noise in the beginning.. kinda like Madonnas Erotica. This will be the COMPLETE and FINAL Warner release I upload this being the fifth over the last few years. This is as close to the original master tapes as weÃƒÂ­re gonna get. \n\nAnd LOVE SONG will never be included as it was never released on a 45. It was a live track.. not a deleted song from Stars. Every other track mentioned in the reissue theory is available here as lossless wave. IÃƒÂ­ve uploaded this numerous times as mp3 and I kept getting requests for waves.. so why not it sounds ALOT better wow even to me. Oh, there never was a ÃƒÂ­d Rather Believe In You with Pirate as the initial beginning track. Pirate was produced by Snuff Garrett, and Michael Omartian produced ÃƒÂ¬Believe In You.ÃƒÂ® People who make this claim have never provided evidence.. its said just to keep spreading a dumb rumor. And no edition of Cherished was issued as Images in ANY country.\n\n\nAs Geffen was owned by Warner during 1988 \\\\\\&quot;Some Guys\\\\\\&quot; has still yet not seen a CD Release. Not.Com.Mercial recieved a bonus track from the far past to compliment the set list. In this event however Some Guys from a future Warner release is making a WAVE inclusion on Two The Hard way to be a BONUS track.\n\n\nThis rip was inspired by Cher of course, Jackie and Anna (Old Pals from Vienna Austria on Cherworld.com) and Erick D from Holland.. Love you guys.","torrent":{"xt":"urn:btih:fe4070f7ca8b5533965f69e2040964ce14f8c71e","amp;dn":"Cher+Warner+Brothers+WAVE+LOSSLESS+Final+Update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe4070f7ca8b5533965f69e2040964ce14f8c71e","infoHashBuffer":{"type":"Buffer","data":[254,64,112,247,202,139,85,51,150,95,105,226,4,9,100,206,20,248,199,30]},"announce":[],"urlList":[]}}