{"title":"Driver: San Francisco (2011) Repack","uid":6699586,"size":10385031168,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:feb8093c8e4df41ef03f1b8bdcb9617c03459472&amp;dn=Driver%3A+San+Francisco+%282011%29+Repack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"itchypitchy","files":-1,"time":1316910788,"description":"Repacked version with built-in crack.\n\n\nScreenshots:\n &lt;a href=&quot;\nhttp://bayimg.com/cAKAJAADd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cAKAJAADd&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/caKakaADd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/caKakaADd&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/cAKALaAdd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cAKALaAdd&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/cAkaMaaDd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cAkaMaaDd&lt;/a&gt;\n\n\n\nDriver San Francisco-SKIDROW\nDriver: San Francisco (c) Ubisoft\n\n24-09-2011........Release Date - Protection.........Ubisoft DRM\n\nRELEASE NOTES\n\nWith crime lord Charles Jericho now on the loose, San Francisco faces a\nterrible threat. Only one man can stand against him. He has driven the\nstreets of a hundred cities and spent his whole life putting criminals\nbehind bars. But to take Jericho down, there can be no turning back,\nand he knows that this may very well be his last ride. His name is\nJohn Tanner. He is the DRIVER.\n\nDeveloped by Ubisoft Reflections, creators of the original DRIVER\ntitle, DRIVER SAN FRANCISCO is the return of the established action\ndriving video game series that has sold 14 million copies worldwide.\nPlayers will race through the iconic streets of San Francisco and\nbeyond in the largest open-world environment to date spanning over\n200 square miles.\n\nAn innovative gameplay feature enables players to seamlessly SHIFT\nbetween over 130 licensed muscle and super cars to keep them constantly\nin the heart of the action. With its timeless atmosphere, unique car\nhandling and renewed playability, DRIVER SAN FRANCISCO revitalizes the\nclassic free-roaming, cinematic car chase experience for the current\ngeneration of video game platforms.\n\nFeatures\n\nTHE TRUE CAR CHASE EXPERIENCE\nRediscover the cinematic driving sensations of DRIVER: loose\nsuspension, long drifts, Hollywood-style crashes and high-speed\npursuits in dense traffic. Drive over 130 fully destructible muscle\nand super cars with realistic handling and customization features that\ntake fast-action driving to the next level.\n\nRELENTLESS MANHUNT\nUncover a thrilling character-driven storyline in which personal\nrevenge fuels Tanners relentless manhunt for Jericho. Follow Tanner's\nsurvival race across San Francisco and beyond to discover how this\nchase will bring him to a point of no return.\n\nSHIFT\nAs Tanner recovers from a terrible crash, he realizes he has acquired\na new ability, SHIFT, enabling him to instantly change vehicles and\ntake control. Experience unprecedented intensity, diversity and\nfreedom SHIFT into a faster car, deploy civilian vehicles to destroy\nyour enemies and even take control of your opponents car to force\ntheir demise. SHIFT also allows for thrilling new Multi-player modes\nwithin the game.\n\nA CAR CHASE PLAYGROUND\nDrive on more than 200 square miles of road network, over the Golden\nGate Bridge, and through iconic locations of San Francisco. SHIFT from\none car to the next and dip into the lives of different residents,\na-spinning array of characters, each with a unique perspective on a\ncity under siege.\n\nMULTIPLAYER MAYHEM\nExperience 11 different addictive multi-player modes, including 6\non-line modes where the SHIFT feature allows players to be anywhere at\nany time.\n\nAND MORE\nRecord your best stunts and chases with the Director replay mode to\nedit and share your movies. Test your driving skills with 20\nchallenging races and 80 dares spread all across the city. Listen to\nover 60 music tracks with songs from famous artists, not to mention the\noriginal memorable DRIVER theme.\n\nINSTALL NOTES\n\n1. Install\n2. In C:\\Users\\USERNAME\\AppData\\LocalUbisoft\\Game Launcher delete\nsettings.yml before u start the game for the first time\n3. Play the game\n4. Support the companies, which software you actually enjoy","torrent":{"xt":"urn:btih:feb8093c8e4df41ef03f1b8bdcb9617c03459472","amp;dn":"Driver%3A+San+Francisco+%282011%29+Repack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"feb8093c8e4df41ef03f1b8bdcb9617c03459472","infoHashBuffer":{"type":"Buffer","data":[254,184,9,60,142,77,244,30,240,63,27,139,220,185,97,124,3,69,148,114]},"announce":[],"urlList":[]}}